[
  {
    "channel_title":"NPR",
    "video_id":"WklgoVjhcMo",
    "title":"Harvard President Alan Garber responds to DHS statement",
    "description":"“Let this serve as a warning…” is part of a line from a Department of Homeland Security statement blocking Harvard University from enrolling international students because it says “Harvard’s leadership has created an unsafe campus environment by permitting anti-American, pro-terrorist agitators to harass and physically assault individuals, including many Jewish students, and otherwise obstruct its once-venerable learning environment.”\nThe warning is “to all universities and academic institutions across the country,” per DHS.\n\n“Well, they said it and I have to believe it and I've repeated it myself, and that is how it's understood by the other leaders of other universities that I've spoken to. It is a warning. They see this as a message that if you don't comply with what we're demanding, these will be the consequences,” Harvard President Alan Garber told Morning Edition host Steve Inskeep.",
    "publishedAt":"2025-05-31T17:30:07Z",
    "duration_iso":"PT1M26S",
    "duration_seconds":86,
    "duration_hms":"0:01:26",
    "url":"https:\/\/www.youtube.com\/watch?v=WklgoVjhcMo"
  },
  {
    "channel_title":"NPR",
    "video_id":"p01oYpzQkKg",
    "title":"Scientists believe they may have the first recording of a shark actively making noise",
    "description":"Scientists believe they may have the first recording of a shark actively making noise.",
    "publishedAt":"2025-05-31T12:01:22Z",
    "duration_iso":"PT57S",
    "duration_seconds":57,
    "duration_hms":"0:00:57",
    "url":"https:\/\/www.youtube.com\/watch?v=p01oYpzQkKg"
  },
  {
    "channel_title":"NPR",
    "video_id":"hxdPT7bfvxU",
    "title":"Hollywood stars make this Broadway season a record breaker",
    "description":"With the Tony Awards scheduled for next weekend — Sunday, June 8 — Broadway has officially wrapped up a record-breaking season, bringing in $1.89 billion in box office grosses and a total attendance of 14.7 million — signs that Broadway seems to have recovered from its drought triggered by the COVID-19 pandemic.\n\nFive years ago, Broadway theaters were shuttered and, after an 18-month pause, box office sales and attendance numbers began their slow rebound. But this past season, Broadway posted its highest box office numbers to date — even if attendance was slightly behind the last season before the pandemic.\n\nThe numbers are partly due to the box office bonanza of a few high-profile productions of plays featuring big Hollywood stars — among them: Denzel Washington and Jake Gyllenhall (Othello), George Clooney (Good Night, and Good Luck) and Kieran Culkin (Glengarry Glen Ross). Those plays brought in more money in most weeks this season than big musicals like Wicked, Hamilton and The Lion King.",
    "publishedAt":"2025-05-31T11:01:12Z",
    "duration_iso":"PT1M",
    "duration_seconds":60,
    "duration_hms":"0:01:00",
    "url":"https:\/\/www.youtube.com\/watch?v=hxdPT7bfvxU"
  },
  {
    "channel_title":"NPR",
    "video_id":"mIb9Ru2qqY8",
    "title":"Harvard President Alan Garber talks to NPR about the Trump administration's cuts to research funds",
    "description":"Over the last several weeks, the Trump administration has terminated or clawed back billions of dollars in contracts and multiyear grants Harvard University received. Some of that money went towards funding research.\n\n“Sure, it hurts Harvard but it hurts the country,” Harvard President Alan Garber told Morning Edition host Steve Inskeep. Garber stresses research institutions and universities don’t see this type of funding as a “gift” – but an investment in the work the federal government deems as essential.",
    "publishedAt":"2025-05-30T23:30:16Z",
    "duration_iso":"PT43S",
    "duration_seconds":43,
    "duration_hms":"0:00:43",
    "url":"https:\/\/www.youtube.com\/watch?v=mIb9Ru2qqY8"
  },
  {
    "channel_title":"NPR",
    "video_id":"FGi9KWF8J_Q",
    "title":"Budget reconciliation may not be catchy, but it's been a vital tool for many presidents",
    "description":"Budget reconciliation may not be catchy, but it's been a vital tool for many presidents, including Ronald Reagan, whose first federal budget was a watershed in the history of federal fiscal policy.",
    "publishedAt":"2025-05-30T22:30:09Z",
    "duration_iso":"PT2M32S",
    "duration_seconds":152,
    "duration_hms":"0:02:32",
    "url":"https:\/\/www.youtube.com\/watch?v=FGi9KWF8J_Q"
  },
  {
    "channel_title":"NPR",
    "video_id":"rQuY93v9pWg",
    "title":"White House calls RFK Jr. report's nonexistent sources 'formatting issues'",
    "description":"A report from the nonprofit news outlet NOTUS is questioning the findings of a federal health report. Health Secretary Robert F. Kennedy Jr. released the study from the \"Make America Healthy Again\" commission, but the report from NOTUS cites problems that include misstated findings and several cited studies that apparently don't exist at all.\n\nWhite House press secretary Karoline Leavitt dismissed the criticisms: \"I understand there was some formatting issues with the MAHA report that are being addressed and the report will be updated, but it does not negate the substance of the report, which, as you know, is one of the most transformative health reports that has ever been released by the federal government.\"\n\nKennedy has repeatedly said he would bring \"radical transparency\" and \"gold-standard\" science to the public health agencies, but the secretary refused to release details about who authored the 72-page report, which calls for increased scrutiny of the childhood vaccine schedule and describes the nation's children as overmedicated and undernourished.\n\nThe NOTUS report found the commission's study also had broken web links, missing or incorrect authors, and an entry where the report references itself as the only scientific citation.",
    "publishedAt":"2025-05-30T21:30:09Z",
    "duration_iso":"PT55S",
    "duration_seconds":55,
    "duration_hms":"0:00:55",
    "url":"https:\/\/www.youtube.com\/watch?v=rQuY93v9pWg"
  },
  {
    "channel_title":"NPR",
    "video_id":"1IqT07u0nTo",
    "title":"13-year-old Faizan Zaki wins the Scripps National Spelling Bee",
    "description":"This year’s winner of the Scripps National Spelling Bee is 13-year-old Faizan Zaki, of Dallas, Texas, whose winning word was \"éclaircissement,\" a French word that means clarification, explanation or enlightenment.\n\nZaki is the 100th winner of the bee and last year's runner-up. The first competition was held in 1925 in Washington, D.C., and only nine kids participated, according to Scripps. Eleven-year-old Frank Neuhauser won $500 in gold pieces. This year, more than 200 students competed, and for making it to the end, Zaki took home more than $50,000, a medal, trophy and reference library.",
    "publishedAt":"2025-05-30T20:30:01Z",
    "duration_iso":"PT41S",
    "duration_seconds":41,
    "duration_hms":"0:00:41",
    "url":"https:\/\/www.youtube.com\/watch?v=1IqT07u0nTo"
  },
  {
    "channel_title":"NPR",
    "video_id":"0BFangGq86I",
    "title":"White House Dismisses Issues In 'Make America Healthy Again' Report | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:15 Court Restores Trump’s Tariffs\n1:15 Trump To Mark Musk's Last Day\n2:17 Issues In 'Make America Healthy Again' Report\n3:09 Crypto Investor Indicted On Kidnapping Charge\n3:30 Trump Travels To Pittsburgh Today\n4:24 New Aid Program In Gaza Still Mired In Chaos\n4:49 Harvard Can Enroll International Students\n5:40 Trump Commutes Larry Hoover's Sentences\n6:36 Faizan Zaki Wins The Scripps Spelling Bee\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Anna Moneymaker \/ Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #crypto #spellingbee",
    "publishedAt":"2025-05-30T14:38:10Z",
    "duration_iso":"PT7M20S",
    "duration_seconds":440,
    "duration_hms":"0:07:20",
    "url":"https:\/\/www.youtube.com\/watch?v=0BFangGq86I"
  },
  {
    "channel_title":"NPR",
    "video_id":"YCsrACSR6tk",
    "title":"1 person missing after huge glacier collapses in Switzerland",
    "description":"Part of the Birch Glacier has collapsed in Switzerland, burying a mountainside village under tons of rock and ice. Earlier this month, authorities evacuated the village's residents to safety, but at least one person is missing.\n\nSwiss authorities say it’s one of the largest mass movements of earth ever seen in Switzerland.",
    "publishedAt":"2025-05-29T16:15:04Z",
    "duration_iso":"PT20S",
    "duration_seconds":20,
    "duration_hms":"0:00:20",
    "url":"https:\/\/www.youtube.com\/watch?v=YCsrACSR6tk"
  },
  {
    "channel_title":"NPR",
    "video_id":"lIGVPJZo5uE",
    "title":"Federal Trade Court Blocks Trump's Sweeping Tariffs | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:16 Trade Court Blocks Trump's Tariffs\n1:09 Trump Weighing New Pardons\n2:02 Rubio Threatens Chinese Students' Visas\n2:56 Judge: Rubio Likely Wrong In Khalil Case\n3:56 HHS Cancels Plans For Bird Flu Vaccine\n4:40 NAD Suing The White House\n5:46 Israel Angry With The U.N.\n6:44 Huge Glacier Collapses In Switzerland\n7:03 Broadway Enjoys Record-Breaking Season\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photos:\nSaul Loeb \/ AFP via Getty Images\nAndrew Harnik \/ Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #harvard #gaza",
    "publishedAt":"2025-05-29T14:47:31Z",
    "duration_iso":"PT8M7S",
    "duration_seconds":487,
    "duration_hms":"0:08:07",
    "url":"https:\/\/www.youtube.com\/watch?v=lIGVPJZo5uE"
  },
  {
    "channel_title":"NPR",
    "video_id":"uP5GHVUPp50",
    "title":"Protesters in Hungary march against a bill that effectively bans Pride",
    "description":"Critics of Hungary say it is no longer a democracy, but an electoral autocracy. Protesters against a bill that effectively bans Pride next month say this is about more than just LGBTQ+ rights, but also the right to dissent, civil society and a free press.",
    "publishedAt":"2025-05-29T11:01:35Z",
    "duration_iso":"PT52S",
    "duration_seconds":52,
    "duration_hms":"0:00:52",
    "url":"https:\/\/www.youtube.com\/watch?v=uP5GHVUPp50"
  },
  {
    "channel_title":"NPR",
    "video_id":"Qz1btyEJMQc",
    "title":"International students face more thorough social media screening",
    "description":"The State Department is planning to do a more thorough screening of social media posts of foreign students applying for visas — and consulates have been directed not to schedule new student visa interviews until they get further guidance on how the new social media screening will work, according to a diplomatic cable seen by NPR.\n\nState Department spokesperson Tammy Bruce would not comment on the leaked cable.",
    "publishedAt":"2025-05-28T17:00:38Z",
    "duration_iso":"PT45S",
    "duration_seconds":45,
    "duration_hms":"0:00:45",
    "url":"https:\/\/www.youtube.com\/watch?v=Qz1btyEJMQc"
  },
  {
    "channel_title":"NPR",
    "video_id":"JJnc2ZjDCaw",
    "title":"Trump Administration Appeals Pause On Deportations To South Sudan | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:18 U.S. Pauses Visa Interviews For Foreign Students\n1:15 Hundreds Protest At Harvard\n2:01 Administration Appeals Deportations Pause\n2:59 Combs Employee Says She Was Kidnapped\n3:57 Insurance Companies Using Aerial Photos, AI\n4:53 3 Killed, Dozens Injured In New Gaza Aid System\n5:49 Zelenskyy Meets With Germany's Chancellor\n6:41 SpaceX Loses Another Starship Rocket\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Verónica G. Cárdenas \/ AFP via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #harvard #gaza",
    "publishedAt":"2025-05-28T14:45:20Z",
    "duration_iso":"PT7M36S",
    "duration_seconds":456,
    "duration_hms":"0:07:36",
    "url":"https:\/\/www.youtube.com\/watch?v=JJnc2ZjDCaw"
  },
  {
    "channel_title":"NPR",
    "video_id":"t2C6s4PgWq0",
    "title":"Sean Combs on trial: the charges explained",
    "description":"This month, the criminal trial of hip-hop mogul Sean Combs began in New York.\n\nFederal prosecutors charged Combs with racketeering conspiracy, sex trafficking and transportation to engage in prostitution. Combs, who has been in federal custody in Brooklyn since his arrest in September 2024, has pleaded not guilty to all charges. But if he is convicted, he could spend the rest of his life in prison.\n\nTestimony from witnesses who have appeared on the stand so far -- including Combs' ex-girlfriend Cassie Ventura -- have offered graphic, detailed accounts of drug-fueled sexual encounters. But what the prosecution has accused Combs of is broader than that. Here's what this trial is about, and what you can expect as it all plays out.",
    "publishedAt":"2025-05-28T11:01:38Z",
    "duration_iso":"PT3M13S",
    "duration_seconds":193,
    "duration_hms":"0:03:13",
    "url":"https:\/\/www.youtube.com\/watch?v=t2C6s4PgWq0"
  },
  {
    "channel_title":"NPR",
    "video_id":"YjXOXmHPX6c",
    "title":"King Charles speaks to Canada's Parliament amid tensions with Trump",
    "description":"King Charles spoke to Canada’s Parliament today to open its new session. He was the first head of state to do so since his mother, Queen Elizabeth II, in 1977.\n\nCanadian Prime Minister Mark Carney, who was elected on an anti-Trump platform in April, asked the king to visit shortly after he became leader of the Liberal political party. At the time, President Trump had imposed tariffs on Canada and was taunting to annex the country. Carney said the British monarch’s visit underscored the country’s sovereignty — a rebuke to Trump’s repeated declarations that Canada should become his country's 51st state.",
    "publishedAt":"2025-05-27T22:15:04Z",
    "duration_iso":"PT50S",
    "duration_seconds":50,
    "duration_hms":"0:00:50",
    "url":"https:\/\/www.youtube.com\/watch?v=YjXOXmHPX6c"
  },
  {
    "channel_title":"NPR",
    "video_id":"alji0-btHLE",
    "title":"Dozens Injured After A Car Plows Into A Crowd In Liverpool | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:17 Stocks Up After Tariffs Delayed\n1:08 Trump 'Not Happy' About Strikes\n2:12 Dozens Injured In Liverpool\n3:01 NPR Sues Over Executive Order\n3:33 Senate Weighs Budget Bill\n4:28 U.S. Group Bringing Aid To Gaza\n5:25 Military Families Still Displaced\n6:07 3 More Escaped Prisoners Recaptured\n6:32 Scripps National Spelling Bee Begins Today\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Owen Humphreys \/ PA Images via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #gaza #liverpool",
    "publishedAt":"2025-05-27T14:38:31Z",
    "duration_iso":"PT7M30S",
    "duration_seconds":450,
    "duration_hms":"0:07:30",
    "url":"https:\/\/www.youtube.com\/watch?v=alji0-btHLE"
  },
  {
    "channel_title":"NPR",
    "video_id":"ZTWwGAVBfU0",
    "title":"Harvard president says 'sometimes they don’t like what we represent' | Morning Edition | NPR",
    "description":"In an exclusive broadcast interview, Harvard University President Alan Garber tells NPR’s Morning Edition that attempts to bar international students from attending his institution are a “warning” from the Trump administration and that there are people who would like to see major universities like his “brought down.”\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-27T11:04:10Z",
    "duration_iso":"PT17M6S",
    "duration_seconds":1026,
    "duration_hms":"0:17:06",
    "url":"https:\/\/www.youtube.com\/watch?v=ZTWwGAVBfU0"
  },
  {
    "channel_title":"NPR",
    "video_id":"3miQnjjrXUo",
    "title":"Tasmanian devils relocated as flooding hits New South Wales sanctuary",
    "description":"Animals were evacuated from a wildlife sanctuary on May 22 as major flooding rocked eastern New South Wales.\n\n“Aussie Ark’s wildlife sanctuary in the Barrington Tops has been hit by catastrophic flooding, with more than 400 mm of rain falling in just a few days,” the sanctuary said in a statement.\n\n“Wildlife is being carefully relocated to Aussie Ark’s brand-new veterinary block, which is providing a dry and secure environment while enclosures are repaired and weather conditions remain unpredictable.”\n\nThis footage shows carers removing Tasmanian devils from flooded enclosures at Aussie Ark’s Barrington Tops sanctuary.",
    "publishedAt":"2025-05-25T11:00:05Z",
    "duration_iso":"PT28S",
    "duration_seconds":28,
    "duration_hms":"0:00:28",
    "url":"https:\/\/www.youtube.com\/watch?v=3miQnjjrXUo"
  },
  {
    "channel_title":"NPR",
    "video_id":"r84OlWeJszs",
    "title":"The view from the Druze community in the Golan Heights",
    "description":"After the fall of the Assad regime in Syria last December, Israel started striking Syrian military installations and also seized a U.N.-patrolled buffer zone on Syrian territory and began to slowly expand it into Syrian villages. Israel said that all of this was to protect itself from attacks similar to the Hamas-led attacks of October 7, 2023. But now the Israeli government says that the airstrikes are in the name of protecting the Syrian Druze community. NPR's Hadeel Al-Shalchi reports from Shouting Hill, where Druze families on both the Israeli and Syrian sides come to communicate with their families across the border.",
    "publishedAt":"2025-05-24T16:01:18Z",
    "duration_iso":"PT1M16S",
    "duration_seconds":76,
    "duration_hms":"0:01:16",
    "url":"https:\/\/www.youtube.com\/watch?v=r84OlWeJszs"
  },
  {
    "channel_title":"NPR",
    "video_id":"VcgP5pIS3hE",
    "title":"Researchers puzzle over rash of baby monkey kidnappings",
    "description":"A group of monkeys on an island in Panama are stealing babies from another monkey species that lives nearby, seemingly just for kicks, a fad that one researcher called “viscerally disturbing.”\n\nThis island group of capuchin monkeys is known to be inventive — unlike capuchins on the mainland, they use stone tools to break open hard food items. Researchers were studying this tool use with wildlife cameras, and the cameras saw a young male capuchin carrying around a baby from a different species — a howler monkey. The capuchin did this repeatedly, carrying several howler babies until they died; then other immature males in the group started snatching howler babies too.\n\nIn the journal Current Biology, researchers say they believe the kidnappings started as a way to combat boredom on an island that has a lot of food and no predators — they say they can’t see a reason for the kidnappings. The activity they caught on video shows how this species has a strong urge to try new things, and to copy each other.",
    "publishedAt":"2025-05-24T12:00:52Z",
    "duration_iso":"PT1M2S",
    "duration_seconds":62,
    "duration_hms":"0:01:02",
    "url":"https:\/\/www.youtube.com\/watch?v=VcgP5pIS3hE"
  },
  {
    "channel_title":"NPR",
    "video_id":"Sy9UyphBr-E",
    "title":"Artist Agnieszka Pilat is teaching her robot dog to paint",
    "description":"",
    "publishedAt":"2025-05-23T21:00:36Z",
    "duration_iso":"PT1M10S",
    "duration_seconds":70,
    "duration_hms":"0:01:10",
    "url":"https:\/\/www.youtube.com\/watch?v=Sy9UyphBr-E"
  },
  {
    "channel_title":"NPR",
    "video_id":"ejaFhUJKtBY",
    "title":"U.S. Treasury to stop minting new pennies",
    "description":"The U.S. Treasury Department has placed its last order for blank pennies and plans to stop minting the 1 cent coins as soon as that’s exhausted.\n\nThe Trump administration hopes to save big bucks by phasing out the penny. Each one costs nearly 4 cents to produce, so the move is expected to result in immediate savings of $56 million a year. A U.S. Treasury spokeswoman confirmed the decision, which was first reported by the Wall Street Journal.\n\nThe phase out of the penny may force businesses to round prices up or down to the nearest nickel. That’s less of a hassle, though, now that customers pay cash for fewer than one in five transactions.",
    "publishedAt":"2025-05-23T19:00:39Z",
    "duration_iso":"PT46S",
    "duration_seconds":46,
    "duration_hms":"0:00:46",
    "url":"https:\/\/www.youtube.com\/watch?v=ejaFhUJKtBY"
  },
  {
    "channel_title":"NPR",
    "video_id":"2aAE-4HjGYA",
    "title":"Trump Administration Tells Harvard To Stop Enrolling International Students | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:08 Trump Administration Bars Harvard From Enrolling International Students\n1:06 Trump Threatens New Tariffs Against Apple, European Union\n1:41 Supreme Court Gives Trump Power To Fire Key Federal Agency Leaders\n2:44 Deadlocked Supreme Court Blocks First Religious Public School\n3:13 Detained Activist Mahmoud Khalil Asks Immigration Judge For Asylum\n4:15 Family Mourns Israeli Embassy Aides Killed Outside Jewish Museum\n5:10 Minneapolis Marks 5 Years Since Police Killing Of George Floyd\n5:55 Treasury Department To Stop Minting Pennies\n6:41 At Least 3 Dead After Plane Crashes Into San Diego Neighborhood\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Sophie Park\/Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #harvard #penny #supremecourt",
    "publishedAt":"2025-05-23T14:55:56Z",
    "duration_iso":"PT7M39S",
    "duration_seconds":459,
    "duration_hms":"0:07:39",
    "url":"https:\/\/www.youtube.com\/watch?v=2aAE-4HjGYA"
  },
  {
    "channel_title":"NPR",
    "video_id":"ZP7RFf5DHmw",
    "title":"This new book explores how Biden's inner circle kept his mental decline from voters",
    "description":"A new book by CNN’s Jake Tapper and Axios’ Alex Thompson paints a troubling picture of how President Biden's cognitive decline had been evident to his inner circle long before seeking reelection.\n\n\"That was intentional so that they did not realize the extent of the decline,\" Thompson told All Things Considered host Scott Detrow.",
    "publishedAt":"2025-05-22T21:00:39Z",
    "duration_iso":"PT1M14S",
    "duration_seconds":74,
    "duration_hms":"0:01:14",
    "url":"https:\/\/www.youtube.com\/watch?v=ZP7RFf5DHmw"
  },
  {
    "channel_title":"NPR",
    "video_id":"IZJg6JTZuog",
    "title":"International students face a difficult choice: continue protesting the war in Gaza or step back",
    "description":"As the Trump administration has moved aggressively to silence campus criticism of Israel's bombardment of Gaza,  international students across the country say they have had to face a difficult choice: continue protesting or step back.\n\nNPR spoke with two graduate students about their decision to continue speaking out despite the government's aggressive effort to deport pro-Palestinian activists.",
    "publishedAt":"2025-05-22T16:00:30Z",
    "duration_iso":"PT2M4S",
    "duration_seconds":124,
    "duration_hms":"0:02:04",
    "url":"https:\/\/www.youtube.com\/watch?v=IZJg6JTZuog"
  },
  {
    "channel_title":"NPR",
    "video_id":"4eCBcjW5jX4",
    "title":"Trump Administration Officially Accepts Luxury Jetliner From Qatar | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:16 House Passes Budget Bill By A Single Republican Vote\n1:12 Trump Clashes With South African President At White House\n2:12 Trump To Host Exclusive Dinner For Meme Coin Investors\n3:07 Trump Administration Officially Accepts Luxury Jetliner From Qatar\n3:57 Two Israeli Embassy Aides Killed Outside Jewish Museum\n4:34 Northern Gaza Hospitals Collapse After Israeli Bombardment\n5:37 Biden's Cancer Diagnosis Revives Debate Over Prostate Screenings\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Chris Kleponis \/ CNP \/ Bloomberg via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #gaza #qatar #congress",
    "publishedAt":"2025-05-22T15:33:12Z",
    "duration_iso":"PT6M42S",
    "duration_seconds":402,
    "duration_hms":"0:06:42",
    "url":"https:\/\/www.youtube.com\/watch?v=4eCBcjW5jX4"
  },
  {
    "channel_title":"NPR",
    "video_id":"4IXg-48oS7Y",
    "title":"U.S. Ambassador Huckabee is 'outraged' at European leaders for condemning Israel",
    "description":"Some of Israel’s closest allies are harshly criticizing the country. The leaders of the UK, France and Canada are calling on Israel to end its latest military offensive in Gaza. The European Union is reconsidering its political and economic ties with Israel. But U.S. Ambassador to Israel Mike Huckabee says such criticism is misguided.",
    "publishedAt":"2025-05-22T15:00:06Z",
    "duration_iso":"PT1M30S",
    "duration_seconds":90,
    "duration_hms":"0:01:30",
    "url":"https:\/\/www.youtube.com\/watch?v=4IXg-48oS7Y"
  },
  {
    "channel_title":"NPR",
    "video_id":"YEgXzYOaJ58",
    "title":"Despite a ceasefire, families in Kashmir wonder if their homes are safe",
    "description":"Earlier this month, thousands of residents from border towns fled amidst the worst fighting between India and Pakistan in decades. After the two countries agreed to a truce, residents are returning to their homes, and wondering what their future will look like.",
    "publishedAt":"2025-05-21T19:30:05Z",
    "duration_iso":"PT1M14S",
    "duration_seconds":74,
    "duration_hms":"0:01:14",
    "url":"https:\/\/www.youtube.com\/watch?v=YEgXzYOaJ58"
  },
  {
    "channel_title":"NPR",
    "video_id":"C5A6ydOAnY8",
    "title":"Noem criticized for getting the meaning of habeas corpus wrong",
    "description":"Homeland Security Director Kristi Noem, under sharp questioning from Democratic senators during a Tuesday hearing, where she was asked to define \"habeas corpus,\" incorrectly replied: \"Habeas corpus is a constitutional right that the president has to be able to remove people from this country.\"\n\nIn reality, habeas corpus is a bedrock constitutional legal principle that safeguards individuals from unlawful imprisonment by enabling them to petition the court to review the legality of their detention.\n\nSen. Maggie Hassan, D-N.H., argued \"habeas corpus is the foundational right that separates free societies like America from police states like North Korea.\" She then pressed Noem, asking whether she supports \"the core protection\" of habeas corpus — that the government must present a public justification to detain or imprison someone. Noem said she does, but insisted the president can suspend it whenever he wants. Hassan argued it can only be suspended with Congress' approval.",
    "publishedAt":"2025-05-21T18:30:11Z",
    "duration_iso":"PT1M4S",
    "duration_seconds":64,
    "duration_hms":"0:01:04",
    "url":"https:\/\/www.youtube.com\/watch?v=C5A6ydOAnY8"
  },
  {
    "channel_title":"NPR",
    "video_id":"ejDjvcol7Zo",
    "title":"Trump Unveils Plans For 'Golden Dome' Missile Defense System | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:18 Trump Warns House Republicans Against Not Supporting Budget Bill\n1:21 Noem Gets Habeas Corpus Wrong\n2:25 Judge Questions Government About Deportations\n3:24 Israel Allows Some Aid Into Gaza\n4:25 Trump Unveils Plans For 'Golden Dome'\n5:00 NWS Offices To Pause Around-The-Clock Staffing\n5:55 Fortnite Returns To Apple’s App Store\n6:50 Indianapolis Motor Speedway Hosts The Wienie 500\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Chris Kleponis \/ CNP \/ Bloomberg via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #kristinoem #fortnite",
    "publishedAt":"2025-05-21T14:55:45Z",
    "duration_iso":"PT7M16S",
    "duration_seconds":436,
    "duration_hms":"0:07:16",
    "url":"https:\/\/www.youtube.com\/watch?v=ejDjvcol7Zo"
  },
  {
    "channel_title":"NPR",
    "video_id":"pMVhNRjbkTQ",
    "title":"This new book explores how Biden's inner circle kept his mental decline from voters",
    "description":"Even though President Biden insisted he was capable of serving and winning a second term, his inner circle went to great lengths to hide that he wasn't.\n\nThat's according to a new book by CNN's Jake Tapper and Axios' Alex Thompson, which chronicles what they report was Biden's cognitive decline and the efforts to keep that hidden from voters.\n\n\"He still thinks he could have won,\" Jake Tapper told All Things Considered host Scott Detrow.",
    "publishedAt":"2025-05-20T17:30:12Z",
    "duration_iso":"PT36S",
    "duration_seconds":36,
    "duration_hms":"0:00:36",
    "url":"https:\/\/www.youtube.com\/watch?v=pMVhNRjbkTQ"
  },
  {
    "channel_title":"NPR",
    "video_id":"G1kXJCiLsak",
    "title":"New book alleges Biden aides hid his decline | All Things Considered | NPR",
    "description":"NPR's Scott Detrow speaks with CNN's Jake Tapper and Axios' Alex Thompson about their new book, \"Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again.\"\n\nHost: Scott Detrow\nProducer: Tyler Bartlam\nEditor: Courtney Dorning\nVideographer: Bronson Arcuri\nEngineer: Tiffany Viera Castro\nVideo Editor: Grace Raver\nExecutive Producer: Sami Yenigun\n\n\n• Read or listen for more: This new book explores how Biden's inner circle kept his mental decline from voters (https:\/\/www.npr.org\/2025\/05\/19\/nx-s1-5309451\/biden-health-decline-original-sin)\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-20T17:05:00Z",
    "duration_iso":"PT27M18S",
    "duration_seconds":1638,
    "duration_hms":"0:27:18",
    "url":"https:\/\/www.youtube.com\/watch?v=G1kXJCiLsak"
  },
  {
    "channel_title":"NPR",
    "video_id":"y7HXMQg3hPc",
    "title":"U.S.-funded clinics in Zambia shuttered, leaving patients scrambling to get their medications",
    "description":"U.S.-funded clinics in Zambia offered free HIV\/AIDS drugs to over 100,000 patients across the country. Public health experts say it was a great way to get healthcare to a lot of people for a low cost.\n\nThe Trump Administration has dramatically scaled back U.S. foreign aid to align with its America first agenda, and as a result many of the clinics were suddenly shuttered. That left many patients scrambling to get their medications, including 16-year old Catherine Mwaloe, who has been HIV positive since birth.\n\nHer grandmother, who has the same name, says Catherine has been grappling with why she has to take her HIV medication. \"It's been very difficult to get her to accept her situation. She says, 'What is it that I have done to get this illness?'\"\n\nNow, Catherine is struggling with where to find her medications. \"I've heard that... many millions of people going to die.\" She fears she will be one of them.",
    "publishedAt":"2025-05-20T16:30:21Z",
    "duration_iso":"PT2M48S",
    "duration_seconds":168,
    "duration_hms":"0:02:48",
    "url":"https:\/\/www.youtube.com\/watch?v=y7HXMQg3hPc"
  },
  {
    "channel_title":"NPR",
    "video_id":"piKwM5qhwVI",
    "title":"Trump suggests Biden withheld cancer diagnosis",
    "description":"President Trump suggested — without evidence — Monday that former President Joe Biden had delayed sharing his diagnosis of prostate cancer. Trump — who initially had been gracious after Biden first announced his diagnosis on Sunday, calling the news “very sad” — quickly pivoted on Monday to accusing Biden of hiding the information about his cancer.\n\nWhen asked for a comment on the diagnosis at an event at the White House on Monday, Trump told reporters he was “surprised that the public wasn’t notified a long time ago because to get to Stage 9, that’s a long time.”\n\nTrump appeared to conflate the Gleason score — a measurement of how aggressive cancer cells appear to be — with the stage of Biden’s cancer. Biden’s Gleason score was 9, indicating it is aggressive. He has Stage 4 cancer, the most serious of the four stages. (There is not a Stage 9 cancer.)",
    "publishedAt":"2025-05-20T15:30:25Z",
    "duration_iso":"PT45S",
    "duration_seconds":45,
    "duration_hms":"0:00:45",
    "url":"https:\/\/www.youtube.com\/watch?v=piKwM5qhwVI"
  },
  {
    "channel_title":"NPR",
    "video_id":"GMU9lkBpGvQ",
    "title":"Trump Suggests Biden Delayed Sharing His Cancer Diagnosis | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:18 Trump Suggests Biden Delayed Sharing His Diagnosis\n1:13 Zelenskyy Awaits Word From Russia\n2:08 Trump Meets With House Republicans\n2:53 N.J. Congresswoman Charged\n3:36 Trump Administration Limiting SNAP Benefits\n4:26 NTSB Investigating Brooklyn Bridge Collision\n5:08 Search Continues For New Orleans Jail Escapees\n5:46 'Sesame Street' Will Stream On Netflix\n6:01 Peppa Pig Has A New Little Sister, Evie\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Kenny Holston \/ Pool \/ Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#biden #trump #sesamestreet",
    "publishedAt":"2025-05-20T14:56:34Z",
    "duration_iso":"PT6M17S",
    "duration_seconds":377,
    "duration_hms":"0:06:17",
    "url":"https:\/\/www.youtube.com\/watch?v=GMU9lkBpGvQ"
  },
  {
    "channel_title":"NPR",
    "video_id":"8efHyRAbC7Q",
    "title":"What's the environmental impact of AI?",
    "description":"What's the environmental impact of AI?\n\nEditor's Note: Google, Microsoft, Amazon, and Meta are all financial supporters of NPR. Amazon also pays to distribute some of NPR’s content.",
    "publishedAt":"2025-05-20T10:00:23Z",
    "duration_iso":"PT1M10S",
    "duration_seconds":70,
    "duration_hms":"0:01:10",
    "url":"https:\/\/www.youtube.com\/watch?v=8efHyRAbC7Q"
  },
  {
    "channel_title":"NPR",
    "video_id":"7C6TusVFfeQ",
    "title":"2 dead, 22 injured after Mexican naval ship strikes the Brooklyn Bridge",
    "description":"At least two people were killed and 22 others were injured after a tall ship belonging to the Mexican Navy struck the Brooklyn Bridge over the weekend.\n\nThe boat, which arrived in New York on Thursday, was sailing as part of a training cruise to celebrate Mexico’s independence, and was scheduled to visit 22 ports in 15 countries. The vessel had come from Cozumel, Mexico, and was bound for Reykjavik, Iceland, next, according to Mexican officials.\n\nCity officials said the ship, the Cuauhtémoc, struck the bridge shortly before 8:30 p.m. Saturday after losing power. The ship’s two tall masts snapped off when it hit the 140-year-old suspension bridge as drivers sped by in either direction. In one video clip, crew members can be seen hanging onto ropes after the masts were severed.",
    "publishedAt":"2025-05-19T15:15:00Z",
    "duration_iso":"PT30S",
    "duration_seconds":30,
    "duration_hms":"0:00:30",
    "url":"https:\/\/www.youtube.com\/watch?v=7C6TusVFfeQ"
  },
  {
    "channel_title":"NPR",
    "video_id":"gICwqzyDWlc",
    "title":"Pope Leo Meets With Vance, Rubio At The Vatican | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:03 Storms Kill At Least 28 In The U.S.\n1:09 Biden Diagnosed With Prostate Cancer\n1:26 Bessent Admits Tariffs May Raise Prices\n2:33 Pope Leo Meets With Vance\n3:35 House Advances Budget Bill\n4:26 Israel Plans To Allow More Food Into Gaza\n5:31 NJ Transit Union Reaches Deal, Ending Strike\n6:29 Search Continues For 7 Prisoners\n7:07 Austria's JJ Wins Eurovision\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Vatican Media via AP\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#biden #eurovision2025 #gaza",
    "publishedAt":"2025-05-19T14:39:20Z",
    "duration_iso":"PT7M25S",
    "duration_seconds":445,
    "duration_hms":"0:07:25",
    "url":"https:\/\/www.youtube.com\/watch?v=gICwqzyDWlc"
  },
  {
    "channel_title":"NPR",
    "video_id":"MHUO0d_Y7nY",
    "title":"Can you solve this week's Sunday puzzle? Featuring Ayesha Rascoe and Will Shortz",
    "description":"Ayesha Rascoe plays the puzzle with Tom R. of Chambersburg, Pennsylvania, and Weekend Edition Puzzlemaster Will Shortz.\n\nYou can play the Sunday Puzzle, too! Name a popular magazine. Rearrange its letters. Then add an O at the end and you'll name a prominent subject in this magazine's current issue. What magazine is it? Hint: You don't need to read this magazine in order to guess the answer.\n\nSubmit correct answers at npr.org\/puzzle by Thursday at 3 p.m. ET to win a chance to play the on-air puzzle.",
    "publishedAt":"2025-05-18T10:00:29Z",
    "duration_iso":"PT2M36S",
    "duration_seconds":156,
    "duration_hms":"0:02:36",
    "url":"https:\/\/www.youtube.com\/watch?v=MHUO0d_Y7nY"
  },
  {
    "channel_title":"NPR",
    "video_id":"yLhcS5rzXZ4",
    "title":"Florida bracing for record amount of smelly seaweed",
    "description":"People going to the beach in Florida this year will need to watch out for record levels of smelly seaweed called sargassum.\n\nResearchers say there’s been a record amount of it in the Atlantic Ocean this year. It’s piling up on beaches, and it could turn away tourists. The seaweed has already been seen in the Caribbean islands and in Mexico.\n\nIn the open sea, healthy patches of sargassum can soak up carbon dioxide and serve as a critical habitat for fish, crabs, shrimp, turtles and birds. But if sargassum moves closer to the coast, the seaweed can wreak havoc on local ecosystems, smothering coral reefs and altering the water's pH balance.\nSargassum begins to rot after about 48 hours on land, releasing irritants like hydrogen sulfide, a hazard to anyone with respiratory issues like asthma.",
    "publishedAt":"2025-05-17T13:01:41Z",
    "duration_iso":"PT19S",
    "duration_seconds":19,
    "duration_hms":"0:00:19",
    "url":"https:\/\/www.youtube.com\/watch?v=yLhcS5rzXZ4"
  },
  {
    "channel_title":"NPR",
    "video_id":"_EvD8ExqiXI",
    "title":"The all-female free divers of Jeju Island have a 'superpower' in their genes",
    "description":"A group of female free divers known for fishing in the frigid ocean waters off South Korea’s Jeju Island — and the adaptations that make their dives possible — have been the subject of research lately.\n\nWhen researchers asked the Haenyeos to dunk their faces in cold water, their heart rates dropped more than non-divers due to a lifetime of training. When it comes to genetics, though, everyone on the island — Haenyeos and non-Haenyeos alike — basically had the same genes, including two that stood out: one related to cold tolerance and another related to blood pressure, which may offer protection from preeclampsia and other conditions like stroke.\n\nMelissa Ilardo, an evolutionary geneticist at the University of Utah, says the Haenyeos’ extreme diving has changed not just their bodies, but those of everyone else on this island who are descended from divers.\n\n“Wouldn’t it be amazing,” Ilardo posed to NPR, “if we can translate these findings to develop a therapeutic that protects people from stroke around the world?”",
    "publishedAt":"2025-05-17T11:00:56Z",
    "duration_iso":"PT1M2S",
    "duration_seconds":62,
    "duration_hms":"0:01:02",
    "url":"https:\/\/www.youtube.com\/watch?v=_EvD8ExqiXI"
  },
  {
    "channel_title":"NPR",
    "video_id":"923G49R43C0",
    "title":"Israeli airstrikes have killed more than 300 Palestinians in the past three days",
    "description":"Israel’s military has dramatically intensified its campaign in Gaza, with airstrikes killing at least 300 Palestinians in the past three days, with President Trump still in the region. Israeli officials say the intense bombing is their final warning to Hamas, surrender or they will launch an expanded offensive in Gaza.",
    "publishedAt":"2025-05-16T21:00:14Z",
    "duration_iso":"PT1M23S",
    "duration_seconds":83,
    "duration_hms":"0:01:23",
    "url":"https:\/\/www.youtube.com\/watch?v=923G49R43C0"
  },
  {
    "channel_title":"NPR",
    "video_id":"l5feyfn_7Oc",
    "title":"DeSantis signs law banning fluoride from Florida water systems",
    "description":"Fluoride, a mineral that helps prevents tooth decay, will soon be banned from Florida’s public water systems under a bill signed into law by Florida Gov. Ron DeSantis this week.\n\nDeSantis says the restrictions allow Floridians to choose whether they use fluoride. Health and Human Services Secretary Robert F. Kennedy Jr. has expressed concerns that ingesting fluoride can cause health problems, but dental groups are adamant that low levels of the mineral only have health positives, preventing cavities, especially for those without regular access to care.\n\nFlorida’s ban begins on July 1. A similar law in Utah, the first state to target fluoride, took effect earlier this month.",
    "publishedAt":"2025-05-16T17:15:05Z",
    "duration_iso":"PT49S",
    "duration_seconds":49,
    "duration_hms":"0:00:49",
    "url":"https:\/\/www.youtube.com\/watch?v=l5feyfn_7Oc"
  },
  {
    "channel_title":"NPR",
    "video_id":"RrjOkuSMF9Q",
    "title":"Cassie Ventura's Cross-Examination Continues In Sean Combs' Trial | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:22 Trump Wraps His Trip To The Mideast\n1:17 Ukrainian, Russian Officials Hold Talks\n2:24 Testimony Continues In Combs' Trial\n3:25 DHS Seeks Help With Deportations\n4:01 Colorado Hit With Air Traffic Control Blackout\n4:58 Florida Bans Fluoride From Public Water Systems\n5:47 Oklahoma Implements New Standards\n6:54 WNBA's Season Tips Off Tonight\n7:47 Florida Bracing For Smelly Sargassum\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photos:\nJewel Samad \/ AFP via Getty Images\nJane Rosenberg \/ Reuters\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #fluoride #diddy",
    "publishedAt":"2025-05-16T14:54:52Z",
    "duration_iso":"PT8M5S",
    "duration_seconds":485,
    "duration_hms":"0:08:05",
    "url":"https:\/\/www.youtube.com\/watch?v=RrjOkuSMF9Q"
  },
  {
    "channel_title":"NPR",
    "video_id":"ciRN_voPlW8",
    "title":"Conservative influencers criticize Trump's openness to accept gift from Qatar",
    "description":"President Trump is continuing to signal that he’s open to accepting a $400 million plane from the government of Qatar. It would serve as the president's new Air Force One.\n\nCritics say it presents a host of security and ethical issues, and backlash is even coming from some of Trump’s fellow republicans, including a number of conservative influencers who have taken to social media to openly criticize the move, calling it out of touch, unconstitutional and a quote “stain on the administration.”\n\nPresident Trump has defended his openness to accept the jet — framing it as a money-saver for taxpayers.",
    "publishedAt":"2025-05-15T18:00:40Z",
    "duration_iso":"PT1M3S",
    "duration_seconds":63,
    "duration_hms":"0:01:03",
    "url":"https:\/\/www.youtube.com\/watch?v=ciRN_voPlW8"
  },
  {
    "channel_title":"NPR",
    "video_id":"bW14iPyMI_Y",
    "title":"How do you preserve the nesting site of a sea turtle on one of India's most beautiful shorelines?",
    "description":"Olive Ridley turtles are being protected in an unconventional way in Indian villages like Velas -- by inviting more tourists to come see them.",
    "publishedAt":"2025-05-15T17:00:46Z",
    "duration_iso":"PT1M32S",
    "duration_seconds":92,
    "duration_hms":"0:01:32",
    "url":"https:\/\/www.youtube.com\/watch?v=bW14iPyMI_Y"
  },
  {
    "channel_title":"NPR",
    "video_id":"BjeovEmY6cU",
    "title":"Walmart says Trump's tariffs are forcing it to raise prices",
    "description":"Walmart says it has to raise prices — and the country’s largest retailer is pointing to President Trump’s tariffs as the culprit behind that decision.\n\nExecutives say about two-thirds of Walmart's goods sold in the U.S. are grown, made or assembled domestically. But the retailer still imports from dozens of other countries, especially electronics and toys from China. Speaking to investors after releasing the company's quarterly earnings reports Thursday, CEO Doug McMillon said his company will work to protect food prices as much as possible.",
    "publishedAt":"2025-05-15T15:30:06Z",
    "duration_iso":"PT17S",
    "duration_seconds":17,
    "duration_hms":"0:00:17",
    "url":"https:\/\/www.youtube.com\/watch?v=BjeovEmY6cU"
  },
  {
    "channel_title":"NPR",
    "video_id":"y_tqA293rjg",
    "title":"Despite Backlash, Trump Signals He’s Still Open To Qatar's Plane | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:19 Trump Signals He’s Still Open To Qatar's Plane\n1:21 RFK Jr. Wants Less Money For HHS\n2:19 Walmart Raising Prices\n2:36 U.S.-Backed Group Takes Up Aid Work In Gaza\n3:45 EPA Delaying PFAS Limits\n4:43 Wisconsin Judge To Be Arraigned Today\n5:48 Cassie's Testimony Details Relationship\n6:50 Harvard's Magna Carta Is Real\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Win McNamee \/ Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #walmart #diddy",
    "publishedAt":"2025-05-15T14:26:07Z",
    "duration_iso":"PT7M14S",
    "duration_seconds":434,
    "duration_hms":"0:07:14",
    "url":"https:\/\/www.youtube.com\/watch?v=y_tqA293rjg"
  },
  {
    "channel_title":"NPR",
    "video_id":"cc0ccEP6m2w",
    "title":"Palantir is building a master immigration database for the U.S. government",
    "description":"Elon Musk’s Department of Government Efficiency is teaming up with Palantir. The secretive tech firm behind military AI and other surveillance, is now building a real-time immigration database for the U.S. government. Former employees say it’s a warning sign of creeping authoritarianism.",
    "publishedAt":"2025-05-14T20:00:20Z",
    "duration_iso":"PT2M38S",
    "duration_seconds":158,
    "duration_hms":"0:02:38",
    "url":"https:\/\/www.youtube.com\/watch?v=cc0ccEP6m2w"
  },
  {
    "channel_title":"NPR",
    "video_id":"_rs3ljXgPwM",
    "title":"Last month was the second warmest April on record",
    "description":"Federal scientists say that last month was the second warmest April on record, continuing a trend of near-record temperatures.\n\nApril was 2.2 degrees Fahrenheit hotter than average, globally, compared to records going back to 1850. According to the National Oceanic and Atmospheric Administration, that puts it second to April of last year — which remains the hottest ever recorded. Snow cover in the Northern Hemisphere was also the smallest recorded, tying with last year.\n\nAs humans emit greenhouse gases from burning fossil fuels, the planet is steadily heating up — the hottest 10 years in modern recordkeeping have all been in the last 10 years. But NOAA doesn’t expect 2025 to come as the hottest. That’s because a shift away from the natural climate pattern of El Nino has a slight cooling effect on the planet.",
    "publishedAt":"2025-05-14T15:15:05Z",
    "duration_iso":"PT52S",
    "duration_seconds":52,
    "duration_hms":"0:00:52",
    "url":"https:\/\/www.youtube.com\/watch?v=_rs3ljXgPwM"
  },
  {
    "channel_title":"NPR",
    "video_id":"VP-gyouBEtQ",
    "title":"Trump Meets Syria's Interim President, Pledges To Lift Sanctions | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:17 Trump Meets With Syria's Interim Leader\n1:21 Zelenskyy Prepares For Talks With Putin\n2:25 House Republicans Push To Finish Budget Bill\n3:27 New Book Alleges Cover-Up By Biden's Staff\n4:52 Menendez Brothers Get A Chance At Parole\n5:48 Staffing Shortages Continue To Plague Newark\n6:48 MLB Lifts Lifetime Bans On Pete Rose\n7:44 April The Second Warmest On Record\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Bandar Aljaloud \/ Saudi Royal Palace via AP\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #biden #climatechange",
    "publishedAt":"2025-05-14T14:31:52Z",
    "duration_iso":"PT8M40S",
    "duration_seconds":520,
    "duration_hms":"0:08:40",
    "url":"https:\/\/www.youtube.com\/watch?v=VP-gyouBEtQ"
  },
  {
    "channel_title":"NPR",
    "video_id":"2RUOWTCGVbo",
    "title":"Poland strengthens its defense as Russia's full-scale invasion of Ukraine enters its third year",
    "description":"Poland strengthens its defense as Russia's full-scale invasion of Ukraine enters its third year. Poland, which shares a 500-mile border with Russia and Russian-ally Belarus is preparing to repel a possible invasion, including a plan to train every adult male in the country to be ready for war.",
    "publishedAt":"2025-05-13T21:30:01Z",
    "duration_iso":"PT38S",
    "duration_seconds":38,
    "duration_hms":"0:00:38",
    "url":"https:\/\/www.youtube.com\/watch?v=2RUOWTCGVbo"
  },
  {
    "channel_title":"NPR",
    "video_id":"-thvMiMp0W4",
    "title":"Trump receives lavish welcome in Saudi Arabia",
    "description":"President Trump arrived in Saudi Arabia this morning — the start of a four-day trip to the region, his first official overseas trip as president in his second term. He was greeted with a lavish welcome that included an F-15 fighter jet escort to the airport and an escort to the king’s royal court by guards riding Arabian horses, where he met Crown Prince Mohammed Bin Salman at the foot of a lavender carpet.\n\nAfter listening to each of the nations' national anthems and reviewing divisions of the Saudi military, the leaders took a moment to greet some of the event's other attendees, including Saudi notables and an extensive list of U.S. CEOs, including Elon Musk, OpenAI's Sam Altman and Nvidia's Jensen Huang.",
    "publishedAt":"2025-05-13T20:15:01Z",
    "duration_iso":"PT1M2S",
    "duration_seconds":62,
    "duration_hms":"0:01:02",
    "url":"https:\/\/www.youtube.com\/watch?v=-thvMiMp0W4"
  },
  {
    "channel_title":"NPR",
    "video_id":"6Bwvj4V7_a4",
    "title":"Trump Receives Lavish Welcome In Saudi Arabia | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:16 Trump Arrives In Saudi Arabia\n1:16 Diddy's Trial Resumes Today\n2:16 Hamas Frees 21-year-old Edan Alexander\n3:17 Episcopal Church Quits Resettlement Program\n4:21 U.S. Ending Protections For Afghanistan Refugees\n4:49 IRS Free To Share Data With ICE\n5:53 Trump’s Tariffs Making Investors Uneasy\n6:41 Energy Department Looks To Deregulate\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Alex Brandon \/ AP\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #diddy #episcopal",
    "publishedAt":"2025-05-13T14:33:05Z",
    "duration_iso":"PT7M42S",
    "duration_seconds":462,
    "duration_hms":"0:07:42",
    "url":"https:\/\/www.youtube.com\/watch?v=6Bwvj4V7_a4"
  },
  {
    "channel_title":"NPR",
    "video_id":"I5LK4WpzUUI",
    "title":"Israel's blockade on Gaza continues to block entry of food",
    "description":"Israel's blockade on Gaza, now more than ten weeks long, has halted the entry of all food into Gaza as a pressure tactic against Hamas. Hunger and malnutrition is widespread, wheat flour is hard to come by, and some families are stretching their meager supplies by grinding dry goods into flour for bread.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-13T12:00:38Z",
    "duration_iso":"PT59S",
    "duration_seconds":59,
    "duration_hms":"0:00:59",
    "url":"https:\/\/www.youtube.com\/watch?v=I5LK4WpzUUI"
  },
  {
    "channel_title":"NPR",
    "video_id":"SsI1x4vuWRQ",
    "title":"The Supreme Court will hear challenges to Trump's birthright citizenship",
    "description":"The Supreme Court will hear challenges to Trump's birthright citizenship orders this week.\n\nTo date, every court to have considered Trump's executive order banning birth right citizenship, issued on day one of his administration, has blocked it. But he has doggedly persisted in his contention that birthright citizenship is unconstitutional, an idea widely considered a fringe view because the Supreme Court ruled to the contrary 127 years ago, and that decision has never been disturbed.\n\nEven the Trump administration's lawyers seemed to acknowledge the shaky ground they were standing on. Rather than ask the justices to outright reverse the lower courts, they instead asked the justices to narrow the lower court orders so that the administration could at least begin planning to put into effect its new policy against birthright citizenship.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-13T10:00:45Z",
    "duration_iso":"PT2M44S",
    "duration_seconds":164,
    "duration_hms":"0:02:44",
    "url":"https:\/\/www.youtube.com\/watch?v=SsI1x4vuWRQ"
  },
  {
    "channel_title":"NPR",
    "video_id":"ZOlkbgZsuYA",
    "title":"A rare cicada brood is emerging across the eastern U.S.",
    "description":"A rare brood of cicadas that comes like clockwork every 17 years has begun to emerge in the eastern half of the United States.\n\nFor the first time since 2008, Brood XIV is back, emerging in Tennessee, North Carolina and Ohio, eventually stretching from Georgia to Massachusetts. Considered the second biggest of the dozen-or-so known periodical broods, they develop underground before emerging by the billions — and that’s on top of annual cicadas that emerge every year.\n\nExperts say the insects give big benefits, improving water filtration, giving birds an important food source, and with their above-ground-stay typically lasting just a few weeks, their decomposing bodies provide nutrition to the soil.\n\nCORRECTION: An earlier version of this video contained a typo in the headline.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-12T21:04:51Z",
    "duration_iso":"PT1M4S",
    "duration_seconds":64,
    "duration_hms":"0:01:04",
    "url":"https:\/\/www.youtube.com\/watch?v=ZOlkbgZsuYA"
  },
  {
    "channel_title":"NPR",
    "video_id":"8imittqgjRs",
    "title":"Residents In Israel, Gaza Praise Trump For Hostage's Release | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:18 U.S., China Slash Tariffs\n1:16 Trump Praised For Hostage's Release\n2:15 Qatar In Talks To Gift A New Air Force One\n3:12 Pope Leo XIV Meets With Journalists\n4:04 Trump Order An Attempt To Slash Drug Prices\n4:56 Militant Kurdish Group Disbanding\n5:16 Opening Statements In Diddy's Trial Today\n6:09 Cicadas Emerge Across The Eastern U.S.\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Menahem Kahana \/ AFP via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #gaza #diddy",
    "publishedAt":"2025-05-12T14:24:23Z",
    "duration_iso":"PT7M18S",
    "duration_seconds":438,
    "duration_hms":"0:07:18",
    "url":"https:\/\/www.youtube.com\/watch?v=8imittqgjRs"
  },
  {
    "channel_title":"NPR",
    "video_id":"FOSyrrDH6wE",
    "title":"Rare birth boosts hope for endandered Sumatran tiger",
    "description":"The recent birth of a female Sumatran tiger cub at a zoo in Bukittinggi, Indonesia, has boosted hopes for the critically endangered species.\n\n\"The birth of Banun Kinantan gives us hope that future generations will also know what the Sumatran tiger is like,\" says Silvirawane Ria Putri, head of Bukittinggi's conservation tourism division.\n\nAccording to the agency, the number of Sumatran tigers in the world continues to fall: There are fewer than 90 at conservation agencies, and only around 600 are estimated to still exist in the wild. Their main threats are deforestation and illegal hunting.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-11T18:00:23Z",
    "duration_iso":"PT24S",
    "duration_seconds":24,
    "duration_hms":"0:00:24",
    "url":"https:\/\/www.youtube.com\/watch?v=FOSyrrDH6wE"
  },
  {
    "channel_title":"NPR",
    "video_id":"aK6IsB_byiM",
    "title":"You can play NPR's Sunday puzzle!",
    "description":"Ayesha Rascoe plays the puzzle with listener Michael F. of Highland, Mich., and Weekend Edition Puzzlemaster Will Shortz.\n\nYou can play the Sunday Puzzle, too! This week's challenge comes from Greg VanMechelen, of Berkeley, Calif. Name a famous singer past or present. \n\nRemove the first and last letter from the first name and the result will be a potential partner of the last name. What singer is this?\n\nSubmit correct answers at npr.org\/puzzle by Thursday at 3 p.m. ET to win a chance to play the on-air puzzle.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-11T12:00:02Z",
    "duration_iso":"PT2M5S",
    "duration_seconds":125,
    "duration_hms":"0:02:05",
    "url":"https:\/\/www.youtube.com\/watch?v=aK6IsB_byiM"
  },
  {
    "channel_title":"NPR",
    "video_id":"E2-EyJyZwa4",
    "title":"The Puerto Rican cuatro is the heartbeat of the island’s music",
    "description":"The Puerto Rican cuatro is more than just an instrument, it’s the heartbeat of the island’s music, woven into its traditions for generations.\n\nFrom traditional folk to chart-topping hits, the cuatro continues to prove that its sound will forever be timeless.\n\nAnd now, one of the few surviving examples of an original 19th-century four-string cuatro is preserved in the collection of the National Museum of American History. \n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-10T18:00:19Z",
    "duration_iso":"PT2M1S",
    "duration_seconds":121,
    "duration_hms":"0:02:01",
    "url":"https:\/\/www.youtube.com\/watch?v=E2-EyJyZwa4"
  },
  {
    "channel_title":"NPR",
    "video_id":"0SnTlv-NmcU",
    "title":"Satellite imagery captures eruptions on sun's surface",
    "description":"The NOAA Satellite and Information Service released footage of filament eruptions on the surface of the sun on Wednesday, May 7.\n\n“The sun had four dramatic filament eruptions over the last 24 hours, and the Solar Ultraviolet Imager onboard NOAA’s GOESEast satellite caught them!” NOAA said on X.\n\n“These filaments are comprised of long strands of cooler, denser plasma that lift off the sun’s surface.”\n\nAccording to NOAA, occasionally the filament blow off the surface of the sun and can cause space weather effects on Earth if their paths intersect.\nHowever, in this case, the eruptions were pointed away from Earth.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-10T14:00:04Z",
    "duration_iso":"PT18S",
    "duration_seconds":18,
    "duration_hms":"0:00:18",
    "url":"https:\/\/www.youtube.com\/watch?v=0SnTlv-NmcU"
  },
  {
    "channel_title":"NPR",
    "video_id":"9ZuQ2RSPyy0",
    "title":"Trump administration grants refugee status to 50 white South Africans",
    "description":"The Trump administration has officially granted more than 50 white South Africans refugee status in the U.S.\n\nThe group could arrive at Dulles airport as early as Monday, three sources with knowledge of the matter told NPR, which has also seen an email confirming the arrangements. The sources all work for the U.S. government, so did not want to be named out of fear of retribution.\n\nThree months ago, President Trump signed an executive order claiming Afrikaners — the descendants of mainly Dutch colonists — faced persecution in South Africa and could apply for refugee status in the United States. The South African government says there is no evidence they are being persecuted and has accused the U.S. administration of being taken in by disinformation.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-09T17:30:04Z",
    "duration_iso":"PT55S",
    "duration_seconds":55,
    "duration_hms":"0:00:55",
    "url":"https:\/\/www.youtube.com\/watch?v=9ZuQ2RSPyy0"
  },
  {
    "channel_title":"NPR",
    "video_id":"cv4xmcjhr1k",
    "title":"Polly want a cracker? No. Polly wants to FaceTime.",
    "description":"Follow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-09T16:01:04Z",
    "duration_iso":"PT1M1S",
    "duration_seconds":61,
    "duration_hms":"0:01:01",
    "url":"https:\/\/www.youtube.com\/watch?v=cv4xmcjhr1k"
  },
  {
    "channel_title":"NPR",
    "video_id":"LyvJNVQrfjg",
    "title":"First Afrikaners Granted Refugee Status Head For The U.S. | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:17 Pope Leo XIV Celebrates Mass\n1:18 Justice Souter Dies At 85\n1:37 First Afrikaners Head For The U.S.\n2:32 Noem Spars With Senate Democrats\n3:36 Trump Fires The Librarian Of Congress\n3:46 Duffy Unveils Plan To Modernize\n4:37 Trump Taps Fox's Jeanine Pirro\n5:26 Russia Marks WWII Anniversary\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Marco Longari \/ AFP via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#popeleoxiv #southafrica #trump",
    "publishedAt":"2025-05-09T14:42:37Z",
    "duration_iso":"PT6M21S",
    "duration_seconds":381,
    "duration_hms":"0:06:21",
    "url":"https:\/\/www.youtube.com\/watch?v=LyvJNVQrfjg"
  },
  {
    "channel_title":"NPR",
    "video_id":"3SgfM9QGRsA",
    "title":"Israeli protestors draw attention to young victims in Gaza",
    "description":"Every weekend protesters demand a ceasefire deal and a release of Israeli hostages taken by Hamas in the October 7th attack in 2023. But now a new group of protesters is drawing attention to young victims in Gaza.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-09T14:30:05Z",
    "duration_iso":"PT1M27S",
    "duration_seconds":87,
    "duration_hms":"0:01:27",
    "url":"https:\/\/www.youtube.com\/watch?v=3SgfM9QGRsA"
  },
  {
    "channel_title":"NPR",
    "video_id":"USul-UMnXzg",
    "title":"1.4b Catholics have a new spiritual leader: Pope Leo XIV",
    "description":"About 1.4 billion Catholics worldwide will have a new spiritual leader: Pope Leo XIV.\n\nA roar erupted from the crowd when those in it saw the white smoke, which was shown on several large screens in St. Peter's Square. Enormous bells of St. Peter's Basilica began to ring, tolling the news that the Catholic Church has a new pope.\n\nThe vote came on the second day of the papal election process known as the conclave. Church experts had named other possible candidates and had not expected an American to win the papacy.\n\nThe election of Robert Francis Prevost, who chose the name Leo XIV, as the 267th leader of the Roman Catholic Church marks two historic firsts. Leo is be the first-ever U.S.-born pope to lead the church and the first pope from the Augustinian order.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-09T13:15:46Z",
    "duration_iso":"PT1M13S",
    "duration_seconds":73,
    "duration_hms":"0:01:13",
    "url":"https:\/\/www.youtube.com\/watch?v=USul-UMnXzg"
  },
  {
    "channel_title":"NPR",
    "video_id":"4rkdAFF0cJU",
    "title":"U.S. asylum-seekers are in limbo",
    "description":"Asylum seekers that came to the U.S. through legal pathways, that have since been terminated by President Trump, are now left in limbo. \n\nWe followed one migrant who waited 8 months to enter the U.S. via the CBP One app, a Biden-era legal pathway for asylum seekers. She became one of 900,000 people who used the app, which was the only way to schedule an immigration hearing in the U.S. at the time.\n\nBut, as more cases of migrants being picked up by immigration authorities at court lately, she grew nervous.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-08T20:58:12Z",
    "duration_iso":"PT2M3S",
    "duration_seconds":123,
    "duration_hms":"0:02:03",
    "url":"https:\/\/www.youtube.com\/watch?v=4rkdAFF0cJU"
  },
  {
    "channel_title":"NPR",
    "video_id":"BJGtg4Q5yAc",
    "title":"Robert Prevost is elected the first American pope in history",
    "description":"U.S. Cardinal Robert Prevost has been elected pope, the first time an American will lead the Roman Catholic Church. He chose the name Pope Leo XIV. The 69-year-old new pope appeared at the balcony in St. Peter's Basilica and said “Peace be with all of you!\"\n\nHe also spoke warmly of Pope Francis and concluded by leading the crowd in prayer.\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-08T18:41:48Z",
    "duration_iso":"PT38S",
    "duration_seconds":38,
    "duration_hms":"0:00:38",
    "url":"https:\/\/www.youtube.com\/watch?v=BJGtg4Q5yAc"
  },
  {
    "channel_title":"NPR",
    "video_id":"Aoytmsklt2k",
    "title":"Republicans plan to overhaul the federal student loan system. Here's what to know.",
    "description":"Read more here:\nhttps:\/\/www.npr.org\/2025\/04\/30\/nx-s1-5381149\/trump-republicans-student-loan-repayment\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-08T17:00:13Z",
    "duration_iso":"PT1M26S",
    "duration_seconds":86,
    "duration_hms":"0:01:26",
    "url":"https:\/\/www.youtube.com\/watch?v=Aoytmsklt2k"
  },
  {
    "channel_title":"NPR",
    "video_id":"6O9YpiBqxjI",
    "title":"As of Wed morning, still no pope",
    "description":"Black smoke streamed from the chimney of the Sistine Chapel on Wednesday, signaling to the world that the 133 cardinal electors have not come to a two-thirds agreement about who the next pope should be. Earlier on Wednesday, the cardinals of the Roman Catholic Church entered the Sistine Chapel to begin the conclave, where they will select a new pope for the world's 1.4 billion Catholics.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-08T14:16:27Z",
    "duration_iso":"PT1M23S",
    "duration_seconds":83,
    "duration_hms":"0:01:23",
    "url":"https:\/\/www.youtube.com\/watch?v=6O9YpiBqxjI"
  },
  {
    "channel_title":"NPR",
    "video_id":"qEcSz-2hCfA",
    "title":"India holds emergency drills as tensions escalate with Pakistan",
    "description":"As tensions escalate between India and Pakistan, Indian authorities held dozens of emergency drills across the country to prepare its first responders for conflict. Volunteers rappelled from the top of a building as sirens went off and firecrackers erupted — apparently to imitate shelling in one drill in the Indian port city of Mumbai.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-07T20:30:06Z",
    "duration_iso":"PT48S",
    "duration_seconds":48,
    "duration_hms":"0:00:48",
    "url":"https:\/\/www.youtube.com\/watch?v=qEcSz-2hCfA"
  },
  {
    "channel_title":"NPR",
    "video_id":"JK51IaTpj5w",
    "title":"Cardinals hold final public Mass before beginning conclave",
    "description":"Roman Catholic cardinals held a final Mass this morning at St. Peter’s Basilica, at the Vatican.\n\n“We are here to invoke the help of the Holy Spirit,” Cardinal Battista Re said in his homily. “So that the Pope elected maybe he whom the Church and humanity need at this difficult and complex turning point in history.”\n\nThe morning Mass was the final public act before the cardinals are locked inside the Sistine Chapel to begin their conclave, where they'll cast their vote to select a new pope.\n\n------------------------------------------------------\n\nFollow NPR elsewhere, too:\n• Instagram: https:\/\/www.instagram.com\/npr\/\n• TikTok: https:\/\/www.tiktok.com\/@npr\n• Facebook: https:\/\/www.facebook.com\/NPR",
    "publishedAt":"2025-05-07T20:08:13Z",
    "duration_iso":"PT1M1S",
    "duration_seconds":61,
    "duration_hms":"0:01:01",
    "url":"https:\/\/www.youtube.com\/watch?v=JK51IaTpj5w"
  },
  {
    "channel_title":"NPR",
    "video_id":"9G4LOxOYom8",
    "title":"India Launches Missiles On Targets Inside Pakistan | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:19 India Attacks Targets In Pakistan\n1:10 Cardinals' Conclave Begins Today\n2:11 Ban On Trans Service Members Takes Effect\n2:33 Real ID Enforcement Begins Today\n3:33 Another Judge Rejects Deportations\n4:18 U.S.-Chinese Tariff Talks Continue\n5:26 CPB, PBS Stripped Of Millions\n6:29 SpaceX Approved For More Rocket Launches\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Farooq Naeem \/ AFP via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#kashmir #conclave2025 #spacex",
    "publishedAt":"2025-05-07T14:42:58Z",
    "duration_iso":"PT7M33S",
    "duration_seconds":453,
    "duration_hms":"0:07:33",
    "url":"https:\/\/www.youtube.com\/watch?v=9G4LOxOYom8"
  },
  {
    "channel_title":"NPR",
    "video_id":"RYIRFSs9b4w",
    "title":"At this visa temple in India, people bring their passports to receive blessings",
    "description":"In the city of Ahmedabad, some Indian nationals hoping to make it to the U.S. come to pray at visa temples, dedicated to the monkey god Hanuman. It's a temple celebrated for the monkey god, answering prayers of people who want to get their visas.",
    "publishedAt":"2025-05-06T20:00:29Z",
    "duration_iso":"PT1M36S",
    "duration_seconds":96,
    "duration_hms":"0:01:36",
    "url":"https:\/\/www.youtube.com\/watch?v=RYIRFSs9b4w"
  },
  {
    "channel_title":"NPR",
    "video_id":"EE1s94rh9Ls",
    "title":"Trump administration asks court to dismiss abortion drug suit",
    "description":"In a somewhat surprising move, the Trump administration asked a federal court this week to dismiss a case that could seriously restrict access to abortion nationally.\n\nThe lawsuit from Idaho, Kansas and Missouri argues that FDA should roll back access to mifepristone, one of the pills used for medication abortion and for managing miscarriages. It’s a case the Supreme Court declined to weigh in on last year, finding the plaintiffs lacked the right to sue. The three states later moved to revive the case, arguing they have legal standing because access to the drug undermines their abortion laws. On Monday, the Justice Department continued with the approach taken by the Biden administration, asking a federal judge to dismiss the case.\n\nKatie Keith, the director of the Georgetown Center for Health Policy and the Law and a former member of President Biden’s Gender Policy Council, says if the Trump administration wants to restrict access, they have other tools at their disposal. What remains to be seen is whether, politically, they want to make use of those tools.\n\n\"I would say the jury is still out essentially of how aggressive the Trump administration is going to be on medication abortion.\"",
    "publishedAt":"2025-05-06T19:00:12Z",
    "duration_iso":"PT1M3S",
    "duration_seconds":63,
    "duration_hms":"0:01:03",
    "url":"https:\/\/www.youtube.com\/watch?v=EE1s94rh9Ls"
  },
  {
    "channel_title":"NPR",
    "video_id":"mRJ8ZPj0xpo",
    "title":"Hegseth Orders A 20% Reduction In The Military's Top Brass | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:16 Carney Visits The White House Today\n0:29 Government Seeks To Dismiss Mifepristone Suit\n1:25 Hegseth Orders Cuts To 4-Star Generals, Admirals\n1:45 DOE: Harvard Ignores Antisemitism\n2:42 Ford, GM: Tariffs Will Cost Billions\n3:10 Schumer Pushes For Probe Into Air Traffic Issues\n4:01 More Then 400 Attend 2025 Met Gala\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Jim Watson \/ AFP via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #abortion #tariffs",
    "publishedAt":"2025-05-06T14:34:35Z",
    "duration_iso":"PT4M28S",
    "duration_seconds":268,
    "duration_hms":"0:04:28",
    "url":"https:\/\/www.youtube.com\/watch?v=mRJ8ZPj0xpo"
  },
  {
    "channel_title":"NPR",
    "video_id":"ukSQodU-Dro",
    "title":"Astronomy won’t be the same after the Vera C. Rubin Observatory",
    "description":"",
    "publishedAt":"2025-05-06T10:01:34Z",
    "duration_iso":"PT1M",
    "duration_seconds":60,
    "duration_hms":"0:01:00",
    "url":"https:\/\/www.youtube.com\/watch?v=ukSQodU-Dro"
  },
  {
    "channel_title":"NPR",
    "video_id":"KMimdyKHXVc",
    "title":"Popemobile to aid Gaza in one of Francis' final acts",
    "description":"The Vatican says that one of the \"popemobiles\" used by Pope Francis is going to be turned into a mobile health clinic. Francis directed that it be used to serve children in Gaza. The Vatican said it was one of Francis’ final wishes.\n\nThe news comes as Roman Catholic Cardinals prepare to select the church’s next pontiff. The cardinals' conclave is set to begin on Wednesday.",
    "publishedAt":"2025-05-05T18:30:21Z",
    "duration_iso":"PT22S",
    "duration_seconds":22,
    "duration_hms":"0:00:22",
    "url":"https:\/\/www.youtube.com\/watch?v=KMimdyKHXVc"
  },
  {
    "channel_title":"NPR",
    "video_id":"mC2M-gfkgFQ",
    "title":"Police say they prevented an attack at Lady Gaga's concert in Rio",
    "description":"Police in Brazil say they foiled a bomb threat aimed at a free Lady Gaga concert at Rio de Janeiro's Copacabana Beach on Saturday night. The event drew more than 2 million people, making it the largest show of Lady Gaga's career.\n\nAccording to police, the attack's alleged organizers were recruiting participants online — including teenagers — to carry out the bombing using improvised explosives and Molotov cocktails. Officials said the plan was to target \"children, adolescents, and the LGBTQIA+ community.\"\n\nTwo unnamed people were arrested in connection with the plan, including the alleged leader of the group and a teenager who police said was arrested for storing child pornography.",
    "publishedAt":"2025-05-05T17:30:11Z",
    "duration_iso":"PT57S",
    "duration_seconds":57,
    "duration_hms":"0:00:57",
    "url":"https:\/\/www.youtube.com\/watch?v=mC2M-gfkgFQ"
  },
  {
    "channel_title":"NPR",
    "video_id":"-FvTEtdj_hk",
    "title":"Police Say They Prevented An Attack At Lady Gaga's Rio Concert | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:19 Trump Doesn't Know About Upholding The Constitution\n0:41 Trump Wants To Reopen, Expand Alcatraz\n1:32 Trump Instituting 100% Tariff On Foreign Movies\n2:24 Police Foiled An Attack On Lady Gaga's Concert\n3:21 Collections Resume On Federal Student Loans\n3:38 Israel Overhauling Aid For Gaza\n4:40 Francis Directs Popemobile To Aid Gaza\n5:02 ATF Dismantles Gun Violence Exhibit\n6:02 The Met Gala Is Tonight\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Kevin Mazur \/ WireImage for Live Nation via Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #ladygaga #popefrancis",
    "publishedAt":"2025-05-05T14:29:16Z",
    "duration_iso":"PT6M58S",
    "duration_seconds":418,
    "duration_hms":"0:06:58",
    "url":"https:\/\/www.youtube.com\/watch?v=-FvTEtdj_hk"
  },
  {
    "channel_title":"NPR",
    "video_id":"ElsP5mZ0apU",
    "title":"Animals enjoy autumn leaves at Melbourne Zoo",
    "description":"Monkeys and meerkats enjoyed the changing of the seasons at Melbourne Zoo, where keepers turned autumn leaves into a “crunchy autumn treasure hunt.” Meerkats, spider monkeys, and emperor tamarins all took part in the activity to search through piles of leaves that had been sprinkled with their favorite treat: mealworms.",
    "publishedAt":"2025-05-04T12:00:32Z",
    "duration_iso":"PT47S",
    "duration_seconds":47,
    "duration_hms":"0:00:47",
    "url":"https:\/\/www.youtube.com\/watch?v=ElsP5mZ0apU"
  },
  {
    "channel_title":"NPR",
    "video_id":"jis4z2UeTSY",
    "title":"Can you solve this week's Sunday Puzzle?",
    "description":"Lauren Frayer plays the puzzle with listener Dave S. of Rochester, Minn., and Weekend Edition Puzzlemaster Will Shortz.\n\nYou can play the Sunday Puzzle, too! This week's challenge comes from Andrew Tuite, of Chicago. There are four countries whose names have one-syllable anagrams that rhyme with \"Spain.\" What are they?\n\nSubmit correct answers at npr.org\/puzzle by Thursday at 3 p.m. ET to win a chance to play the on-air puzzle.",
    "publishedAt":"2025-05-04T10:01:04Z",
    "duration_iso":"PT1M29S",
    "duration_seconds":89,
    "duration_hms":"0:01:29",
    "url":"https:\/\/www.youtube.com\/watch?v=jis4z2UeTSY"
  },
  {
    "channel_title":"NPR",
    "video_id":"75dtSOJUHHE",
    "title":"Texting etiquette 101",
    "description":"Do your text messages feel like the equivalent of 200 open browser tabs?⁠\n⁠\nIf you're in multiple text threads with different people in your life — your family, your partner, your kid's teacher — it can be hard to stay on top of your messages.⁠\n⁠\nThese texting situations can be tricky, but managing them is a lot more straightforward than you might think, says Nick Leighton, host of the etiquette and manners podcast Were You Raised by Wolves?⁠\n⁠\n\"A lot of people forget that texting is just another form of communication,\" he says. \"But the principles of 'let's not waste people's time' and 'let's be mindful of their feelings' have never changed.\"⁠\n⁠\nLife Kit asked Leighton and Erica Dhawan, author of \"Digital Body Language,” for their advice on four common texting conundrums. ⁠",
    "publishedAt":"2025-05-03T14:00:08Z",
    "duration_iso":"PT1M36S",
    "duration_seconds":96,
    "duration_hms":"0:01:36",
    "url":"https:\/\/www.youtube.com\/watch?v=75dtSOJUHHE"
  },
  {
    "channel_title":"NPR",
    "video_id":"DJ5XLoiDXJQ",
    "title":"Moose on the move pull in millions of viewers",
    "description":"Moose are on the move in Sweden, beginning their annual migration across the northern part of the country — and millions of people are tuning in to watch.\n\nEach spring, hundreds of moose journey to the mountains near the border between Sweden and Norway, looking for new food sources and a place to raise their calves. Since 2019, Swedish public broadcaster SVT has livestreamed their trek. More than 9 million people watched around the world last year, and viewership is expected to be even higher this year.\n\nThe program is an indication of the rising popularity of the “slow TV” genre, which features live, unedited and hours- or even months-long coverage of some routine event, usually with a theme or journey in mind.",
    "publishedAt":"2025-05-03T10:00:15Z",
    "duration_iso":"PT54S",
    "duration_seconds":54,
    "duration_hms":"0:00:54",
    "url":"https:\/\/www.youtube.com\/watch?v=DJ5XLoiDXJQ"
  },
  {
    "channel_title":"NPR",
    "video_id":"WQLyOtFGeUs",
    "title":"Relief agencies say food is running out in Gaza",
    "description":"Israel has blocked all aid into Gaza for the past two months. The World Food Programme says this is the longest closure by Israel since the war started. The organizations are demanding that Israel comply with international law.\n\nIsrael says it’s trying to force Hamas to release hostages.",
    "publishedAt":"2025-05-02T18:00:38Z",
    "duration_iso":"PT26S",
    "duration_seconds":26,
    "duration_hms":"0:00:26",
    "url":"https:\/\/www.youtube.com\/watch?v=WQLyOtFGeUs"
  },
  {
    "channel_title":"NPR",
    "video_id":"oWYny8wfPXE",
    "title":"Import rule change sends Shein, TEMU prices soaring",
    "description":"The Trump administration is ending a duty-free exemption on low-value imports from China, beginning today, affecting retailers like Shein and TEMU, making their goods much more expensive for American consumers.\n\nThere’s been pressure since the Biden administration to end what’s called the “de minimus” loophole, which meant packages valued at under $800 were not charged an import fee. More than 1 billion of these packages now come to the U.S. a year, mostly from China — a more than sixfold increase over the last decade.\n\nThe Trump administration says the rule change is an attempt at combating fentanyl trafficking — and to collect revenue for the government.",
    "publishedAt":"2025-05-02T17:00:58Z",
    "duration_iso":"PT1M2S",
    "duration_seconds":62,
    "duration_hms":"0:01:02",
    "url":"https:\/\/www.youtube.com\/watch?v=oWYny8wfPXE"
  },
  {
    "channel_title":"NPR",
    "video_id":"zb7QD9Gdu74",
    "title":"Trump's Rule Change Sends SHEIN, Temu Prices Soaring | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:20 Trump Sends SHEIN, Temu Prices Soaring\n1:21 Trump To Propose $163B In Spending Cuts\n1:57 Judge: Trump Wrong On Alien Enemies Act\n2:51 ICE Fines Colorado Employers $8 Million\n3:38 Trump Moves Mike Waltz To The U.N.\n4:38 Trump Wants To End Federal Funding For NPR, PBS\n5:33 Palestinians In Gaza Face Imminent Hunger\n5:57 'Rust' Debuts In Theaters Today\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Ben Montgomery \/ Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #shein #gaza",
    "publishedAt":"2025-05-02T14:32:41Z",
    "duration_iso":"PT7M3S",
    "duration_seconds":423,
    "duration_hms":"0:07:03",
    "url":"https:\/\/www.youtube.com\/watch?v=zb7QD9Gdu74"
  },
  {
    "channel_title":"NPR",
    "video_id":"ZAlPSaCA_Cw",
    "title":"Help! My friend texts me nonstop",
    "description":"The “good morning” texts are driving me away.⁠\n⁠\nMarisa Franco, a clinical psychologist and the author of “Platonic: How the Science of Attachment Can Help You Make — and Keep — Friends,” responds to an anonymous question from a listener who says her neighbor’s intense texting style is making her question the friendship. ⁠\n⁠\nDear Life Kit is NPR Life Kit’s advice column. To hear Franco answer more audience questions, search “Life Kit” wherever you listen to podcasts. ⁠",
    "publishedAt":"2025-05-01T19:00:35Z",
    "duration_iso":"PT55S",
    "duration_seconds":55,
    "duration_hms":"0:00:55",
    "url":"https:\/\/www.youtube.com\/watch?v=ZAlPSaCA_Cw"
  },
  {
    "channel_title":"NPR",
    "video_id":"cbrS3rALX4M",
    "title":"Judge: Apple violated injunction in Fortnite's app store lawsuit",
    "description":"A federal judge ruled Wednesday that Apple has violated an injunction in an antitrust lawsuit filed by Fortnite's parent company, Epic Games.\n\nThe judge had ordered Apple to lower barriers for its once-exclusive in-app digital transactions. Additionally Apple was ordered to let developers show links to alternatives to those in-app transactions.",
    "publishedAt":"2025-05-01T18:00:39Z",
    "duration_iso":"PT29S",
    "duration_seconds":29,
    "duration_hms":"0:00:29",
    "url":"https:\/\/www.youtube.com\/watch?v=cbrS3rALX4M"
  },
  {
    "channel_title":"NPR",
    "video_id":"ve3yQftvbj0",
    "title":"U.S., Ukraine Sign Long-Stalled Deal Over Rare Earth Minerals | NPR News Now",
    "description":"NPR’s “News Now” is a roundup of the top stories of the day in under five minutes. Click “Show More” for a list of today’s stories:\n\n0:00 Today’s Top Stories\n0:16 Ukraine, U.S. Sign Minerals Deal\n1:02 Trump's VA Ends Mortgage Program\n1:56 Judge Rules Apple Violated Injunction\n2:24 Senate Fails To Block Trump’s Tariffs\n3:15 Trump Administration Terminates Mental Health Grants\n3:36 Harvard Providing Information To DHS\n4:36 USPS Officers Aiding Deportation Efforts\n5:02 Harris Blasts Trump In San Francisco Speech\n6:00 Survey: Teens' Nicotine Pouch Doubles\n\nNOTE: Captions are auto-generated by YouTube.\n\nCover Photo: Kostiantyn Liberov \/ Libkos \/ Getty Images\n\nSUBSCRIBE TO OTHER NPR CHANNELS\nNPR Music: https:\/\/www.youtube.com\/@nprmusic\nNPR Podcasts: https:\/\/www.youtube.com\/@UCuVaB0t5qJRxP55gEl6TuKQ\nFresh Air: https:\/\/www.youtube.com\/@thisisfreshair\n\nFOLLOW NPR ELSEWHERE\nhttps:\/\/www.npr.org\nhttps:\/\/www.instagram.com\/npr\nhttps:\/\/www.tiktok.com\/@npr\nhttps:\/\/www.facebook.com\/NPR\n\nThe NPR shows you love are possible thanks to your support. Donate today: https:\/\/www.npr.org\/donations\/support\n\n#trump #ukraine #apple",
    "publishedAt":"2025-05-01T15:14:44Z",
    "duration_iso":"PT7M",
    "duration_seconds":420,
    "duration_hms":"0:07:00",
    "url":"https:\/\/www.youtube.com\/watch?v=ve3yQftvbj0"
  },
  {
    "channel_title":"NPR",
    "video_id":"gpbdggBngQ4",
    "title":"NPR talks to Steve Bannon about higher taxes on the wealthy",
    "description":"Morning Edition’s Steve Inskeep spoke with Stephen K. Bannon this week. The sometime presidential adviser is one of many figures worth watching to see what Trump voters, and occasionally Trump himself, might be thinking.\n\nThough Bannon has a Harvard MBA and made money on Wall Street and in Hollywood, he describes himself as a defender of the working class. He's cast doubt on the effectiveness of Elon Musk, the billionaire presidential aide, saying he wants an \"audit\" of purported savings by Musk's Department of Government Efficiency.\n\nBannon also calls for higher taxes on the wealthy to help reduce federal debt, an idea that Trump has toyed with but not endorsed.",
    "publishedAt":"2025-05-01T10:01:13Z",
    "duration_iso":"PT50S",
    "duration_seconds":50,
    "duration_hms":"0:00:50",
    "url":"https:\/\/www.youtube.com\/watch?v=gpbdggBngQ4"
  }
]