{
  "data": {
    "videos": [
      {
        "id": 7511491420860108078,
        "like_count": 147738,
        "region_code": "US",
        "video_description": "The suspect charged in the antisemitic attack in Boulder, Colorado, Mohamed Sabry Soliman, appeared in court today. CNN's Whitney Wild reports from outside the courthouse in Boulder, breaking down the latest from law enforcement.",
        "comment_count": 3309,
        "create_time": 1748905429,
        "share_count": 4965,
        "username": "cnn",
        "view_count": 3608922
      },
      {
        "video_description": "The Palestinian health ministry, hospital officials and multiple eyewitnesses say deadly gunfire killed dozens of Palestinians near an aid distribution site in Gaza on Sunday, with Israel’s military denying that its troops fired “within or near” the aid site. CNN Jerusalem correspondent Jeremy Diamond brings you up to speed on what we know about the weekend chaos. #CNN #news #Gaza",
        "comment_count": 1227,
        "region_code": "US",
        "username": "cnn",
        "share_count": 1837,
        "view_count": 181059,
        "create_time": 1748902429,
        "id": 7511478539762502958,
        "like_count": 31375
      },
      {
        "like_count": 18965,
        "region_code": "US",
        "video_description": "Europe's tallest and most active volcano, Mount Etna has erupted again, spewing a plume of ash and rock “several kilometers high,” according to authorities. Video posted to social media showed tourists fleeing the scene. About a dozen tour operators work on Etna at any given time, the Sicilian Civil Protection Agency told CNN. All tourists and trekkers on the volcano when it erupted have been evacuated safely, according to the National Institute of Geophysics and Volcanology Observatory. #cnn #news #etna #mountetna #italy #volcano",
        "view_count": 1074483,
        "username": "cnn",
        "comment_count": 306,
        "create_time": 1748900682,
        "id": 7511471045887495470,
        "share_count": 1209
      },
      {
        "video_description": "Ukraine launched an audacious drone attack deep inside Russia, with some targets 4,500 kilometers (2,800 miles) from Ukraine's border. The attack used at least 117 drones, according to Ukrainian President Volodymyr Zelensky, hitting 34% of Russia's strategic bomber aircraft. CNN's chief international security correspondent Nick Paton Walsh breaks down what this means for Russia militarily, and for morale. #cnn #news #",
        "view_count": 254737,
        "comment_count": 366,
        "create_time": 1748896648,
        "share_count": 91,
        "username": "cnn",
        "id": 7511453755347307822,
        "like_count": 4581,
        "region_code": "US"
      },
      {
        "username": "cnn",
        "video_description": "O-T Fagbenle reflects on wrapping \"The Handmaid’s Tale,\" Luke’s evolution, and the emotional final scene with June as the series ends after six seasons. #handmaidstale #handmaidstaletiktok #juneandluke #tv #cnn #news",
        "view_count": 87869,
        "comment_count": 45,
        "create_time": 1748888066,
        "id": 7511416864283741486,
        "share_count": 30,
        "like_count": 1020,
        "region_code": "US"
      },
      {
        "create_time": 1748886915,
        "region_code": "US",
        "comment_count": 71,
        "id": 7511411901310569771,
        "like_count": 13965,
        "share_count": 216,
        "username": "cnn",
        "video_description": "Researchers from the Woods Hole Oceanographic Institution captured close-up images of a WWI-era submarine lost at sea 108 years ago. #cnn #news #submarines #submarinewreck #ocean",
        "view_count": 270352
      },
      {
        "id": 7511407529897905451,
        "like_count": 931,
        "region_code": "US",
        "username": "cnn",
        "comment_count": 58,
        "create_time": 1748885904,
        "share_count": 43,
        "video_description": "First responders in Boulder, Colorado, were “bombarded” with 911 calls after a man used a flamethrower and Molotov cocktails to set people on fire at a Jewish community event. #cnn #news",
        "view_count": 46865
      },
      {
        "comment_count": 23970,
        "id": 7511350463204199722,
        "share_count": 27101,
        "create_time": 1748872630,
        "like_count": 488956,
        "region_code": "US",
        "username": "cnn",
        "video_description": "A transgender athlete, whose participation sparked a national controversy and a temporary rule change, took first place in two of her three events in the California High School Track and Field Championship. #cnn #news",
        "view_count": 8409469
      },
      {
        "comment_count": 523,
        "like_count": 7583,
        "region_code": "US",
        "share_count": 340,
        "video_description": "Ukrainian forces have destroyed dozens of Russian warplanes at air bases thousands of miles from the front lines, in one of Kyiv’s most audacious and sophisticated assaults since the beginning of the war. #cnn #news",
        "view_count": 243653,
        "create_time": 1748868055,
        "id": 7511330734989430062,
        "username": "cnn"
      },
      {
        "video_description": "Six people were injured in what officials are describing an antisemitic attack in Boulder, Colorado. The suspect in custody, identified as 45-year-old Mohamed Sabry Soliman, allegedly used a makeshift flamethrower and threw an incendiary device into the crowd. He also yelled “Free Palestine,” according to the FBI. #cnn #news #colorado",
        "create_time": 1748844116,
        "like_count": 23200,
        "region_code": "US",
        "share_count": 1263,
        "username": "cnn",
        "comment_count": 532,
        "id": 7511228025665588522,
        "view_count": 462366
      },
      {
        "comment_count": 5104,
        "like_count": 75869,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Two business owners recorded and confronted masked federal law enforcement officers who were detaining a local gardener at his job site.",
        "view_count": 1164149,
        "create_time": 1748828815,
        "id": 7511162444614470954,
        "share_count": 2029
      },
      {
        "comment_count": 2425,
        "id": 7511067538017602862,
        "share_count": 1264,
        "video_description": "MIT 2025 class president Megha Vemuri told CNN that after her Pro-Palestine speech, the university’s senior leadership informed her she was not allowed to attend Friday’s commencement ceremony and was barred from campus until the event concluded. #CNN #News",
        "create_time": 1748806730,
        "like_count": 64192,
        "region_code": "US",
        "username": "cnn",
        "view_count": 949071
      },
      {
        "create_time": 1748797388,
        "id": 7511027367004097838,
        "like_count": 8931,
        "region_code": "US",
        "share_count": 188,
        "view_count": 332301,
        "comment_count": 1861,
        "username": "cnn",
        "video_description": "CNN’s Dana Bash presses Office of Management and Budget Director Russ Vought on the Trump administration’s proposal to cut non-defense spending by more than 22% — including deep reductions to education, food assistance, and billions in cancer research funding. As Vought defends the cuts and criticizes the NIH, Bash challenges him on the real-world impact to life-saving medical research. #trump #budget #cancer #research #cnn #news"
      },
      {
        "id": 7510880860107722030,
        "region_code": "US",
        "share_count": 23944,
        "comment_count": 17017,
        "create_time": 1748763303,
        "like_count": 294626,
        "username": "cnn",
        "video_description": "Video shows a mother in Khan Younis, Gaza, desperately trying to gather as much flour off the ground as possible. UN agencies are warning of impending famine without a drastic scaling up of aid entering the territory with Israel only partially relaxing a blockade on the enclave. #cnn #news #gaza",
        "view_count": 2852121
      },
      {
        "create_time": 1748750550,
        "id": 7510826282150726958,
        "like_count": 17895,
        "region_code": "US",
        "share_count": 297,
        "username": "cnn",
        "comment_count": 236,
        "video_description": "A doorbell camera captured the terrifying moment a car fatally struck a high school teacher and injured another pedestrian after it lost control following a highway patrol chase in Oakland, California. #cnn #news #california #oakland",
        "view_count": 659142
      },
      {
        "comment_count": 127,
        "like_count": 3054,
        "region_code": "US",
        "share_count": 206,
        "create_time": 1748743717,
        "id": 7510796906231090474,
        "username": "cnn",
        "video_description": "Millions of bees escape after a truck carrying honeybee hives overturned in Whatcom County, Washington, and rolled into a ditch. Local beekeepers were called to the scene.",
        "view_count": 205849
      },
      {
        "comment_count": 208,
        "id": 7511870409709505835,
        "like_count": 11235,
        "region_code": "US",
        "share_count": 3290,
        "view_count": 273117,
        "create_time": 1748993659,
        "username": "cnn",
        "video_description": "Mexico City was hit with record rainfall that didn't relent for more than five hours Monday night, marking the heaviest rain since 2017, according to water management officials. CNN's Valeria León walks a flooded avenue of the nation's capital after emergency crews worked through the night to rescue several trapped drivers. #cnn #news #mexico #mexicocity #flooding #rain #weather "
      },
      {
        "comment_count": 784,
        "create_time": 1748988972,
        "id": 7511850258532453675,
        "like_count": 21730,
        "region_code": "US",
        "share_count": 448,
        "username": "cnn",
        "video_description": "Elon Musk lashed out at President Donald Trump’s agenda bill — which the president is pressuring GOP senators to support — calling it a “disgusting abomination.” CNN's Kaitlan Collins reports. #cnn #news",
        "view_count": 458578
      },
      {
        "comment_count": 616,
        "create_time": 1748984670,
        "id": 7511831778185907502,
        "like_count": 18807,
        "share_count": 802,
        "video_description": "CNN's Elizabeth Wagmeister breaks down the lengths Sean \"Diddy\" Combs allegedly took in an attempt to cover up the 2016 hotel assault video of Cassie Ventura that was obtained by CNN.",
        "region_code": "US",
        "username": "cnn",
        "view_count": 452796
      },
      {
        "create_time": 1748983655,
        "id": 7511827429619420459,
        "like_count": 17619,
        "region_code": "US",
        "username": "cnn",
        "video_description": "For a third consecutive day, Palestinians came under fire while trying to receive aid from a distribution site in Gaza. According to the Palestinian Ministry of Health and Nasser hospital, at least 27 people were killed and dozens injured on June 3. #cnn #news #gaza #israel",
        "view_count": 53132,
        "comment_count": 227,
        "share_count": 138
      },
      {
        "comment_count": 22,
        "create_time": 1748974842,
        "id": 7511789534821076266,
        "view_count": 13110,
        "like_count": 271,
        "region_code": "US",
        "share_count": 2,
        "username": "cnn",
        "video_description": "Costume Designer Brenda Abbandandolo mixed vintage, thrifted clothing with precise recreations of 1950s style to bring the Broadway play Good Night, and Good Luck to life. She tells CNN how she approached dressing George Clooney and Ilana Glazer with historic authenticity. Tune in to CNN on Saturday, June 7 at 7pm to watch the play broadcast live from Broadway’s Winter Garden Theatre. "
      },
      {
        "view_count": 62226,
        "create_time": 1748972736,
        "id": 7511780476328135978,
        "like_count": 2186,
        "video_description": "CNN's Jim Sciutto explains why Ukraine's large-scale drone attack on Russian air bases thousands of miles behind the front lines struck fear into the heart of every global superpower. #russia #ukraine #cnn #news ",
        "comment_count": 145,
        "region_code": "US",
        "share_count": 58,
        "username": "cnn"
      },
      {
        "like_count": 9786,
        "region_code": "US",
        "view_count": 199461,
        "username": "cnn",
        "video_description": "A video posted online appears to show Antoine Massey, one of two men who remains on the run after escaping a New Orleans jail, declaring his innocence. Deputy US Marshal Brian Fair told CNN that the US Marshals Service received the video Monday and that the agency is looking into it. #cnn #news ",
        "comment_count": 109,
        "create_time": 1748972596,
        "id": 7511779908578708782,
        "share_count": 189
      },
      {
        "like_count": 8347,
        "video_description": "Acting ICE Director Todd Lyons is defending federal immigration agents for wearing masks during raids across the US, citing safety concerns. The tactic has sparked backlash and raised questions about transparency and accountability. #immigration #ICEraids #deportations #cnn #news",
        "view_count": 237448,
        "comment_count": 1199,
        "create_time": 1748969508,
        "id": 7511766654338993450,
        "region_code": "US",
        "share_count": 266,
        "username": "cnn"
      },
      {
        "comment_count": 133,
        "create_time": 1748965151,
        "id": 7511747854910901550,
        "view_count": 149389,
        "like_count": 5497,
        "region_code": "US",
        "share_count": 747,
        "username": "cnn",
        "video_description": "Around 20,000 revellers gathered in Sutamarchán, Colombia, to throw over 45 tonnes of tomatoes at each other. The Gran Tomatina festival, now in its 15th year, is hosted to celebrate the economy of Sutamarchán, which is centred around tomato production. Mayor Miguel Andrés Rodríguez said \"between 70 and 80 percent of families [in Sutamarchán] live off tomatoes. This is a tribute to them.\" The festival uses tomatoes which are overripe, or otherwise not suitable for consumption. #cnn #news #foodfight #colombia #tiktokcolombia #colombia #tomato "
      },
      {
        "comment_count": 229,
        "like_count": 852,
        "region_code": "US",
        "share_count": 23,
        "view_count": 24628,
        "create_time": 1748963700,
        "id": 7511741527505390890,
        "username": "cnn",
        "video_description": "CNN’s Bianna Golodryga breaks down the three high-profile recent attacks on Jewish elected officials, diplomats and community events that are putting American Jews and government officials on edge. #cnn #cnnnews"
      },
      {
        "create_time": 1748961424,
        "id": 7511731900168342827,
        "region_code": "US",
        "video_description": "CNN will air the penultimate performance of this 5x Tony-nominated play LIVE for one night only - you won’t want to miss this historic live event on June 7 at 7p ET on CNN’s cable channel, digital platforms and streaming live on Max. #goodnightandgoodluck #broadway",
        "comment_count": 46,
        "like_count": 732,
        "share_count": 58,
        "username": "cnn",
        "view_count": 20445
      },
      {
        "region_code": "US",
        "share_count": 15026,
        "video_description": "The All-American Rejects played a backyard gig in Columbia, Missouri, as part of their House Party Tour protesting against expensive arena shows. Police eventually shut it down, but not before letting the band play one final song. #cnn #news",
        "view_count": 2303529,
        "comment_count": 1271,
        "create_time": 1748959362,
        "id": 7511723195741818158,
        "like_count": 386568,
        "username": "cnn"
      },
      {
        "id": 7511660236240031022,
        "like_count": 2925,
        "region_code": "US",
        "view_count": 53787,
        "comment_count": 47,
        "share_count": 86,
        "username": "cnn",
        "video_description": "Eliana DeVos received a dressing made with fish skin to help her recover from a serious bacterial infection that left an open wound on her neck. CNN’s Jacqueline Howard spoke with Eliana’s mom and her health team at Driscoll Children’s Hospital about the healing process. #CNN #health",
        "create_time": 1748944817
      },
      {
        "region_code": "US",
        "video_description": "After Ukraine’s shocking drone assault on Russian air bases, CNN’s Erin Burnett talks with Former Russian Deputy Minister of Energy Vladimir Milov about how Vladimir Putin might respond. #cnn #news",
        "view_count": 369482,
        "like_count": 6935,
        "create_time": 1748943412,
        "id": 7511654283826302254,
        "share_count": 98,
        "username": "cnn",
        "comment_count": 315
      },
      {
        "comment_count": 28,
        "create_time": 1749080563,
        "like_count": 396,
        "share_count": 10,
        "view_count": 31111,
        "id": 7512243638001241387,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Bryana Bongolan, a friend of Cassie Ventura who goes by Bana, testified today about an incident with Sean “Diddy” Combs in 2016 when she said that she was “held over a 17-story balcony” by the music mogul. CNN’s Elizabeth Wagmeister reports."
      },
      {
        "id": 7512226965030473006,
        "like_count": 16096,
        "username": "cnn",
        "video_description": "Angry crowds clashed with ICE agents after ICE raided a restaurant in San Diego on May 30, as part of an investigation into whether it was knowingly employing undocumented immigrants. #CNN #News",
        "view_count": 292749,
        "comment_count": 534,
        "create_time": 1749076667,
        "region_code": "US",
        "share_count": 764
      },
      {
        "comment_count": 1598,
        "like_count": 198916,
        "region_code": "US",
        "share_count": 5351,
        "username": "cnn",
        "video_description": "The family of a teenager from Massachusetts who was detained recorded an emotional plea asking ICE officials to release Marcelo Gomes da Silva. The 18-year-old is currently being held in an immigration detention center after being pulled over by police. Students at Milford High School staged a walk-out wearing white to show their support while the community launched a fundraiser to assist Gomes da Silva with legal expenses.",
        "create_time": 1749076566,
        "id": 7512226550691941674,
        "view_count": 2178982
      },
      {
        "like_count": 34411,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Thousands of people converged outside a cricket stadium in India on Wednesday to celebrate the Royal Challengers Bengaluru’s first Indian Premier League title win, officials said, before a crowd pushed through a gate, causing a crowd surge. #cnn #news #india #bengaluru #cricket #indianpremierleague #royalchallengersbengaluru #crowd ",
        "comment_count": 1185,
        "create_time": 1749070893,
        "id": 7512202125800344878,
        "share_count": 2897,
        "view_count": 1135075
      },
      {
        "id": 7512189377909443883,
        "share_count": 18,
        "video_description": "US tariffs on steel and aluminum just doubled to 50%. CNN’s Matt Egan breaks down what products could get more expensive and why the manufacturing industry is worried these tariffs could lead to job losses. #cnn #news #trump #tariffs #steel #aluminum",
        "create_time": 1749067938,
        "like_count": 535,
        "region_code": "US",
        "username": "cnn",
        "view_count": 30982,
        "comment_count": 69
      },
      {
        "like_count": 4245,
        "share_count": 523,
        "username": "cnn",
        "id": 7512167124236799278,
        "create_time": 1749062755,
        "region_code": "US",
        "video_description": "CNN's Hadas Gold interviews anti-democracy author Curtis Yarvin about his argument for an all-powerful executive in the White House. #cnn #news ",
        "view_count": 131564,
        "comment_count": 773
      },
      {
        "share_count": 6,
        "video_description": "Scenic Designer Scott Pask recreated the CBS newsroom and Edward R. Murrow’s set for \"Good Night, and Good Luck,\" the play that brings the 1950s McCarthy-era drama to life. Pask tells CNN why architectural accuracy is important for a play that’s about “speaking truth to power.” Tune in to CNN on Saturday, June 7 at 7pm to watch the play broadcast live from Broadway’s Winter Garden Theatre.",
        "like_count": 237,
        "region_code": "US",
        "id": 7512158623452187947,
        "username": "cnn",
        "view_count": 15348,
        "comment_count": 16,
        "create_time": 1749060775
      },
      {
        "region_code": "US",
        "username": "cnn",
        "view_count": 77319,
        "like_count": 5278,
        "share_count": 245,
        "video_description": "The Trump administration updated its MAHA report on children’s health after citation errors were reported. Epidemiologist Katherine Keyes speaks to CNN's Jacqueline Howard about discovering her name was included in research she never wrote. #CNN #health #mahareport",
        "comment_count": 89,
        "create_time": 1749055800,
        "id": 7512137215544233259
      },
      {
        "share_count": 12,
        "video_description": "The San Diego Humane Society took in a 2-month-old black bear cub after it was discovered alone in Los Padres National Forest. Caretakers at the wildlife center are dressing in bear costumes to prevent the bear from bonding with humans so it can ultimately be returned to the wild. #cnn #news #blackbear #blackbearcub #sandiego #humanesociety",
        "comment_count": 23,
        "id": 7512119738521242926,
        "like_count": 422,
        "region_code": "US",
        "create_time": 1749051735,
        "username": "cnn",
        "view_count": 13381
      },
      {
        "comment_count": 31,
        "create_time": 1749051039,
        "id": 7512116735215177006,
        "like_count": 612,
        "region_code": "US",
        "share_count": 31,
        "username": "cnn",
        "video_description": "On Monday a large, wild, Asian elephant lumbered in on an unexpecting store owner in Thailand. The hungry mammal went straight for the sweet counter, and also devoured bananas and peanuts. The 27-year-old male was eventually ushered out by park rangers, no one was hurt.",
        "view_count": 27874
      },
      {
        "username": "cnn",
        "video_description": "Film director Wes Anderson tells CNN’s Christiane Amanpour his films’ signature visual style is like “handwriting,” and evident in his latest, “The Phoenician Scheme.” #cnn #wesanderson #christianeamanpour ",
        "comment_count": 51,
        "create_time": 1749047896,
        "id": 7512103259125992750,
        "like_count": 1737,
        "region_code": "US",
        "share_count": 83,
        "view_count": 39541
      },
      {
        "like_count": 5698,
        "region_code": "US",
        "share_count": 153,
        "username": "cnn",
        "id": 7512098649157979435,
        "create_time": 1749046828,
        "video_description": "Ukraine said on Tuesday that it had hit the bridge connecting Russia and the occupied Crimean Peninsula with explosives planted underwater, in its third attack on the vital supply line for Moscow’s forces since the full-scale war began in 2022. CNN's Matthew Chance breaks down what could happen next if Russia responds. #ukraine #russia #crimea",
        "view_count": 237171,
        "comment_count": 435
      },
      {
        "region_code": "US",
        "share_count": 1459,
        "video_description": "Flash flood emergencies were declared in Wichita and El Dorado, Kansas after a month’s worth of rain fell on Tuesday alone. The heavy rain flooded roads and submerged cars, breaking Wichita’s June 3 rainfall record set in 1932, according to the National Weather Service. #cnn #news",
        "view_count": 173535,
        "comment_count": 270,
        "like_count": 10670,
        "username": "cnn",
        "create_time": 1749041991,
        "id": 7512077742725287210
      },
      {
        "comment_count": 809,
        "id": 7512055397235100974,
        "region_code": "US",
        "share_count": 177,
        "username": "cnn",
        "video_description": "CNN’s Harry Enten tells @Erin Burnett OutFront that MyPillow CEO Mike Lindell’s infomercial aired about 181 times per day at its peak in 2012. Lindell is on trial in a defamation case brought by a former Dominion Voting Systems employee. #cnn #news ",
        "create_time": 1749036710,
        "like_count": 8872,
        "view_count": 246990
      },
      {
        "create_time": 1749031215,
        "id": 7512031156821577006,
        "share_count": 33,
        "video_description": "CNN's Kristie Lu Stout reports on the vulnerability of US consumers to the threats of pharmaceutical tariffs against China, which could impede the supply and price of essential drugs to the US. #cnn #pharma #us #china",
        "view_count": 21559,
        "comment_count": 52,
        "like_count": 657,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "id": 7511938767167474986,
        "video_description": "Lee Jae-myung of the Democratic Party has been elected as South Korea's new president, following months of political turmoil. The snap election came after the removal of former president Yoon Suk Yeol, who declared martial law last December. CNN's Mike Valerio reports from Seoul on what the country's new leader would mean for South Korea's democracy, economy and trade ties with the US. #cnn #news #southkorea",
        "view_count": 1605806,
        "comment_count": 805,
        "create_time": 1749009575,
        "like_count": 105527,
        "region_code": "US",
        "share_count": 1856,
        "username": "cnn"
      },
      {
        "comment_count": 91,
        "like_count": 1730,
        "region_code": "US",
        "share_count": 34,
        "username": "cnn",
        "create_time": 1748999825,
        "id": 7511896903982861611,
        "video_description": "CNN's Anderson Cooper interviews actor George Clooney on the set of his Broadway play, \"Good Night, and Good Luck\" which is focused on Edward R. Murrow's famous battle with Senator Joseph McCarthy. Watch CNN’s special presentation of George Clooney’s “Good Night, and Good Luck” on Saturday, June 7 at 7pm ET streaming live on CNN.com.",
        "view_count": 44635
      },
      {
        "share_count": 36843,
        "video_description": "TRUMP IN A CHICKEN SUIT: DNC TROLLS TRUMP WITH A TACO TRUCK",
        "comment_count": 5590,
        "create_time": 1748997626,
        "id": 7511887468837227822,
        "region_code": "US",
        "like_count": 257252,
        "username": "cnn",
        "view_count": 1725693
      },
      {
        "create_time": 1749164400,
        "id": 7512603683637644590,
        "like_count": 752,
        "region_code": "US",
        "share_count": 16,
        "view_count": 42136,
        "comment_count": 59,
        "username": "cnn",
        "video_description": "President Donald Trump signed a proclamation to ban travel from several countries to the US, citing security risks, with one of the countries being Venezuela. Venezuelans in Florida reacted to the ban, with one worrying about their visa."
      },
      {
        "username": "cnn",
        "view_count": 208780,
        "create_time": 1749163148,
        "id": 7512598343277677866,
        "like_count": 4096,
        "region_code": "US",
        "share_count": 52,
        "comment_count": 221,
        "video_description": "In an interview with CNN’s Jake Tapper, German Chancellor Friedrich Merz talks about the impact President Trump's tariffs are having on the auto industry."
      },
      {
        "username": "cnn",
        "video_description": "US District Judge Arun Subramanian warned the defense team for Sean ‘Diddy’ Combs that he will be removed from the New York City court room where he is on trial facing charges that include racketeering, sex trafficking and transportation to engage in prostitution.",
        "view_count": 155700,
        "comment_count": 107,
        "id": 7512551509544996139,
        "like_count": 4540,
        "region_code": "US",
        "share_count": 217,
        "create_time": 1749152216
      },
      {
        "comment_count": 1101,
        "id": 7512521758151331118,
        "like_count": 42430,
        "username": "cnn",
        "video_description": "President Trump said he was “very disappointed” with Elon Musk, as the tech billionaire and former adviser continues to blast Trump’s massive tax and spending cuts package. The bill is estimated to add $2.4 trillion to the deficit over the next decade. Musk responded on X in real-time saying that he never saw the bill before it passed and said the elimination of America’s electric vehicle tax incentives has nothing to do with his opposition to Trump's bill.",
        "create_time": 1749145290,
        "region_code": "US",
        "share_count": 3005,
        "view_count": 898334
      },
      {
        "share_count": 307,
        "video_description": "Texas lawmakers passed a bill with bipartisan support to ban THC products in Texas, arguing they’re too dangerous for consumers. Industry leaders say it could essentially eliminate a multi-billion-dollar industry in the state. Both sides are waiting to see if Gov. Greg Abbott will sign or veto the bill. CNN’s Ed Lavandera reports. #cnn #texas #thc ",
        "comment_count": 1209,
        "id": 7512507075956755758,
        "like_count": 10280,
        "view_count": 198222,
        "create_time": 1749141873,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "video_description": "Eager gaming fans lined up for hours to buy the Nintendo Switch 2 after it hit shelves around the world on June 5. It’s Nintendo’s first major console launch since the original Switch arrived roughly eight years ago. #cnn #news #nintendoswitch",
        "like_count": 576,
        "region_code": "US",
        "share_count": 138,
        "username": "cnn",
        "view_count": 47204,
        "comment_count": 62,
        "create_time": 1749141860,
        "id": 7512507021334154539
      },
      {
        "id": 7512491503575436590,
        "like_count": 1110,
        "region_code": "US",
        "share_count": 41,
        "view_count": 75734,
        "comment_count": 106,
        "create_time": 1749138244,
        "username": "cnn",
        "video_description": "Some economists are questioning the accuracy of recent US inflation data amid federal staffing shortages impacting the Bureau of Labor Statistics. Federal Reserve Bank of Minneapolis President & CEO Neel Kashkari discusses how he’s looking at other data sets beyond BLS with CNN’s @Erin Burnett OutFront #cnn #news "
      },
      {
        "share_count": 228,
        "username": "cnn",
        "region_code": "US",
        "video_description": "The Chelan County Sheriff's Office released footage of Travis Decker, the Washington father wanted on suspicion of murder of his three young daughters, days before they were reported missing. #cnn #news #chelanwa",
        "view_count": 527659,
        "comment_count": 250,
        "create_time": 1749137000,
        "id": 7512486150439750954,
        "like_count": 14633
      },
      {
        "like_count": 20582,
        "region_code": "US",
        "username": "cnn",
        "video_description": "The Trump administration is taking hundreds of migrant children already residing in the United States out of their homes and into government custody, at times separating them from their families and making it more difficult for them to be released, according to multiple sources familiar with the matter.",
        "view_count": 302921,
        "id": 7512480527060847914,
        "create_time": 1749135690,
        "share_count": 552,
        "comment_count": 603
      },
      {
        "like_count": 197,
        "video_description": "CNN's Chief Medical Correspondent Dr. Sanjay Gupta answers your questions about filtering out fluoride from your tap water and explains why it's not really necessary. #cnn #health #fluoride #water ",
        "region_code": "US",
        "share_count": 8,
        "username": "cnn",
        "view_count": 15885,
        "comment_count": 15,
        "create_time": 1749132348,
        "id": 7512466156326784298
      },
      {
        "create_time": 1749131935,
        "id": 7512464391745391914,
        "comment_count": 71,
        "like_count": 971,
        "region_code": "US",
        "share_count": 113,
        "username": "cnn",
        "video_description": "Two Chinese researchers have been charged with smuggling a \"potential agroterrorism weapon\" into the US in a wad of tissues, according to an FBI affidavit. CNN's Max Foster explains how laboratory testing discovered a sample containing a DNA sequence with the potential to cause a fungal disease that could decimate crops, and impact human health. #cnn #news",
        "view_count": 45843
      },
      {
        "view_count": 32045,
        "comment_count": 32,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Around 10 decommissioned public transit buses caught fire at Southeastern Pennsylvania Transportation Authority’s largest facility early Thursday. #cnn #news",
        "create_time": 1749130962,
        "id": 7512460218148637995,
        "like_count": 459,
        "share_count": 17
      },
      {
        "create_time": 1749115330,
        "like_count": 73639,
        "share_count": 5788,
        "view_count": 1824701,
        "video_description": "President Donald Trump announced a new travel ban, blocking several countries from entry to the US. The ban will fully restrict entry of nationals from Afghanistan, Myanmar, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. It will also partially restrict nationals from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela. The proclamation signed does include exceptions for lawful permanent residents, existing visa holders, certain visa categories and individuals whose entry serves US national interests. #CNN #news",
        "comment_count": 3409,
        "id": 7512393060098182446,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "region_code": "US",
        "share_count": 545,
        "view_count": 254477,
        "comment_count": 258,
        "id": 7512292423800753454,
        "username": "cnn",
        "video_description": "CNN's Anderson Cooper interviewed actor George Clooney on the set of his Broadway play, \"Good Night, and Good Luck,\" which is focused on Edward R. Murrow's famous battle with Senator Joseph McCarthy. Clooney discussed whether he personally fears being targeted by the Trump administration. Watch CNN’s special presentation of George Clooney’s “Good Night, and Good Luck” on Saturday, June 7 at 7pm ET streaming live on CNN.com.",
        "create_time": 1749091916,
        "like_count": 33988
      },
      {
        "like_count": 22393,
        "region_code": "US",
        "share_count": 582,
        "view_count": 342439,
        "comment_count": 816,
        "create_time": 1749082338,
        "id": 7512251292266302766,
        "username": "cnn",
        "video_description": "Greta Thunberg has set sail with eleven other activists to Gaza. The activist group they're part of, The Freedom Flotilla Coalition, is attempting to bring aid and raise international awareness over the ongoing humanitarian crisis in the territory."
      },
      {
        "create_time": 1749252668,
        "id": 7512982821892377899,
        "like_count": 8107,
        "region_code": "US",
        "share_count": 332,
        "video_description": "A former romantic partner for Sean ‘Diddy’ Combs using the pseudonym “Jane” described feeling financially coerced and revealed Combs is still paying for her rent, even as she testified against him at trial. Prosecutors hope the testimony by “Jane” will drive home charges that include sex trafficking, racketeering conspiracy and transportation to engage in prostitution. Combs has pleaded not guilty to all charges.",
        "view_count": 273756,
        "comment_count": 460,
        "username": "cnn"
      },
      {
        "view_count": 378541,
        "comment_count": 616,
        "create_time": 1749244882,
        "region_code": "US",
        "share_count": 521,
        "video_description": "CNN's Fareed Zakaria discusses the bitter feud between President Donald Trump and tech billionaire Elon Musk and who he predicts Republicans will side with in the end.",
        "id": 7512949399987752235,
        "like_count": 9563,
        "username": "cnn"
      },
      {
        "comment_count": 353,
        "create_time": 1749234940,
        "share_count": 2600,
        "video_description": "Surveillance video shows a delivery driver accidentally entering a “unauthorized secured area” at Chicago O’Hare Airport, pulling up near parked planes before being stopped by airport staff, according to police. #cnn #news #doordash #ohare",
        "view_count": 591294,
        "id": 7512906660860448043,
        "like_count": 31990,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "create_time": 1749234601,
        "share_count": 53,
        "username": "cnn",
        "video_description": "Author Sarah Hoover says post-partum depression made her feel 'monstrous' in unforeseen ways. She joined Isa's Book Club for an honest and unfiltered conversation about motherhood and her new memoir, 'The Motherload.' @sarahhoov ",
        "view_count": 73393,
        "comment_count": 49,
        "id": 7512905231798242606,
        "like_count": 2901,
        "region_code": "US"
      },
      {
        "comment_count": 3818,
        "id": 7512905148771945770,
        "like_count": 304550,
        "region_code": "US",
        "share_count": 5768,
        "username": "cnn",
        "video_description": "Greta Thunberg, Yasemin Acar and other activists are sailing to Gaza. The activist group they’re apart of, The Freedom Flotilla Coalition, is attempting to bring aid and raise international awareness over the ongoing humanitarian crisis. In response, Israel says it is prepared for a “wide range of scenarios.”",
        "create_time": 1749234585,
        "view_count": 3167081
      },
      {
        "username": "cnn",
        "video_description": "Amid a constantly changing reproductive landscape, West Virginia prosecutor Tom Truman is warning women who have miscarriages in his state that they could get in trouble with the law. Truman tells CNN’s Pam Brown that although he personally wouldn’t prosecute someone for a miscarriage, he made the suggestion out of an abundance of caution after hearing from other prosecutors and looking at the laws in West Virginia.",
        "view_count": 961997,
        "comment_count": 2909,
        "create_time": 1749234536,
        "id": 7512904976612511018,
        "share_count": 13936,
        "like_count": 95414,
        "region_code": "US"
      },
      {
        "id": 7512899167736417578,
        "region_code": "US",
        "video_description": "What else is there to say about President Donald Trump and Elon Musk's feud? CNN’s @Abby Phillip uses GIFS and memes to break down their very public breakup.",
        "comment_count": 492,
        "create_time": 1749233192,
        "like_count": 11571,
        "share_count": 970,
        "username": "cnn",
        "view_count": 224770
      },
      {
        "create_time": 1749232536,
        "like_count": 865,
        "share_count": 35,
        "username": "cnn",
        "view_count": 74417,
        "comment_count": 26,
        "id": 7512896358051745070,
        "region_code": "US",
        "video_description": "CNN meteorologist Brandon Miller shares 4 tips on how to avoid hurricanes during your beach vacation this summer. #cnn #news #weather"
      },
      {
        "create_time": 1749224875,
        "region_code": "US",
        "share_count": 26,
        "video_description": "In response to hints of “biosignatures” found on a world called K2-18b, new research suggests there’s a lot of uncertainty surrounding the exoplanet. CNN’s Ashley Strickland reports on the ongoing scientific discourse around the search for extraterrestrial life. #cnn #space #exoplanet ",
        "comment_count": 87,
        "like_count": 2090,
        "username": "cnn",
        "view_count": 69026,
        "id": 7512863399752109355
      },
      {
        "region_code": "US",
        "share_count": 796,
        "create_time": 1749223897,
        "id": 7512859372612029742,
        "like_count": 27481,
        "view_count": 1178707,
        "comment_count": 2947,
        "username": "cnn",
        "video_description": "In a phone call with CNN's Dana Bash, President Donald Trump said he is “not even thinking about” billionaire Elon Musk and won’t be speaking to him in the near future. The comments come a day after Trump and Musk traded barbs on social media as their relationship deteriorated in spectacular public fashion. #cnn #news #trump #elon #musk"
      },
      {
        "create_time": 1749219933,
        "share_count": 1147,
        "view_count": 237999,
        "region_code": "US",
        "username": "cnn",
        "video_description": "See some reactions to the intense public feud that erupted between President Donald Trump and his one-time ally, billionaire Elon Musk. #CNN #News",
        "comment_count": 436,
        "id": 7512842148874603818,
        "like_count": 28904
      },
      {
        "view_count": 3716969,
        "create_time": 1749201565,
        "region_code": "US",
        "username": "cnn",
        "share_count": 2775,
        "video_description": "Russia launched waves of drones and ballistic missiles at multiple targets across a broad swath of Ukraine overnight killing at least four people in the capital Kyiv and wounding around 40 across the country. #CNN #news",
        "comment_count": 6257,
        "id": 7512763032913644843,
        "like_count": 106951
      },
      {
        "region_code": "US",
        "share_count": 3195,
        "id": 7512669478904368430,
        "like_count": 26848,
        "username": "cnn",
        "video_description": "CNN’s Erin Burnett talks with Forbes Magazine’s Dan Alexander about President Donald Trump’s stunning ownership of billions of dollars worth of crypto.",
        "view_count": 1061236,
        "comment_count": 1995,
        "create_time": 1749179704
      },
      {
        "comment_count": 467,
        "create_time": 1749178230,
        "id": 7512663147782655275,
        "view_count": 346360,
        "video_description": "CNN’s Anderson Cooper talks with Kara Swisher about the stunning public feud between President Donald Trump and Elon Musk.",
        "like_count": 11456,
        "region_code": "US",
        "share_count": 205,
        "username": "cnn"
      },
      {
        "create_time": 1749176853,
        "region_code": "US",
        "share_count": 263,
        "view_count": 147622,
        "comment_count": 334,
        "like_count": 5214,
        "username": "cnn",
        "video_description": "An intense public feud erupted between President Donald Trump and his one-time ally, billionaire Elon Musk, with an argument about Trump’s massive tax and domestic policy bill raging across social media and in the Oval Office. CNN’s senior White House correspondent Kristen Holmes reports. #CNN #News ",
        "id": 7512657229397626158
      },
      {
        "comment_count": 459,
        "id": 7512635002987892014,
        "video_description": "High school senior Mykale Baker went to his high school graduation, and after, decided to get some food for his family at Burger King, which is where he works. After seeing how short staffed they were, he decided to help out the team. Maria Mendoza saw him at work and started a GoFundMe page for him, which has raised almost $200 thousand dollars towards his college fund.",
        "view_count": 422158,
        "create_time": 1749171677,
        "like_count": 67431,
        "region_code": "US",
        "share_count": 1352,
        "username": "cnn"
      },
      {
        "create_time": 1749331963,
        "id": 7513323403257056558,
        "like_count": 21556,
        "region_code": "US",
        "view_count": 369421,
        "comment_count": 2659,
        "username": "cnn",
        "video_description": "A new study shows young men have moved away from Democrats in 2024. Ilyse Hogue, co-founder of the Speaking with American Men Project, tells Michael Smerconish that while many men still support progressive values, they don’t always see themselves represented in the Democratic party. #youngmen #democrats #republicans #cnn #news",
        "share_count": 559
      },
      {
        "view_count": 70824,
        "like_count": 2741,
        "create_time": 1749320452,
        "id": 7513273940748373291,
        "region_code": "US",
        "share_count": 81,
        "username": "cnn",
        "video_description": "The 50th anniversary of Pride celebrations has kicked off in the nation’s capital this weekend with World Pride 2025. CNN's Julia Benbrook spoke to members and supporters of the LGBTQ community as they gathered in Washington, DC, to hear why some traveled hundreds of miles to attend. #cnn #news #pride #worldpride #lgbtq #lgtbtiktok ",
        "comment_count": 173
      },
      {
        "id": 7513200285561425198,
        "region_code": "US",
        "share_count": 1626,
        "comment_count": 736,
        "create_time": 1749303316,
        "like_count": 56986,
        "username": "cnn",
        "video_description": "Soccer fans celebrated as Uzbekistan qualified for its first ever FIFA World Cup, after a goalless draw with the United Arab Emirates. The victory makes Uzbekistan the first ever central Asian country to qualify for the World Cup. Uzbekistan goalkeeper Utkir Yusupov’s six saves, including a last-second stop, guaranteed his team a priceless point, to proceed with one game of qualifying remaining. Fans celebrated the news across the soccer-obsessed nation, with people taking to the streets to cheer and march, with traditional music and songs. #cnn #news #worldcup #worldcup2025 #fifa #uzbekistan #uae #ubzek #soccer #futbol #footballtiktok #soccertiktok ",
        "view_count": 864869
      },
      {
        "video_description": "A breakthrough in adaptive optics technology captured the clearest images to date of the sun’s corona. The incredible resolution of the new images could provide new insights on some of the mysteries surrounding our star. #cnn #news #sun #science #space #technology #tech",
        "view_count": 24298,
        "comment_count": 31,
        "create_time": 1749292625,
        "id": 7513153830994054446,
        "region_code": "US",
        "share_count": 27,
        "username": "cnn",
        "like_count": 471
      },
      {
        "id": 7513080253573532970,
        "like_count": 67107,
        "username": "cnn",
        "video_description": "Federal immigration operations in Los Angeles were met by protests. ICE declined to discuss the details of its operations. #cnn #news #losangeles",
        "create_time": 1749275366,
        "region_code": "US",
        "share_count": 2551,
        "view_count": 847101,
        "comment_count": 3270
      },
      {
        "view_count": 315377,
        "like_count": 14390,
        "region_code": "US",
        "share_count": 683,
        "username": "cnn",
        "video_description": "CNN’s Erin Burnett talks with Simon Sandoval-Moshenberg, attorney for Kilmar Abrego Garcia, the Maryland man mistakenly deported to El Salvador in March, who has been returned to the United States to face federal criminal charges.",
        "comment_count": 1158,
        "create_time": 1749262759,
        "id": 7513026196125355307
      },
      {
        "view_count": 101835,
        "comment_count": 426,
        "region_code": "US",
        "username": "cnn",
        "video_description": "CNN's Ben Hunte breaks down how the Trump Administration has targeted the LGBTQ+ community with its policies in just the first few days of Pride Month.",
        "create_time": 1749257296,
        "id": 7513002694626331950,
        "like_count": 6640,
        "share_count": 131
      },
      {
        "view_count": 2094383,
        "comment_count": 15252,
        "create_time": 1749418240,
        "like_count": 126295,
        "username": "cnn",
        "id": 7513693975602056490,
        "region_code": "US",
        "share_count": 6975,
        "video_description": "Democratic Rep. Maxine Waters of California was denied entry to the Metropolitan Detention Center in Los Angeles while trying to speak with David Huerta. The leader of the Service Employees International Union California was arrested by federal agents after prosecutors say he tried to obstruct their access to a worksite. He has called actions taken against protesters an “injustice.”"
      },
      {
        "comment_count": 1247,
        "create_time": 1749410296,
        "id": 7513659833942428971,
        "region_code": "US",
        "like_count": 34341,
        "share_count": 444,
        "username": "cnn",
        "video_description": "Palestinians at the Netzarim aid distribution point in Gaza shared their frustrations with the system, telling CNN they don’t think the aid boxes are being distributed fairly. The Gaza Humanitarian Foundation has said the aid boxes are designed to feed one family in Gaza for 3.5 days. #cnn #news #gaza #palestinians #aid #humanitarianaid",
        "view_count": 637017
      },
      {
        "like_count": 757631,
        "region_code": "US",
        "username": "cnn",
        "view_count": 7445861,
        "comment_count": 18204,
        "id": 7513602058491088170,
        "video_description": "Senator Bernie Sanders (I-VT) criticized President Donald Trump’s decision to deploy National Guard troops in Los Angeles, claiming that Trump “wants all of the power” and is rapidly moving the US “into authoritarianism.” #berniesanders #donaldtrump #losangeles #immigration #protest #nationalguard #cnn #news",
        "create_time": 1749396857,
        "share_count": 27130
      },
      {
        "id": 7513585946428886318,
        "like_count": 9855,
        "video_description": "On World Oceans Day, Prince William pleaded to an international audience to “think big in your actions,” as the Prince of Wales outlined an agreement that seeks to protect 30% of land and sea by 2030. It comes after a conversation between the prince and Sir David Attenborough was shared this weekend in which the biologist said that what humans have done to oceans \"is just unspeakably awful.\" #cnn #news #worldoceansday #princewilliam #ocean #climatechange #climate #environment #british ",
        "username": "cnn",
        "view_count": 258401,
        "comment_count": 476,
        "create_time": 1749393109,
        "region_code": "US",
        "share_count": 202
      },
      {
        "comment_count": 3903,
        "username": "cnn",
        "view_count": 996853,
        "create_time": 1749387633,
        "id": 7513562234652757294,
        "like_count": 35537,
        "region_code": "US",
        "share_count": 3175,
        "video_description": "As the 250th anniversary celebration for the US Army approaches, a freight train of tanks was seen making its way into the nation's capital. The long-planned celebration in Washington will coincide with Trump's 79th birthday and include thousands of troops. The Army had said it has no plans to recognize the president's birthday. #cnn #news #trump #usarmy"
      },
      {
        "username": "cnn",
        "view_count": 549945,
        "comment_count": 206,
        "id": 7513477956996648238,
        "like_count": 12748,
        "region_code": "US",
        "create_time": 1749367998,
        "share_count": 607,
        "video_description": "A Colombian senator and presidential hopeful is in a critical condition after being shot twice at an event in Bogota, according to national police and prosecutors. Police arrested a 15-year-old carrying a Glock pistol, according to the Attorney General’s Office. Miguel Uribe expressed intentions to run in the 2026 presidential election for the country’s largest opposition party, the center-right Centro Democrático, or Democratic Center. #cnn #news #colombia #migueluribe"
      },
      {
        "comment_count": 1552,
        "id": 7513425917562113326,
        "video_description": "President Donald Trump signed a presidential memorandum deploying 2,000 National Guardsmen to disperse the protests that began in the Los Angeles area in response to immigration raids. Law enforcement authorities and demonstrators have clashed for two days. CNN's @Julia Vargas Jones reports. #cnn #news #losangeles #dtla #immigration #ice ",
        "username": "cnn",
        "view_count": 520043,
        "create_time": 1749355827,
        "like_count": 33377,
        "region_code": "US",
        "share_count": 2204
      },
      {
        "create_time": 1749342467,
        "id": 7513368565953596718,
        "region_code": "US",
        "view_count": 94959,
        "comment_count": 95,
        "like_count": 5908,
        "share_count": 42,
        "username": "cnn",
        "video_description": "Coco Gauff claimed her second career grand slam singles title, defeating world No. 1 Aryna Sabalenka in the French Open women’s final."
      },
      {
        "create_time": 1749511694,
        "share_count": 27,
        "username": "cnn",
        "comment_count": 95,
        "id": 7514095333014523178,
        "like_count": 827,
        "region_code": "US",
        "video_description": "Protests are in their fourth day in Los Angeles in response to the Trump administration's immigration crackdown. CNN's Kyung Lah reports from the center of the demonstrations.",
        "view_count": 42345
      },
      {
        "create_time": 1749506340,
        "id": 7514072340943162670,
        "like_count": 30298,
        "comment_count": 819,
        "share_count": 787,
        "username": "cnn",
        "video_description": "President Donald Trump deployed about 300 National Guard troops to Los Angeles to protect federal personnel and property as clashes broke out between demonstrators and police this weekend. CNN Chief Law Enforcement and Intelligence Analyst John Miller analyzes what it might take for Trump to deploy active military to a major city.",
        "view_count": 394635,
        "region_code": "US"
      },
      {
        "id": 7514053908969442602,
        "region_code": "US",
        "username": "cnn",
        "comment_count": 284,
        "create_time": 1749502053,
        "like_count": 972,
        "share_count": 30,
        "video_description": "A judge dismissed Justin Baldoni’s $400 million defamation lawsuit against Hollywood power couple Blake Lively and Ryan Reynolds, a major development in the ongoing civil litigation between former co-stars Lively and Baldoni. Executive editor for Deadline Hollywood Dominic Patten joins CNN's Brianna Keilar to discuss.",
        "view_count": 88322
      },
      {
        "comment_count": 12526,
        "id": 7513997752376888618,
        "like_count": 630743,
        "region_code": "US",
        "share_count": 14945,
        "username": "cnn",
        "video_description": "Mexican President Claudia Sheinbaum said she does not agree with the violent immigration protests in Los Angeles and urged Mexicans in California to “not fall into provocations.” The president emphasized that Mexicans in the US “are good men and women.” #CNN #news #LosAngeles #Mexico #LA #sheinbaum #claudiasheimbaum ",
        "view_count": 5537635,
        "create_time": 1749488985
      },
      {
        "id": 7513972005742464299,
        "region_code": "US",
        "share_count": 98,
        "username": "cnn",
        "video_description": "A zebra, that escaped from its owner in Christiana, Tennessee was captured on Sunday and airlifted to safety by the local sheriff's office. The animal, named Ed, had been reported missing just a day after he was acquired by its owners in Rutherford County. They have since been reunited.",
        "comment_count": 53,
        "create_time": 1749483000,
        "like_count": 1237,
        "view_count": 74615
      },
      {
        "comment_count": 383,
        "create_time": 1749481796,
        "id": 7513966805883424042,
        "like_count": 3045,
        "share_count": 78,
        "region_code": "US",
        "username": "cnn",
        "video_description": "World heavyweight boxing champion Oleksandr Usyk shared a message for President Trump in an interview with CNN, asking him to help Ukraine as it continues its fight against a full-scale Russian invasion. #cnn #news",
        "view_count": 137942
      },
      {
        "id": 7513931837836840238,
        "username": "cnn",
        "video_description": "Israel has intercepted a Gaza-bound aid ship carrying Greta Thunberg and other prominent activists, detaining those onboard, according to the Freedom Flotilla Coalition (FFC), with Israel’s foreign ministry saying activists have been taken to Israel. #cnn #news",
        "view_count": 253522,
        "comment_count": 575,
        "like_count": 13213,
        "region_code": "US",
        "share_count": 540,
        "create_time": 1749473672
      },
      {
        "id": 7513894573588892970,
        "region_code": "US",
        "create_time": 1749465010,
        "like_count": 86758,
        "share_count": 4837,
        "username": "cnn",
        "video_description": "Billboards thanking President Trump have popped up across Damascus, Syria’s capital city. CNN’s Clarissa Ward meets the woman trying to “Make Syria Great Again.” #cnn #news #syria #damascus #trump",
        "view_count": 2123730,
        "comment_count": 2175
      },
      {
        "comment_count": 2734,
        "like_count": 123631,
        "region_code": "US",
        "share_count": 6342,
        "video_description": "CNN takes a look at protests in Los Angeles over the weekend in response to immigration raids. Immigration authorities and demonstrators clashed over the weekend with unrest beginning Friday after dozens of people were detained by federal immigration agents across different locations. President Donald Trump has deployed 2,000 National Guardsmen to the city to disperse protests. #cnn #news #LA #LAprotests #ICEprotest",
        "view_count": 1459090,
        "create_time": 1749457175,
        "id": 7513860797047606571,
        "username": "cnn"
      },
      {
        "comment_count": 1521,
        "id": 7513784692936641834,
        "video_description": "CNN's Kyung Lah reports on self-driving cars being set on fire and vandalized during protests against immigration raids in Los Angeles.",
        "view_count": 374711,
        "create_time": 1749439372,
        "like_count": 17933,
        "region_code": "US",
        "share_count": 404,
        "username": "cnn"
      },
      {
        "id": 7513745284669689134,
        "like_count": 7567,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Demonstrators flood the streets, including freeways, near an initial protest site at the Metropolitan Detention Center after the assembly was declared unlawful by the Los Angeles Police Department. CNN affiliate KABC captured aerial video from the scene.",
        "comment_count": 573,
        "create_time": 1749430183,
        "share_count": 225,
        "view_count": 175698
      },
      {
        "share_count": 6187,
        "video_description": "Law enforcement has launched pepper balls, spray, and tear gas into the crowd outside of the Metropolitan Detention Center to disperse protesters, who have been clashing with National Guard, ICE and DHS agents outside of the detention center in Los Angeles.",
        "view_count": 985459,
        "comment_count": 4443,
        "create_time": 1749429908,
        "like_count": 106179,
        "region_code": "US",
        "id": 7513744098193591598,
        "username": "cnn"
      },
      {
        "share_count": 0,
        "username": "cnn",
        "comment_count": 228,
        "create_time": 1749595544,
        "like_count": 0,
        "view_count": 0,
        "id": 7514455583119133998,
        "region_code": "US",
        "video_description": "Austria is reeling from one of the worst rampages in the country's history after a gunman opened fire at a high school in the city of Graz, killing 10 people, including teenagers. Elke Kahr, mayor of Graz, spoke to CNN's Frederik Pleitgen during a candlelight vigil as the city reflects on the rare tragedy. #cnn #news #austria #graz "
      },
      {
        "comment_count": 868,
        "id": 7514448935658736938,
        "video_description": "Mexico’s flag has become a defining symbol of the protests in Los Angeles, sparking a heated debate amongst the Latino community about whether or not it’s disrespectful. CNN’s Rafael Romo breaks down the debate and what the it means to be Mexican-American right now. #cnn #news #losangeles #mexico #mexican #mexicanamerican #mexicoflag #mexico🇲🇽 #LA ",
        "view_count": 0,
        "username": "cnn",
        "create_time": 1749593998,
        "like_count": 0,
        "region_code": "US",
        "share_count": 0
      },
      {
        "region_code": "US",
        "share_count": 0,
        "username": "cnn",
        "comment_count": 36,
        "id": 7514429592308960554,
        "like_count": 0,
        "create_time": 1749589531,
        "video_description": "CNN's Elizabeth Wagmeister explains that Sean \"Diddy\" Combs' defense team requested a mistrial for a second time, which was denied. Combs' team accused the prosecution of presenting false testimony from Bryana Bongolan, a friend of Cassie Ventura's, who testified that Combs dangled her over a balcony.",
        "view_count": 0
      },
      {
        "username": "cnn",
        "view_count": 0,
        "comment_count": 47,
        "create_time": 1749585484,
        "share_count": 0,
        "video_description": "US Health and Human Services Secretary Robert F. Kennedy Jr. dismissed an expert panel of vaccine advisers, accusing them of being “plagued with conflicts of interest.” CNN’s Kate Bolduan speaks to one of those dismissed members about those claims and the effect this decision may have. #cnn #health #vaccine #rfkjr ",
        "id": 7514412245141474602,
        "like_count": 0,
        "region_code": "US"
      },
      {
        "username": "cnn",
        "video_description": "As protests continue in Los Angeles, about 700 Marines have been activated to help protect federal personnel and property. CNN speaks with LA residents to get their reactions.",
        "view_count": 0,
        "like_count": 0,
        "region_code": "US",
        "id": 7514390398157065515,
        "share_count": 0,
        "comment_count": 2712,
        "create_time": 1749580392
      },
      {
        "comment_count": 18437,
        "share_count": 0,
        "username": "cnn",
        "video_description": "During a subcommittee hearing, Democratic Rep. Pete Aguilar of California pressed Defense Secretary Pete Hegseth about President Donald Trump’s decision to mobilize the National Guard and deploy Marines to help quell protests in Los Angeles. #cnn #news #politics #losangeles",
        "view_count": 0,
        "create_time": 1749580033,
        "id": 7514388854472969518,
        "like_count": 0,
        "region_code": "US"
      },
      {
        "comment_count": 351,
        "id": 7514386747782909226,
        "username": "cnn",
        "video_description": "President Donald Trump credited himself and his administration for deploying the National Guard to address the violence that erupted during immigration protests in Los Angeles. Democratic Congresswoman Laura Friedman, who represents parts of the city, called his remarks “shocking.” #donaldtrump #losangeles #immigration #protests #democrat #reaction #cnn #news",
        "view_count": 0,
        "create_time": 1749579546,
        "like_count": 0,
        "region_code": "US",
        "share_count": 0
      },
      {
        "region_code": "US",
        "share_count": 0,
        "view_count": 0,
        "comment_count": 176,
        "create_time": 1749577685,
        "username": "cnn",
        "video_description": "An individual in the bed of a white truck dumped large wooden boards onto the road during a high-speed chase with law enforcement officers in Montgomery County, Ohio. Later, the truck drove the wrong way on Interstate 75 and caused a six-vehicle collision. No life-threatening injuries were reported after the accident, according to the Montgomery County Sheriff’s Office. #cnn #news",
        "id": 7514378721965591854,
        "like_count": 0
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "The mayor of Cali, Colombia, Alejandro Eder, said explosive devices were detonated in at least two locations near police stations across Colombia's third largest city. Several people were injured in the explosions, sources from the Cali Metropolitan Police confirmed to CNN. #cnn #news #breakingnews #colombia #cali #explosion #colombian ",
        "view_count": 0,
        "create_time": 1749575081,
        "id": 7514367564743445806,
        "like_count": 0,
        "comment_count": 815,
        "share_count": 0
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "Jamie Foxx was overcome with emotion while accepting the Ultimate Icon Award at the BET Awards. He reflected on his 2023 health scare.",
        "view_count": 0,
        "comment_count": 33,
        "create_time": 1749575043,
        "id": 7514367459994930474,
        "like_count": 0,
        "share_count": 0
      },
      {
        "username": "cnn",
        "video_description": "Protesters and police faced off in scattered protests in downtown Los Angeles for a fourth day on Monday. Officers dispersed and detained some protesters after objects were thrown at them. Damage appears to be limited to a portion of downtown LA, while much of the city has not been affected. #CNN #News",
        "comment_count": 161,
        "create_time": 1749570095,
        "like_count": 0,
        "region_code": "US",
        "share_count": 0,
        "id": 7514346090112699694,
        "view_count": 0
      },
      {
        "comment_count": 1016,
        "create_time": 1749566150,
        "like_count": 0,
        "region_code": "US",
        "video_description": "Los Angeles Mayor Karen Bass criticized people who are vandalizing the city amid widespread protests. CNN correspondent Stephanie Elam gets a closer look at some of the looting and vandalism in downtown LA. #losangeles #immigration #protests #vandalism #graffiti #cnn #news",
        "view_count": 0,
        "id": 7514329129869692206,
        "share_count": 0,
        "username": "cnn"
      },
      {
        "comment_count": 1822,
        "create_time": 1749563583,
        "username": "cnn",
        "video_description": "A gunman in Austria opened fire on a school in the southern city of Graz, killing himself and at least nine others. The death toll includes teenagers between the ages of 14 and 18, the Austrian interior ministry said. CNN’s Frederik Pleitgen reports.",
        "view_count": 0,
        "id": 7514318114625015086,
        "like_count": 0,
        "region_code": "US",
        "share_count": 0
      },
      {
        "like_count": 0,
        "username": "cnn",
        "video_description": "CNN's Jason Carroll and his crew were briefly detained and escorted out of a LA protest zone by police officers. One police officer told the crew to put their hands behind their backs so they could be walked out of the protest zone. #CNN #news #LA #california #protest",
        "view_count": 0,
        "comment_count": 30142,
        "create_time": 1749535016,
        "id": 7514195333367254315,
        "region_code": "US",
        "share_count": 0
      },
      {
        "comment_count": 171,
        "like_count": 0,
        "region_code": "US",
        "share_count": 0,
        "view_count": 0,
        "create_time": 1749518775,
        "id": 7514125781606468906,
        "username": "cnn",
        "video_description": "CNN's Jake Tapper speaks with Blake Lively's attorney Michael Gottlieb about how Taylor Swift was brought into the legal fight between Lively and Justin Baldoni."
      },
      {
        "comment_count": 1031,
        "id": 7514120117668678958,
        "region_code": "US",
        "username": "cnn",
        "create_time": 1749517455,
        "like_count": 0,
        "share_count": 0,
        "video_description": "White House border czar Tom Homan joined CNN’s Kaitlan Collins to discuss comments President Donald Trump made suggesting Homan arrest California Governor Gavin Newsom.",
        "view_count": 0
      },
      {
        "like_count": 0,
        "username": "cnn",
        "comment_count": 242,
        "id": 7514115679600135470,
        "region_code": "US",
        "share_count": 0,
        "video_description": "Active-duty Marines in California have been mobilized to support the National Guard and local law enforcement in Los Angeles, following days of protests lashing out at immigration enforcement actions by the Trump administration. California’s governor calls the move “unwarranted.”",
        "view_count": 0,
        "create_time": 1749516432
      },
      {
        "comment_count": 3002,
        "like_count": 0,
        "region_code": "US",
        "share_count": 0,
        "view_count": 0,
        "create_time": 1749514762,
        "id": 7514108509903097134,
        "username": "cnn",
        "video_description": "Los Angeles is home to a large population of Hispanic and Latinos -- nearly half of the population, in fact – according to census data. CNN's Gonzalo Alvarado explains how LA's demographics are playing an influential role in fueling immigration protests. #cnn #news #protests #losangeles #LA #immigration #ICE #latino #hispanic  "
      },
      {
        "like_count": 46410,
        "region_code": "US",
        "share_count": 1814,
        "view_count": 1442881,
        "comment_count": 5002,
        "create_time": 1749684336,
        "id": 7514836848791883054,
        "username": "cnn",
        "video_description": "Workers at a meatpacking plant in Omaha Nebraska tried to block ICE agents by throwing themselves on top of the cars to block their path following a raid on the business. More than 70 undocumented people were detained, the largest to take place in Nebraska since the start of the Trump's second term."
      },
      {
        "like_count": 402,
        "region_code": "US",
        "share_count": 11,
        "create_time": 1749682830,
        "id": 7514830390327004459,
        "video_description": "“Jane\" continued cross-examination in the Sean \"Diddy\" Combs trial for her fifth day. Prosecutors expect to rest their case at some point next week. CNN's Elizabeth Wagmeister reports.",
        "view_count": 36044,
        "comment_count": 27,
        "username": "cnn"
      },
      {
        "comment_count": 376,
        "id": 7514810014964583726,
        "like_count": 2883,
        "username": "cnn",
        "view_count": 91200,
        "create_time": 1749678092,
        "region_code": "US",
        "share_count": 60,
        "video_description": "In an interview with The New York Post's Pod Force One, President Trump explained why he \"can be stronger on an attack on Los Angeles\" in his second term compared to his first. Trump also said he told Governor of California, Gavin Newsom, he planned to deploy National Guard troops before doing so."
      },
      {
        "comment_count": 597,
        "create_time": 1749676033,
        "share_count": 588,
        "video_description": "CNN's Kaitlan Collins reports the latest details on Elon Musk's Monday call with President Donald Trump and what it means for their relationship.",
        "id": 7514801196339612971,
        "like_count": 7773,
        "region_code": "US",
        "username": "cnn",
        "view_count": 299903
      },
      {
        "comment_count": 1746,
        "create_time": 1749666847,
        "id": 7514761631671520558,
        "username": "cnn",
        "like_count": 25559,
        "region_code": "US",
        "share_count": 1126,
        "video_description": "New York City tourism officials say they expect to host 2 million fewer international travelers this year than in 2024. CNN's Jason Carroll speaks with tour operators in the city who say they can already see the difference.",
        "view_count": 455939
      },
      {
        "comment_count": 322,
        "like_count": 39542,
        "region_code": "US",
        "share_count": 606,
        "username": "cnn",
        "view_count": 640726,
        "create_time": 1749653046,
        "id": 7514702373525245226,
        "video_description": "Winners of the NHL’s Stanley Cup each get to take the cup for a day and do whatever they want with it. CNN’s Coy Wire recounts some of the Cup’s wildest days out."
      },
      {
        "view_count": 832350,
        "create_time": 1749647240,
        "id": 7514677372076002603,
        "like_count": 42855,
        "region_code": "US",
        "share_count": 794,
        "comment_count": 879,
        "username": "cnn",
        "video_description": "Among an ongoing corruption trial, protests against his leadership and an upcoming vote to dissolve the government, CNN's Oren Liebermann looks at the growing pressure on Israel's Prime Minister Benjamin Netanyahu."
      },
      {
        "comment_count": 1931,
        "create_time": 1749631910,
        "region_code": "US",
        "username": "cnn",
        "video_description": "One of the world’s biggest boybands could soon be making a comeback with six out of seven members of K-Pop supergroup BTS now discharged from South Korea’s mandatory military service. The band plans to reunite at some point later this year. #cnn #news #bts #southkorea #army",
        "view_count": 1896539,
        "id": 7514611756006755626,
        "like_count": 214827,
        "share_count": 14899
      },
      {
        "create_time": 1749629933,
        "id": 7514603258065898798,
        "like_count": 192078,
        "username": "cnn",
        "video_description": "Tensions were high in downtown Los Angeles, as authorities tried to quell a fifth day of anti-ICE protests. CNN Senior Investigative Correspondent Kyung Lah was reporting on the ground. #cnn #news #LAPD #losangeles #california #immigration #protest #ice",
        "comment_count": 4115,
        "region_code": "US",
        "share_count": 3790,
        "view_count": 3141469
      },
      {
        "id": 7514564648272727338,
        "like_count": 42230,
        "username": "cnn",
        "comment_count": 851,
        "create_time": 1749620938,
        "region_code": "US",
        "share_count": 783,
        "video_description": "A curfew is now in effect in parts of downtown Los Angeles, covering an area of roughly one square mile. A law enforcement source familiar with the situation told CNN fewer than 100,000 of the city’s 4 million residents will be affected. CNN's Nick Watt reports. #CNN #News #LA #protests #california",
        "view_count": 845935
      },
      {
        "create_time": 1749619287,
        "id": 7514557531684113710,
        "share_count": 921,
        "view_count": 508851,
        "video_description": "In his address to Californians Tuesday evening, California Governor Gavin Newsom thanked protesters who took to the streets of Los Angeles peacefully after a series of immigration raids last week. He blamed President Donald Trump for escalating tensions by deploying the National Guard and US Marines. #cnn #news #newsom #ice #protest #trump #immigration #california ",
        "comment_count": 1248,
        "like_count": 61370,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "id": 7514538557835365674,
        "like_count": 40696,
        "region_code": "US",
        "username": "cnn",
        "video_description": "New York police have started detaining protesters after warning that the anti-ICE marchers should stay on the side walk. CNN has reached out the NYPD for more information. Shimon Prokupecz describes what he sees on the streets of New York City. #cnn #news #iceprotest #nyc #newyorkcity #california #protest #immigration",
        "comment_count": 852,
        "create_time": 1749614863,
        "share_count": 1486,
        "view_count": 521119
      },
      {
        "comment_count": 178,
        "id": 7514514094662110506,
        "view_count": 83960,
        "share_count": 57,
        "username": "cnn",
        "video_description": "Los Angeles Mayor Karen Bass talks with CNN’s Erin Burnett about President Trump’s unfounded claims that protestors have been paid by California officials to engage in demonstrations.",
        "create_time": 1749609166,
        "like_count": 2276,
        "region_code": "US"
      },
      {
        "like_count": 67352,
        "region_code": "US",
        "username": "cnn",
        "video_description": "CNN law enforcement correspondent Whitney Wild reports that a car was seen driving through an ICE demonstration near Federal Plaza in downtown Chicago. The car appears to push a few sign holders before continuing through the protest and speeding away.",
        "view_count": 2109738,
        "create_time": 1749607601,
        "id": 7514507374879608107,
        "comment_count": 8073,
        "share_count": 3966
      },
      {
        "username": "cnn",
        "video_description": "CNN's @Max Foster | News Journalist breaks down what we know so far about the school shooting in Austria. Foster also spoke with Dr. James Densley, a criminology & criminal justice professor, who explained how schools can try to prevent these shootings from happening. #cnn #news #austria #graz",
        "view_count": 35309,
        "like_count": 684,
        "share_count": 15,
        "id": 7514476893647736107,
        "region_code": "US",
        "comment_count": 62,
        "create_time": 1749600504
      },
      {
        "create_time": 1749768510,
        "id": 7515198459717176618,
        "like_count": 2243,
        "username": "cnn",
        "comment_count": 183,
        "region_code": "US",
        "share_count": 41,
        "video_description": "The US-Canada border is now the focus of heightened patrols and billion-dollar upgrades. CNN's Paula Newton reports on Canada’s security shift. #cnn #news ",
        "view_count": 86100
      },
      {
        "id": 7515193108007619882,
        "username": "cnn",
        "video_description": "Video appears to show the sole survivor of a 242 passenger plane crash walking away from the rubble.",
        "comment_count": 1138,
        "create_time": 1749767266,
        "like_count": 20161,
        "region_code": "US",
        "share_count": 3701,
        "view_count": 717125
      },
      {
        "username": "cnn",
        "video_description": "Sen. Alex Padilla (D-CA) and Department of Homeland Security Secretary Kristi Noem separately spoke to the press after Padilla was forcibly removed and placed in handcuffs at Noem's press conference in Los Angeles, California.",
        "view_count": 883614,
        "like_count": 43679,
        "share_count": 4696,
        "id": 7515192034831961387,
        "region_code": "US",
        "comment_count": 1610,
        "create_time": 1749767010
      },
      {
        "id": 7515154652170636586,
        "like_count": 5690,
        "region_code": "US",
        "video_description": "“Jane,” one of Sean “Diddy” Combs’ accusers who is using a pseudonym in court, has resumed testimony in his criminal trial. Jane has been on the stand for several days describing the abuse she said she endured during her relationship with Combs. CNN's Elizabeth Wagmeister reports.",
        "view_count": 259563,
        "comment_count": 396,
        "create_time": 1749758309,
        "share_count": 615,
        "username": "cnn"
      },
      {
        "create_time": 1749757662,
        "id": 7515151876925492522,
        "like_count": 19631,
        "share_count": 685,
        "username": "cnn",
        "video_description": "Democratic Senator Alex Padilla of California was confronted by security and forcibly removed from a news conference being held by Homeland Security Secretary Kristi Noem in Los Angeles. #padilla #noem #cnn #news",
        "view_count": 740199,
        "comment_count": 1299,
        "region_code": "US"
      },
      {
        "create_time": 1749757185,
        "id": 7515149827118779690,
        "like_count": 2056,
        "region_code": "US",
        "share_count": 45,
        "username": "cnn",
        "comment_count": 42,
        "video_description": "The 125th US Open is being played for a record tenth time at Oakmont Country Club in Pennsylvania where CNN's Patrick Snell is in the rough to show you just why the famed country club has long been considered one of the toughest courses in the country. #cnn #news #sports #golf #usga #usopen #oakmont #golfing #oakmontcountryclub  ",
        "view_count": 61985
      },
      {
        "like_count": 69054,
        "share_count": 9858,
        "video_description": "Newly released CCTV footage shows Air India Flight 171 take off before crashing moments later. CNN aviation analyst Miles O’Brien offers his analysis. #cnn #news #airindia",
        "username": "cnn",
        "view_count": 3780168,
        "comment_count": 3885,
        "create_time": 1749755113,
        "id": 7515140930513489198,
        "region_code": "US"
      },
      {
        "view_count": 273603,
        "comment_count": 300,
        "create_time": 1749752116,
        "like_count": 10450,
        "region_code": "US",
        "share_count": 1197,
        "id": 7515128059423362346,
        "username": "cnn",
        "video_description": "A JetBlue plane rolled off the runway into the grass area at Boston Logan International Airport. Airport officials told CNN the plane is being assessed, and no injuries were reported. #cnn #news #airplane #boston #bostonmassachusetts"
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "A woman was freed from a burning car by first responders and passing motorists. Police say she suffered burns to about a third of her body but is in stable condition. #cnn #news ",
        "view_count": 37362,
        "comment_count": 28,
        "id": 7515121873852697899,
        "share_count": 17,
        "create_time": 1749750679,
        "like_count": 429
      },
      {
        "share_count": 1714,
        "video_description": "During a House hearing focused on “sanctuary state” policies, Democrats slammed President Donald Trump’s deployment of the National Guard and Marines to California amid protests over the administration’s immigration enforcement policies.",
        "view_count": 631068,
        "comment_count": 2273,
        "create_time": 1749749907,
        "id": 7515118565012376878,
        "like_count": 51346,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "view_count": 914892,
        "comment_count": 469,
        "create_time": 1749748428,
        "id": 7515112202332917035,
        "like_count": 20383,
        "region_code": "US",
        "video_description": "At least one passenger on board Air India Flight 171 to London Gatwick survived, local police said. According to Reuters, senior police officer Vidhi Chaudhary said the man had been in seat 11A and added that there may be a few more survivors in the hospital.",
        "share_count": 1589,
        "username": "cnn"
      },
      {
        "comment_count": 199,
        "id": 7515083722048458030,
        "like_count": 2228,
        "video_description": "Unrest has spread to more towns in Northern Ireland after violence initially started in Ballymena. The third night of disturbances saw a leisure center, that had been recently used to shelter immigrants, set ablaze by masked youths. #cnn #news ",
        "view_count": 66225,
        "create_time": 1749741795,
        "region_code": "US",
        "share_count": 67,
        "username": "cnn"
      },
      {
        "create_time": 1749739143,
        "id": 7515072323670822190,
        "like_count": 9045,
        "region_code": "US",
        "share_count": 760,
        "video_description": "Social media video shows flames and thick smoke billowing into the air, as an Air India passenger plane, carrying 242 people, crashed shortly after takeoff. The plane had departed an airport in Ahmedabad, India and was bound for London's Gatwick Airport. #cnn #news #india",
        "comment_count": 165,
        "username": "cnn",
        "view_count": 359414
      },
      {
        "comment_count": 1753,
        "id": 7515035369696546090,
        "like_count": 67081,
        "region_code": "US",
        "share_count": 6618,
        "username": "cnn",
        "video_description": "A passenger plane has crashed at an airport in India’s western city of Ahmedabad, with 242 people on board. The number of casualties was not immediately clear. Air India said that one of its flights bound for London was involved in an “incident.” CNN's Will Ripley reports.",
        "create_time": 1749730540,
        "view_count": 2386833
      },
      {
        "create_time": 1749727176,
        "id": 7515020923917995310,
        "comment_count": 4389,
        "like_count": 214821,
        "region_code": "US",
        "share_count": 5880,
        "username": "cnn",
        "video_description": "President Donald Trump drew charged reactions of both admiration and ire at the Kennedy Center’s opening night of \"Les Misérables.\" #CNN #News",
        "view_count": 2343175
      },
      {
        "share_count": 960,
        "comment_count": 723,
        "id": 7515017603010727214,
        "like_count": 49557,
        "region_code": "US",
        "create_time": 1749726406,
        "username": "cnn",
        "video_description": "CNN’s Joan Biskupic breaks down the key questions Amy Coney Barrett has pressed lawyers on before the Supreme Court that has roiled conservatives. #cnn #news ",
        "view_count": 618207
      },
      {
        "create_time": 1749708035,
        "username": "cnn",
        "video_description": "Video shows the moment federal officers took a man into custody they say is wanted on suspicion of assaulting a border patrol agent at an anti-ICE protest in Los Angeles. The agents boxed in the suspect’s vehicle at an intersection in the Boyle Heights neighborhood while his partner and toddler were inside. The man’s partner said he was at a protest in Paramount over the weekend and there was a warrant out for his arrest after a confrontation with authorities. A spokesperson for the US Department of Homeland Security indicated that the incident was not a hit-and-run, but rather, a “targeted arrest of a violent rioter who punched a CBP officer.” #CNN #News #LA #protests #california",
        "view_count": 724587,
        "comment_count": 1133,
        "id": 7514938550266105134,
        "like_count": 16712,
        "region_code": "US",
        "share_count": 463
      },
      {
        "id": 7514915017364622638,
        "like_count": 63282,
        "region_code": "US",
        "share_count": 2408,
        "video_description": "CNN’s Kaitlan Collins talks with LAPD Chief Jim McDonnell who says he did not support President Trump’s decision to deploy the National Guard to Los Angeles, despite statements Trump made earlier.",
        "view_count": 826791,
        "comment_count": 1616,
        "create_time": 1749702535,
        "username": "cnn"
      },
      {
        "view_count": 41368,
        "create_time": 1749694948,
        "id": 7514882415299677486,
        "region_code": "US",
        "username": "cnn",
        "video_description": "CNN’s Erin Burnett talks with LA Democratic Councilmember Katy Yaroslavsky about President Trump’s claim that LA would be “burning to the ground” if he hadn’t intervened. #CNN #news",
        "comment_count": 111,
        "like_count": 1826,
        "share_count": 56
      },
      {
        "username": "cnn",
        "video_description": "CNN's chief law enforcement and intelligence analyst John Miller examines the National Guard's presence at the Los Angeles immigration policy protests and what questions are still left unanswered.",
        "like_count": 1034,
        "region_code": "US",
        "share_count": 42,
        "view_count": 35836,
        "comment_count": 85,
        "create_time": 1749692883,
        "id": 7514873569520700714
      },
      {
        "view_count": 27917,
        "comment_count": 34,
        "create_time": 1749687277,
        "id": 7514849460988611886,
        "like_count": 399,
        "region_code": "US",
        "share_count": 17,
        "username": "cnn",
        "video_description": "The 7-Eleven brand came to Japan in the 1970s, but the stores have taken convenience to new heights, churning out new snack after new snack. They let CNN's Hanako Montgomery in on their cream-puff-making process. #CNN #News #Japan"
      },
      {
        "comment_count": 297,
        "id": 7515576120205462830,
        "like_count": 41557,
        "video_description": "\"Luigi: The Musical\" is a satirical show imagining Luigi Mangione, Diddy and Sam Bankman-Fried as Brooklyn cellmates. CNN's Brynn Gingras looks at the sold-out production.",
        "create_time": 1749856467,
        "region_code": "US",
        "share_count": 11964,
        "username": "cnn",
        "view_count": 392774
      },
      {
        "comment_count": 1721,
        "region_code": "US",
        "username": "cnn",
        "create_time": 1749854009,
        "id": 7515565571484781870,
        "like_count": 27495,
        "share_count": 492,
        "video_description": "Approximately 200 active-duty Marines have taken over from the National Guard troops who were previously deployed according to Maj. Gen. Scott Sherman, who oversees the 4,700 troops who have been deployed to the LA area in recent days. They “will focus on the protection of federal property and personnel,” Sherman said, and will not be performing law enforcement activities. The Marines will be equipped with “standard crowd control gear, which includes a helmet, their face shield, a shield, baton and gas masks,” according to Sherman.",
        "view_count": 487337
      },
      {
        "id": 7515557727695916330,
        "video_description": "The nuclear deal between the US and Iran could be in jeopardy following Israel’s attack on Iran. CNN’s Kaitlan Collins has the details.",
        "comment_count": 257,
        "create_time": 1749852185,
        "share_count": 80,
        "username": "cnn",
        "view_count": 259298,
        "like_count": 5506,
        "region_code": "US"
      },
      {
        "like_count": 1614,
        "username": "cnn",
        "view_count": 76333,
        "create_time": 1749847141,
        "id": 7515536057702747438,
        "share_count": 35,
        "video_description": "CNN's Jerusalem Bureau Chief Oren Liebermann reports from inside a bomb shelter as Iran launched hundreds of ballistic missiles at Israel after the unprecedented attack on Iran.",
        "comment_count": 147,
        "region_code": "US"
      },
      {
        "like_count": 6331,
        "region_code": "US",
        "username": "cnn",
        "comment_count": 115,
        "create_time": 1749846605,
        "id": 7515533779297897770,
        "share_count": 316,
        "video_description": "CNN's Elizabeth Wagmeister breaks down Kanye West, who refers to himself as Ye, arriving to court to show support during the Sean \"Diddy\" Combs trial.",
        "view_count": 191000
      },
      {
        "comment_count": 217,
        "create_time": 1749842423,
        "like_count": 12167,
        "share_count": 1123,
        "video_description": "Vishwash Kumar Ramesh is the sole survivor of an Air India flight that crashed shortly after takeoff. In an interview, Ramesh relives the harrowing moments when he escaped the plane. #CNN #news #AirIndia",
        "id": 7515515806617177386,
        "region_code": "US",
        "username": "cnn",
        "view_count": 531639
      },
      {
        "create_time": 1749840516,
        "id": 7515507667398298926,
        "share_count": 2832,
        "username": "cnn",
        "video_description": "Large explosions have been heard in Tel Aviv, Israel, according to CNN's team on the ground. This comes after the Israeli military says it has identified incoming missiles launched from Iran toward Israel.",
        "view_count": 1541285,
        "comment_count": 4306,
        "region_code": "US",
        "like_count": 73084
      },
      {
        "comment_count": 2658,
        "create_time": 1749838511,
        "video_description": "CNN's Dana Bash talked with President Trump on the phone about Israel's unprecedented strikes on Iran that targeted nuclear facilities and military leaders. #cnn #news #israel #iran ",
        "view_count": 893534,
        "username": "cnn",
        "id": 7515499013953621290,
        "like_count": 34346,
        "region_code": "US",
        "share_count": 3196
      },
      {
        "share_count": 2925,
        "video_description": "Crowds of demonstrators rallied in Tehran calling for retaliation after Israeli strikes on Iran and questioning whether the country should continue negotiations with the United States over a potential nuclear deal. #cnn #news #iran #israel #tehran",
        "view_count": 1234339,
        "create_time": 1749833611,
        "id": 7515477975219883307,
        "like_count": 65773,
        "comment_count": 4308,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "share_count": 59,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Kanye West, who goes by Ye, was briefly at the courthouse where Sean \"Diddy\" Combs is on trial. A source close to West previously told CNN's Elizabeth Wagmeister that he would like to attend the trial to show support for Combs.",
        "view_count": 54747,
        "comment_count": 66,
        "create_time": 1749832574,
        "id": 7515473446675942699,
        "like_count": 920
      },
      {
        "username": "cnn",
        "video_description": "Israel has launched unprecedented strikes on Iran, targeting its nuclear program and assassinating top military leaders in an attack that Israeli Prime Minister Benjamin Netanyahu said will last many days. The operation, codenamed “Operation Rising Lion,” hit Iran's main enrichment facility in Natanz, as well as targeting Iranian nuclear scientists and military leaders. #cnn #news",
        "create_time": 1749831811,
        "like_count": 23222,
        "share_count": 1226,
        "view_count": 879725,
        "comment_count": 1258,
        "id": 7515470205099855147,
        "region_code": "US"
      },
      {
        "comment_count": 356,
        "create_time": 1749822578,
        "id": 7515430679593700654,
        "share_count": 110,
        "video_description": "Leah Greenberg, co-founder of Indivisible, one of several progressive groups organizing “No Kings Day” protests, tells CNN's Audie Cornish that their nonviolence and training approach will be key as they observe the Trump administration’s reaction to ICE protests in Los Angeles.",
        "view_count": 175040,
        "like_count": 19364,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "video_description": "As protests over the Trump administration’s immigration raids continue in Los Angeles and other cities, Florida Attorney General James Uthmeier and law enforcement officials warned that demonstrators could face a forceful response in the state, CNN affiliate WESH reports. #cnn #news",
        "comment_count": 16235,
        "like_count": 223218,
        "share_count": 68275,
        "username": "cnn",
        "create_time": 1749821145,
        "id": 7515424520002391342,
        "region_code": "US",
        "view_count": 2541837
      },
      {
        "view_count": 1690587,
        "create_time": 1749819643,
        "like_count": 34974,
        "region_code": "US",
        "share_count": 2154,
        "username": "cnn",
        "video_description": "Israel has launched unprecedented strikes on Iran, targeting its nuclear program and military leaders. Israel's spy agency, Mossad, released video of operatives inside Iran before the strikes. #CNN #News",
        "comment_count": 1730,
        "id": 7515418076435844395
      },
      {
        "video_description": "Overnight Israel struck several locations in Iran, including the capital Tehran and the country's nuclear sites. Israel says 200 fighter jets were involved in the attack that Prime Minister Benjamin Netanyahu said will last many days. With Iran's defenses weakened in Israel's October attack, and several military leaders killed, its response to last night's strike may be limited. CNN's chief security correspondent Nick Paton Walsh gives his analysis.",
        "create_time": 1749818573,
        "id": 7515413471375363374,
        "like_count": 9135,
        "username": "cnn",
        "view_count": 376999,
        "comment_count": 523,
        "region_code": "US",
        "share_count": 147
      },
      {
        "id": 7515351472767388974,
        "like_count": 65023,
        "region_code": "US",
        "view_count": 2028620,
        "comment_count": 4946,
        "create_time": 1749804140,
        "share_count": 3219,
        "username": "cnn",
        "video_description": "Israel's military says that Iran has launched more than 100 drones toward Israeli territory in what is expected to be the first stage of a much larger counter-attack. CNN's Paula Hancocks shares how citizens are preparing. #CNN #News #Iran #Israel"
      },
      {
        "share_count": 244,
        "username": "cnn",
        "region_code": "US",
        "video_description": "CNN’s Oren Liebermann explains the reasons why Israel decided to attack Iran in unprecedented strikes targeting its nuclear program and senior military leaders. #cnn #news",
        "view_count": 275756,
        "comment_count": 733,
        "create_time": 1749799376,
        "id": 7515331029054328106,
        "like_count": 8886
      },
      {
        "comment_count": 1029,
        "id": 7515295154475961643,
        "create_time": 1749791022,
        "like_count": 12454,
        "region_code": "US",
        "share_count": 627,
        "username": "cnn",
        "video_description": "Iran’s revolutionary guard has confirmed the death General Hossein Salami, one of the country‘s most powerful and influential military commanders, in Israel’s strikes. The IRGC said its command structure and other branches of the military were “fully prepared to deliver a decisive and harsh response.” CNN senior international correspondent Frederik Pleitgen reports. #CNN #News #Iran #Israel",
        "view_count": 373342
      },
      {
        "create_time": 1749790302,
        "like_count": 26966,
        "region_code": "US",
        "username": "cnn",
        "view_count": 407364,
        "comment_count": 1750,
        "id": 7515292058899189038,
        "share_count": 1292,
        "video_description": "CNN's Erin Burnett speaks with Sen. Alex Padilla (D-CA) after he was forcibly removed from a Department of Homeland Security press conference in California. #CNN #News"
      },
      {
        "like_count": 50330,
        "region_code": "US",
        "video_description": "Israel launched strikes against Iran, targeting its nuclear program and long-range missile capabilities, an Israeli military official said. CNN’s Kaitlan Collins reports. #cnn #news #israel #iran",
        "view_count": 1194622,
        "create_time": 1749782120,
        "id": 7515256933482237226,
        "username": "cnn",
        "comment_count": 3872,
        "share_count": 5860
      },
      {
        "comment_count": 3035,
        "create_time": 1749928720,
        "like_count": 95375,
        "region_code": "US",
        "share_count": 3470,
        "username": "cnn",
        "id": 7515886462806592814,
        "video_description": "The suspect in the assassination and attempted assassination of two Minnesota lawmakers has been identified as Vance Boelter, two law enforcement officials briefed on the case tell CNN. Law enforcement found a hit list in the Minnesota suspect’s car that contained nearly 70 names – including pro-abortion rights advocates and lawmakers in other states – a law enforcement official briefed on the matter told CNN. Brooklyn Park Police Chief Mark Bruley described what happened when officers first arrived at Senator Hoffman's home. #cnn #news #breakingnews #minnesota #minneapolis #brooklynpark #police ",
        "view_count": 1515089
      },
      {
        "like_count": 127477,
        "video_description": "CNN spoke to several protesters among the millions of Americans who are expected to attend “No Kings” protests across the country on Saturday to denounce what organizers describe as President Donald Trump’s authoritarian policies and “militarization of our democracy.” #cnn #news #politics",
        "comment_count": 4601,
        "create_time": 1749922403,
        "share_count": 1760,
        "username": "cnn",
        "view_count": 1206964,
        "id": 7515859371037936942,
        "region_code": "US"
      },
      {
        "comment_count": 6912,
        "id": 7515839513902468398,
        "region_code": "US",
        "share_count": 721,
        "username": "cnn",
        "video_description": "CNN’s Clarissa Ward is at the site where an Iranian missile made impact in central Israel following overnight bombardments between Israel and Iran. Israel’s defense minister said Saturday that people in Tehran will “pay a heavy price” and the Iranian capital “will burn” if Iran continues with its missile attacks. #cnn #news #israel #iran ",
        "create_time": 1749917801,
        "like_count": 16828,
        "view_count": 561948
      },
      {
        "id": 7515838175219125546,
        "share_count": 2730,
        "video_description": "Minnesota State Representative Melissa Hortman and her husband Mark, were shot and killed early Saturday morning in “what appears to be a politically-motivated assassination,” Governor Tim Walz said at a news conference. State Senator John Hoffman and his wife were also targeted by the same individual and each shot multiple times, Walz said, but are alive. #cnn #news",
        "comment_count": 834,
        "like_count": 70956,
        "region_code": "US",
        "username": "cnn",
        "view_count": 691399,
        "create_time": 1749917492
      },
      {
        "comment_count": 4234,
        "username": "cnn",
        "view_count": 2262718,
        "create_time": 1749908487,
        "id": 7515799435121626410,
        "like_count": 108085,
        "region_code": "US",
        "share_count": 5136,
        "video_description": "Waves of deadly missile strikes were traded overnight between Iran and Israel as the long-running conflict between the two foes escalated. This follows Friday’s unprecedented attack by Israel on Iranian nuclear and military targets, which killed some of the country’s most senior leaders. The tensions have raised fears of a wider regional war. #cnn #news #israel #iran"
      },
      {
        "username": "cnn",
        "view_count": 147694,
        "comment_count": 49,
        "id": 7515784696538697002,
        "like_count": 2492,
        "region_code": "US",
        "create_time": 1749905070,
        "share_count": 296,
        "video_description": "Mouth tape has become a billion-dollar industry. But experts say it’s a waste of money without learning more about what's really going on inside your mouth and throat. #cnn #mouthtapesleeping #mouthtape #mouthtapebenefits #sleepproblems"
      },
      {
        "view_count": 6349740,
        "comment_count": 9154,
        "create_time": 1749885681,
        "id": 7515701467592920363,
        "like_count": 334286,
        "username": "cnn",
        "video_description": "Video verified by CNN captures the dramatic moment a missile struck in vicinity of the Kirya, an area of Tel Aviv that's home to an urban military base housing Israel’s Defense Forces. #cnn #news ",
        "region_code": "US",
        "share_count": 22190
      },
      {
        "comment_count": 477,
        "like_count": 10914,
        "region_code": "US",
        "share_count": 257,
        "username": "cnn",
        "video_description": "CNN’s Nic Robertson reports at the site of a smoldering projectile on the road to Tel Aviv after a fresh wave of Iranian missile strikes.",
        "view_count": 388133,
        "create_time": 1749877152,
        "id": 7515664930595589422
      },
      {
        "comment_count": 2532,
        "create_time": 1749869918,
        "region_code": "US",
        "share_count": 1039,
        "video_description": "CNN’s Brianna Keilar dives into the history of US military parades, and why the latest one set for June 14th is significant.",
        "view_count": 718304,
        "id": 7515633933661343022,
        "like_count": 29719,
        "username": "cnn"
      },
      {
        "username": "cnn",
        "video_description": "Rare footage released by Israeli spy agency Mossad unveils the sophisticated intelligence operation behind Israel's recent unprecedented attack on Iran. CNN Chief Global Affairs Correspondent Matthew Chance takes a look into this significant breakthrough as well as what sort of retaliation could be in store.",
        "view_count": 421221,
        "comment_count": 506,
        "create_time": 1749861149,
        "id": 7515596323106589998,
        "like_count": 13406,
        "region_code": "US",
        "share_count": 499
      },
      {
        "comment_count": 329,
        "create_time": 1749859346,
        "id": 7515588500574457131,
        "video_description": "CNN's Jerusalem bureau chief and correspondent Oren Liebermann describes the moment an interceptor launched in the distance behind him during an on-air report from Jerusalem.",
        "like_count": 25515,
        "region_code": "US",
        "share_count": 224,
        "username": "cnn",
        "view_count": 699317
      },
      {
        "region_code": "US",
        "share_count": 320,
        "video_description": "CNN’s Clarissa Ward reports from Tamra, a village in northern Israel inhabited by predominantly Palestinian citizens of Israel, where multiple civilians were killed after an Iranian rocket struck their home.",
        "view_count": 235844,
        "create_time": 1750025772,
        "id": 7516303292180352298,
        "like_count": 7386,
        "comment_count": 3231,
        "username": "cnn"
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "CNN's Whitney Wild is outside the home of Minnesota State Representative Melissa Hortman, who was shot and killed in a \"politically motivated assassination\" along with her husband early Saturday morning. Police are still searching for the suspect. #cnn #cnnnews #minnesota ",
        "view_count": 849354,
        "create_time": 1750018506,
        "id": 7516272110956711214,
        "like_count": 69177,
        "share_count": 755,
        "comment_count": 681
      },
      {
        "video_description": "A building was damaged in the northern Israeli city of Haifa, according to the Israeli search and rescue organization ZAKA, after the Israeli military detected more missile launches from Iran. Explosions were captured in the city, with smoke rising above the Haifa skyline. #cnn #news #israel #iran #haifa ",
        "view_count": 2891618,
        "comment_count": 4821,
        "like_count": 78869,
        "region_code": "US",
        "share_count": 1858,
        "username": "cnn",
        "create_time": 1750017374,
        "id": 7516267255085255982
      },
      {
        "comment_count": 436,
        "create_time": 1750013649,
        "video_description": "Vance Boelter, the 57-year-old suspect sought by authorities for allegedly shooting Democratic lawmakers in Minnesota on Saturday, worked for a security company that advertised a fleet of “police type vehicles,” and other equipment that could potentially have aided him in appearing to be a police officer during the shooting. #cnn #news #minnesota #police",
        "view_count": 423324,
        "id": 7516251200380144942,
        "like_count": 11473,
        "region_code": "US",
        "share_count": 704,
        "username": "cnn"
      },
      {
        "region_code": "US",
        "video_description": "Israeli strikes have hit the Iranian capital of Tehran on Sunday in yet another escalation of the ongoing conflict. Israel’s military had previously said it was targeting military and nuclear complexes in Iran, although there are no known such complexes in these areas of the capital. #cnn #news #israel #iran #tehran ",
        "view_count": 1238560,
        "comment_count": 1943,
        "create_time": 1750001568,
        "id": 7516199345713057067,
        "like_count": 35254,
        "share_count": 855,
        "username": "cnn"
      },
      {
        "share_count": 42,
        "username": "cnn",
        "comment_count": 428,
        "id": 7516192398092061998,
        "like_count": 3459,
        "region_code": "US",
        "video_description": "Sen. Amy Klobuchar spoke out against online threats aimed at lawmakers following the shooting deaths of State Rep. Melissa Hortman, the leading Democrat in the Minnesota House, and her husband. Gov. Tim Walz described the incident as a “politically motivated assassination” and said the same individual shot Democratic State Sen. John Hoffman and his wife, both of whom survived. #minnesota #melissahortman #klobuchar #cnn #news",
        "view_count": 133333,
        "create_time": 1749999967
      },
      {
        "view_count": 63161,
        "create_time": 1749987138,
        "like_count": 859,
        "share_count": 28,
        "username": "cnn",
        "comment_count": 53,
        "id": 7516136860918418734,
        "region_code": "US",
        "video_description": "Dr. John Delony speaks to millions of listeners on his popular podcast about mental health, family and relationships. As a therapist, he’s used to offering advice to struggling fathers, but we asked him about the biggest lessons he’s learned as a dad. #cnn #news #FathersDay #father #dad #parenting #LifeAdvice #advice #therapist #MentalHealth #johndelony @Dr. John Delony "
      },
      {
        "share_count": 4329,
        "video_description": "Officers responded to gunshots at a “No Kings” march in Salt Lake City, Utah and took three people into custody in relation to the incident. One person was transferred to the hospital with life-threatening injuries. Salt Lake City police said the motive for the shooting was under investigation. #cnn #news #trump #nokings #nokingprotest #saltlakecity",
        "id": 7516114887395872042,
        "like_count": 43373,
        "region_code": "US",
        "view_count": 1187822,
        "comment_count": 2769,
        "create_time": 1749982014,
        "username": "cnn"
      },
      {
        "create_time": 1749980851,
        "id": 7516109960212794667,
        "username": "cnn",
        "view_count": 2162989,
        "comment_count": 12223,
        "like_count": 67825,
        "region_code": "US",
        "share_count": 3756,
        "video_description": "CNN's Nic Robertson shows aftermath of deadly Iranian missile attack in a residential area in the central Israeli city of Bat Yam. The death toll in Israel from overnight strikes by Iran has risen to at least 10, as emergency workers on the ground continue search and rescue operations. #CNN #batyam #israel #iran #news"
      },
      {
        "share_count": 480,
        "view_count": 531519,
        "comment_count": 3450,
        "like_count": 20697,
        "region_code": "US",
        "video_description": "The death toll from Iranian strikes on Israel continue to rise overnight as Israel and Iran exchange more missile and drone strikes. Israel’s national emergency service Magen David Adom (MDA) reported a “direct hit” on a residential building in the Palestinian-Israeli town of Tamra, killing at least three women and a 13-year-old girl. A later wave of strikes struck buildings in a residential area in the central Israeli city of Bat Yam, killing several people. #cnn #news #israel #iran",
        "create_time": 1749965946,
        "id": 7516046332709113130,
        "username": "cnn"
      },
      {
        "id": 7515984391865109802,
        "username": "cnn",
        "view_count": 529848,
        "region_code": "US",
        "share_count": 842,
        "video_description": "President Donald Trump heralded the US Army on its 250th birthday, praising the military branch after a grand display of military might.",
        "comment_count": 3532,
        "create_time": 1749951511,
        "like_count": 15200
      },
      {
        "comment_count": 1297,
        "create_time": 1749947805,
        "id": 7515968448963497262,
        "like_count": 10967,
        "region_code": "US",
        "share_count": 246,
        "username": "cnn",
        "video_description": "CNN’s Kristen Holmes reports as soldiers, tanks and fighting vehicles paraded through the streets of Washington, DC, to celebrate the US Army’s 250th anniversary. #cnn #cnnnews",
        "view_count": 474716
      },
      {
        "id": 7515963616483626286,
        "share_count": 2143,
        "comment_count": 5799,
        "create_time": 1749946691,
        "username": "cnn",
        "video_description": "Iran and Israel launched missiles in a fresh wave of strikes on Saturday - with projectiles seen over Jerusalem, Haifa, and the West Bank. Iran says Israel launched drones at a gas field in a drone strike, among other targets.",
        "view_count": 2420396,
        "like_count": 111521,
        "region_code": "US"
      },
      {
        "comment_count": 37,
        "region_code": "US",
        "view_count": 58444,
        "share_count": 20,
        "username": "cnn",
        "video_description": "The Stanley Cup is one of the most iconic trophies in all of sports, but one of the reasons the NHL’s championship trophy is so lionized is its perfect imperfections. CNN’s Coy Wire spoke to The Keeper of the Cup Howie Borrow for a tour of some of the trophy’s character-building bloopers.",
        "create_time": 1750109526,
        "id": 7516662998841314602,
        "like_count": 764
      },
      {
        "create_time": 1750101298,
        "share_count": 116,
        "video_description": "Benny Gantz, Chairman of Israel's National Unity Party, and the former Minister of Defense speaks to CNN’s Anderson Cooper following Israel’s attack on Iran. #cnn #news #israel #iran ",
        "comment_count": 1216,
        "id": 7516627690120629517,
        "like_count": 5522,
        "region_code": "US",
        "username": "cnn",
        "view_count": 331597
      },
      {
        "create_time": 1750100692,
        "region_code": "US",
        "comment_count": 905,
        "id": 7516625096790805773,
        "like_count": 14528,
        "share_count": 232,
        "username": "cnn",
        "video_description": "It’s key to Iran's nuclear program: the Fordow plant - in a mountain lair where hundreds of centrifuges, hidden possibly 90 meters underground, enrich uranium to 60%. CNN’s Nick Paton Walsh explains what we know about the key site in Israel’s crosshairs. #cnn #news #israel #iran #fordow #nuclear ",
        "view_count": 633877
      },
      {
        "comment_count": 293,
        "id": 7516618184401636621,
        "username": "cnn",
        "video_description": "The suspect in the killing of a Minnesota lawmaker and her husband in addition to the shooting of another lawmaker and his wife also visited two more politicians’ homes, according to authorities.",
        "create_time": 1750099083,
        "like_count": 9004,
        "region_code": "US",
        "share_count": 855,
        "view_count": 269836
      },
      {
        "id": 7516617770038054187,
        "like_count": 2428,
        "region_code": "US",
        "share_count": 88,
        "view_count": 123583,
        "comment_count": 729,
        "create_time": 1750099001,
        "username": "cnn",
        "video_description": "Former Israeli Defense Minister Yoav Gallant tells CNN's Bianna Golodryga that it's up to the \"free world\" to eliminate Iran's nuclear program. #cnn #news #israel #iran "
      },
      {
        "create_time": 1750092873,
        "id": 7516591395478539534,
        "region_code": "US",
        "share_count": 57,
        "username": "cnn",
        "view_count": 117777,
        "comment_count": 314,
        "like_count": 2362,
        "video_description": "The deadly conflict between Israel and Iran continues as the IDF says it destroyed more than 120 of Iran’s missile launchers, which it said is about a third of its total. Israeli President Isaac Herzog speaks with CNN about why Israel struck Iran now."
      },
      {
        "create_time": 1750092754,
        "id": 7516590944179735851,
        "like_count": 38115,
        "video_description": "The studio complex of Iran’s state news channel IRINN was struck by Israel on Monday, according to the country’s state news agency. A loud explosion was heard while an anchor was presenting live on air, according to a live feed. #cnn #news #iran #israel #strike ",
        "comment_count": 3576,
        "region_code": "US",
        "share_count": 4347,
        "username": "cnn",
        "view_count": 831963
      },
      {
        "username": "cnn",
        "video_description": "President Donald Trump kicked off his visit to the G7 summit in Canada by criticizing nations for kicking out Russia eleven years ago. #CNN #News",
        "view_count": 1001030,
        "share_count": 838,
        "comment_count": 2520,
        "create_time": 1750092387,
        "id": 7516589380815899918,
        "like_count": 22234,
        "region_code": "US"
      },
      {
        "comment_count": 52,
        "create_time": 1750092142,
        "id": 7516588263243664682,
        "username": "cnn",
        "like_count": 948,
        "region_code": "US",
        "share_count": 62,
        "video_description": "A family whose home was damaged by Israeli airstrikes recounted the moment their neighboring building was hit while they were asleep. Iran and Israel have traded unprecedented air and missile strikes, after Israel launched a sweeping air offensive on Iran on Friday claiming it’s in a bid to stop it from building an atomic weapon. #cnn #news",
        "view_count": 43911
      },
      {
        "like_count": 71918,
        "region_code": "US",
        "comment_count": 1616,
        "create_time": 1750088232,
        "id": 7516571523033959722,
        "share_count": 1511,
        "username": "cnn",
        "video_description": "The jury is deliberating the fate of Karen Read in the murder trial of her Boston Police Officer boyfriend, John O’Keefe. CNN’s Jean Casarez shares the biggest moments from closing arguments of the trial. #cnn #news #karenread #johnokeefe #karenreadtrial",
        "view_count": 3388553
      },
      {
        "like_count": 291430,
        "username": "cnn",
        "video_description": "Emergency teams in Tel Aviv, Israel, have been responding to the damage caused by Iran’s latest ballistic missile strike on the city. CNN’s Nic Robertson reports from a large crater in the center where nearby residents have been forced to evacuate their homes. #cnn #news",
        "view_count": 11165204,
        "comment_count": 32835,
        "create_time": 1750085344,
        "id": 7516559160780016939,
        "region_code": "US",
        "share_count": 9605
      },
      {
        "comment_count": 48,
        "id": 7516558325123763499,
        "like_count": 2486,
        "video_description": "Storm chaser and research scientist Sean Waugh has documented softball sized (or greater) hailstones in freefall with an ultra-high-tech camera mounted on a retrofitted research vehicle. The goal – to study and better understand what makes gigantic hail form, and how to better detect it and ultimately improve severe weather warnings. Sean speaks with CNN Meteorologist Derek Van Dam while on the road, capturing imagery of this very impactful and expensive natural phenomenon. #cnn #news #weather #hailstorm #hailstones #climate",
        "view_count": 97604,
        "create_time": 1750085175,
        "region_code": "US",
        "share_count": 49,
        "username": "cnn"
      },
      {
        "video_description": "The judge in the Sean “Diddy” Combs trial has dismissed juror No. 6 over the juror’s inconsistent disclosures about where he lives and with whom. Juror No. 6 will be replaced by the first alternate juror. #cnn #news #diddy #diddytrial #juror",
        "region_code": "US",
        "create_time": 1750084333,
        "id": 7516554683851328782,
        "like_count": 15052,
        "share_count": 502,
        "username": "cnn",
        "view_count": 603966,
        "comment_count": 178
      },
      {
        "create_time": 1750083891,
        "id": 7516552858871860494,
        "username": "cnn",
        "video_description": "An apartment building in West Virginia partially collapsed as flash floods hit the area. The governor's office said at least five people are dead and four people remain missing following the floods. #cnn #news #westvirginia",
        "comment_count": 516,
        "like_count": 12117,
        "region_code": "US",
        "share_count": 1833,
        "view_count": 281724
      },
      {
        "username": "cnn",
        "create_time": 1750082019,
        "id": 7516544831888346411,
        "like_count": 8292,
        "share_count": 88,
        "comment_count": 66,
        "region_code": "US",
        "video_description": "J.J. Spaun talks to CNN's Patrick Snell about the incredible 64-foot putt that secured the US Open championship. #CNN #News",
        "view_count": 171364
      },
      {
        "share_count": 1104,
        "username": "cnn",
        "view_count": 830330,
        "comment_count": 2593,
        "create_time": 1750073092,
        "like_count": 17206,
        "id": 7516506300927282446,
        "region_code": "US",
        "video_description": "Residents in Tel Aviv, Israel, are reeling after another round of Iranian strikes on the city overnight. CNN’s International Diplomatic Editor Nic Robertson visits a street in the center of the city where buildings were severely damaged and windows blown out by Iranian missiles."
      },
      {
        "username": "cnn",
        "comment_count": 792,
        "like_count": 26614,
        "region_code": "US",
        "share_count": 679,
        "create_time": 1750060369,
        "id": 7516451721430715690,
        "video_description": "Vance Boelter, the suspect in the assassination and attempted assassination of two Minnesota lawmakers, has been captured, Minnesota Gov. Tim Walz confirmed in a news conference late Sunday. #cnn #news #minnesota #boelter",
        "view_count": 578933
      },
      {
        "share_count": 236,
        "video_description": "Investigators confirm they have found some items believed to be associated with Vance Boelter, the main suspect in the murder of Minnesota State Rep. Melissa Hortman and her husband. #cnn #cnnnews",
        "comment_count": 305,
        "id": 7516344606783458602,
        "region_code": "US",
        "username": "cnn",
        "view_count": 413465,
        "create_time": 1750035378,
        "like_count": 11418
      },
      {
        "video_description": "Iran launched a new barrage of missiles at Israel Sunday evening, with an explosion seen in the coastal city of Haifa. Israel said it began another series of strikes on military targets across Iran.",
        "view_count": 693664,
        "comment_count": 1146,
        "create_time": 1750033802,
        "id": 7516337769611054382,
        "like_count": 27862,
        "region_code": "US",
        "share_count": 432,
        "username": "cnn"
      },
      {
        "comment_count": 577,
        "id": 7517069809285139767,
        "region_code": "US",
        "share_count": 3059,
        "view_count": 492555,
        "create_time": 1750204218,
        "like_count": 16427,
        "username": "cnn",
        "video_description": "Anne Burrell, a chef and television personality whose joyful demeanor made her a beloved fixture on the Food Network, has died. She was 55."
      },
      {
        "view_count": 123813,
        "comment_count": 566,
        "region_code": "US",
        "like_count": 6584,
        "share_count": 111,
        "username": "cnn",
        "video_description": "A woman gave birth to triplets Monday in Israel’s Rambam hospital, one of several in the country that have moved some operations underground as Iranian strikes hit the city of Haifa this week, according to Reuters. #CNN #news #Israel #Iran #haifa #newborn #babies #baby #triplets #hospital ",
        "create_time": 1750200626,
        "id": 7517054380453973262
      },
      {
        "id": 7517052587103767821,
        "like_count": 12637,
        "region_code": "US",
        "share_count": 283,
        "username": "cnn",
        "video_description": "CNN's Kaitlan Collins gives the latest reporting on the White House debating whether to intervene in the Israel-Iran conflict.",
        "view_count": 362003,
        "comment_count": 804,
        "create_time": 1750200205
      },
      {
        "username": "cnn",
        "comment_count": 207,
        "create_time": 1750195815,
        "like_count": 2148,
        "region_code": "US",
        "id": 7517033624814800183,
        "share_count": 167,
        "video_description": "The Trump Organization says its upcoming T1 smartphone will be “proudly designed and built in the United States.” But experts tell CNN they’re skeptical that goal can be achieved-- and say the T1’s specifications are strikingly similar to a Chinese-made phone already on the market. #CNN #news #trump #trumpmobile #t1 #china",
        "view_count": 144235
      },
      {
        "username": "cnn",
        "video_description": "Nearly two months after the US Food and Drug Administration announced plans to work with the food industry to phase out petroleum-based synthetic dyes, one major company says it will begin to comply. #cnn #news #kraft #food",
        "view_count": 121131,
        "comment_count": 104,
        "create_time": 1750195681,
        "id": 7517032968825670926,
        "region_code": "US",
        "share_count": 361,
        "like_count": 3637
      },
      {
        "create_time": 1750190935,
        "like_count": 3669,
        "share_count": 141,
        "video_description": "As Israeli strikes zeroed in on Iran's capital city of Tehran, CNN's Clarissa Ward reports from Tel Aviv some of the messages she's received from residents in Iran offering a glimpse into the daily anxieties of living in a country faced with an ever-escalating conflict in the sky. #cnn #news #tehran #iran #israel ",
        "comment_count": 406,
        "region_code": "US",
        "username": "cnn",
        "view_count": 199225,
        "id": 7517012677911153975
      },
      {
        "create_time": 1750186770,
        "like_count": 1874,
        "region_code": "US",
        "comment_count": 35,
        "share_count": 59,
        "username": "cnn",
        "video_description": "Solar Orbiter, a joint mission between NASA and the European Space Agency, is revealing the first-ever views of the sun's south pole. These never-before-seen images offer scientists a chance to better understand our star and its effects on Earth. #cnn #space #sun ",
        "view_count": 56447,
        "id": 7516994885031922974
      },
      {
        "create_time": 1750180076,
        "username": "cnn",
        "view_count": 122366,
        "comment_count": 89,
        "id": 7516963449759436087,
        "like_count": 3519,
        "region_code": "US",
        "share_count": 96,
        "video_description": "Locals in Venice have been protesting over the impending nuptials of billionaire Jeff Bezos and journalist Lauren Sanchez, worried that the wedding could lead to overtourism and the mega yachts damaging the local lagoon. CNN’s Barbie Latza Nadeau was in Venice and witnessed one of the protests. #CNN #news #JeffBezos #LaurenSanchez #italy #venice #bezos #wedding "
      },
      {
        "share_count": 2272,
        "video_description": "President Donald Trump disputed his own director of national intelligence, Tulsi Gabbard, on how developed Iran's nuclear capabilities are and said Iran was on the verge of obtaining a nuclear weapon when Israel struck in recent days. #CNN #News ",
        "view_count": 826871,
        "id": 7516909339278331150,
        "create_time": 1750166906,
        "like_count": 30480,
        "region_code": "US",
        "username": "cnn",
        "comment_count": 2010
      },
      {
        "comment_count": 2283,
        "create_time": 1750165111,
        "id": 7516901461461142839,
        "like_count": 50601,
        "region_code": "US",
        "share_count": 1983,
        "username": "cnn",
        "video_description": "As President Donald Trump returns to the United States after leaving the G7 summit early, he took questions from journalists aboard Air Force One. Watch his answer to CNN's Chief White House correspondent Kaitlan Collins' question on why he left early. #cnn #news ",
        "view_count": 1987515
      },
      {
        "like_count": 143163,
        "share_count": 28566,
        "username": "cnn",
        "video_description": "President Donald Trump said he doesn’t want to call Governor Tim Walz after the suspect in Minnesota was charged over the attack on state lawmakers. #cnn #news ",
        "view_count": 1723798,
        "comment_count": 10710,
        "create_time": 1750164861,
        "id": 7516900449048366391,
        "region_code": "US"
      },
      {
        "create_time": 1750161559,
        "video_description": "Immigration authorities detained more than 70 workers at a meatpacking plant in Omaha, Nebraska, leaving a community stunned and some families split up. CNN's Ed Lavandera reports. #cnn #news ",
        "comment_count": 2744,
        "id": 7516886350965050679,
        "like_count": 12056,
        "region_code": "US",
        "share_count": 363,
        "username": "cnn",
        "view_count": 240400
      },
      {
        "username": "cnn",
        "comment_count": 340,
        "id": 7516824634856066359,
        "like_count": 35392,
        "region_code": "US",
        "create_time": 1750147196,
        "share_count": 616,
        "video_description": "Hundreds of Pakistani students who left their studies in Tehran amid daily strikes on the city by Israel, have crossed back into Pakistan, a local official told CNN. #CNN #News #pakistan #Iran #Israel",
        "view_count": 1023325
      },
      {
        "like_count": 2958,
        "share_count": 90,
        "video_description": "CNN's Laura Coates speaks with Wendy Thomas, the woman who flagged down police after she saw the suspect in the shooting of two Minnesota lawmakers. #cnn #news ",
        "comment_count": 69,
        "create_time": 1750145888,
        "username": "cnn",
        "view_count": 126440,
        "id": 7516818952836730126,
        "region_code": "US"
      },
      {
        "share_count": 496,
        "view_count": 520854,
        "comment_count": 761,
        "create_time": 1750144627,
        "region_code": "US",
        "username": "cnn",
        "video_description": "US President Donald Trump called out French President Emmanuel Macron over his counterpart's suggestion that he left the G7 summit to work on a ceasefire between Israel and Iran. \"He has no idea why I am now on my way to Washington, but it certainly has nothing to do with a Cease Fire,\" Trump wrote on Truth Social. #cnn #news #truthsocial #trump #macron #g7",
        "id": 7516813620219481358,
        "like_count": 6197
      },
      {
        "region_code": "US",
        "share_count": 694,
        "video_description": "Sen. Tina Smith (D-MN) revealed to Kaitlan Collins what she told Sen. Mike Lee (R-UT) over his incendiary social media post. #news #cnn ",
        "view_count": 464991,
        "comment_count": 1417,
        "like_count": 32253,
        "username": "cnn",
        "create_time": 1750144197,
        "id": 7516811850667920654
      },
      {
        "create_time": 1750134586,
        "like_count": 261033,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Video captured the moment a bystander flagged down police after a shooting occurred at a \"No Kings\" protest in Salt Lake City on Saturday. Witnesses say the man they flagged police for, later identified as Arturo Gamboa, had a rifle in his bag and pointed it in a crowd moments before. #cnn #news #nokings #trump #saltlakecity",
        "comment_count": 3093,
        "id": 7516770635637345579,
        "share_count": 9141,
        "view_count": 6250956
      },
      {
        "like_count": 10976,
        "region_code": "US",
        "share_count": 511,
        "username": "cnn",
        "view_count": 393993,
        "comment_count": 546,
        "create_time": 1750125888,
        "id": 7516733311700503822,
        "video_description": "President Donald Trump is heading back early to Washington from the G7 summit in Canada, as the conflict between Israel and Iran enters its fifth day. CNN's Kaitlan Collins reports on the escalating attacks between the two sides and Trump's warning to civilians in Tehran. "
      },
      {
        "comment_count": 18,
        "share_count": 37,
        "view_count": 70525,
        "region_code": "US",
        "username": "cnn",
        "video_description": "CNN’s Kristie Lu Stout gets exclusive access on board a US-bound container ship in Hong Kong's port, the frontlines of China's “export rush” chaos as the clock ticks down on a 90-day pause on US tariffs imposed on Chinese goods.",
        "create_time": 1750125740,
        "id": 7516732690989714730,
        "like_count": 1365
      },
      {
        "share_count": 644,
        "username": "cnn",
        "video_description": "Trump Mobile, a wireless service created by the Trump Organization, aims to rival US carrier companies like AT&T, Verizon and T-Mobile. The Trump Organization, run by President Donald Trump’s eldest sons Eric and Donald Jr., announced the business and launched a new gold smartphone for pre-order.",
        "view_count": 158082,
        "comment_count": 300,
        "id": 7516720198393580842,
        "region_code": "US",
        "create_time": 1750122833,
        "like_count": 4837
      },
      {
        "comment_count": 2789,
        "id": 7517422585131388215,
        "region_code": "US",
        "share_count": 1729,
        "username": "cnn",
        "create_time": 1750286379,
        "like_count": 38402,
        "video_description": "CNN's Kaitlan Collins asks President Trump if he has made a final decision on whether to intervene in the Israel-Iran conflict.",
        "view_count": 968671
      },
      {
        "username": "cnn",
        "view_count": 203056,
        "create_time": 1750284199,
        "id": 7517413275756154125,
        "share_count": 102,
        "video_description": "CNN’s Fred Pleitgen is in Iran’s capital city of Tehran and is the first western journalist to enter the country since its conflict with Israel started. Hear his first impressions and what he’s witnessed as he journeyed across Iran. #cnn #news #iran #tehran #israel ",
        "comment_count": 281,
        "like_count": 4143,
        "region_code": "US"
      },
      {
        "share_count": 90,
        "username": "cnn",
        "video_description": "Karen Read, the Massachusetts woman accused of drunkenly striking her off-duty police officer boyfriend and leaving him to die in January 2022, was found guilty of drunk driving though she was acquitted of the most serious charge of second-degree murder. CNN's Jean Casarez reports from outside the courthouse where Read's supporters reacted to the verdict.",
        "comment_count": 123,
        "create_time": 1750281879,
        "region_code": "US",
        "id": 7517403261880634679,
        "like_count": 4826,
        "view_count": 123995
      },
      {
        "like_count": 4821,
        "video_description": "CNN political historian Leah Wright Rigueur and senior political commentator Van Jones discuss Juneteenth and why this year’s holiday may feel different. #CNN #News ",
        "view_count": 88121,
        "comment_count": 89,
        "create_time": 1750279129,
        "id": 7517391465794784567,
        "region_code": "US",
        "share_count": 130,
        "username": "cnn"
      },
      {
        "video_description": "Sirens and shelters are quickly becoming the new normal in Israel's Tel Aviv as the country's military continues to trade missiles with Iran. CNN's Clarissa Ward takes you inside one of the underground shelters as beachgoers in the city heed a pre-alert on their phones and hunker down. #cnn #news #israel #telaviv #iran #siren #shelter ",
        "view_count": 657821,
        "comment_count": 2024,
        "id": 7517388824473832717,
        "share_count": 321,
        "username": "cnn",
        "create_time": 1750278521,
        "like_count": 12369,
        "region_code": "US"
      },
      {
        "id": 7517378847650729229,
        "region_code": "US",
        "share_count": 147,
        "video_description": "Karen Read, the Massachusetts woman accused of drunkenly striking her off-duty police officer boyfriend and leaving him to die in January 2022, was acquitted of the most serious charge of second-degree murder. She was found guilty on a lesser charge of drunk driving. Read was sentenced to one-year probation and will not serve any jail time.",
        "view_count": 91585,
        "comment_count": 109,
        "create_time": 1750276200,
        "like_count": 3088,
        "username": "cnn"
      },
      {
        "comment_count": 52,
        "id": 7517375706716851470,
        "username": "cnn",
        "video_description": "Early warnings went unaddressed for years before one of the deadliest building collapses this century at the Jetset nightclub, a CNN analysis has found. Stefano Pozzebon has the story. #cnn #news #dominicanrepublic ",
        "view_count": 69139,
        "create_time": 1750275475,
        "like_count": 2697,
        "region_code": "US",
        "share_count": 236
      },
      {
        "comment_count": 583,
        "region_code": "US",
        "share_count": 134,
        "username": "cnn",
        "view_count": 209403,
        "create_time": 1750274363,
        "id": 7517370933867302199,
        "like_count": 14394,
        "video_description": "Singer Nezza performed the US National Anthem in Spanish at a recent Dodgers game as a protest against recent immigration raids in Los Angeles. She says a team employee told her not to, but the singer performed the song in Spanish anyway. #cnn #news #sports #dodgers"
      },
      {
        "comment_count": 848,
        "create_time": 1750271612,
        "like_count": 34200,
        "share_count": 1312,
        "username": "cnn",
        "id": 7517359168924175630,
        "region_code": "US",
        "video_description": "As possibly the only world leader with a direct line to the White House, Israel Knesset and Iranian leadership, President Vladimir Putin is casting himself as a power broker in the Israel-Iran conflict. CNN’s Matthew Chance looks at how the Russian leader is playing into global affairs as the world turns its attention to Iran-Israel conflict. #cnn #news #iran #israel #russia #kyiv #ukraine #putin #vladimirputin #trump ",
        "view_count": 916323
      },
      {
        "video_description": "CNN's Christiane Amanpour speaks exclusively to Iranian Deputy Foreign Minister Majid Takht Ravanchi as the Israel-Iran conflict escalates. #cnn #news",
        "comment_count": 115,
        "region_code": "US",
        "like_count": 1125,
        "share_count": 38,
        "username": "cnn",
        "view_count": 56782,
        "create_time": 1750267028,
        "id": 7517339485655289143
      },
      {
        "view_count": 127513,
        "comment_count": 122,
        "create_time": 1750264415,
        "like_count": 1010,
        "region_code": "US",
        "video_description": "An actor who worked on a TV show created by Tyler Perry has filed a lawsuit alleging Perry leveraged his industry power to repeatedly sexually assault and harass him while keeping him quiet. The lawsuit is seeking at least $260 million in damages. Tyler Perry denies the allegations. #cnn #news",
        "id": 7517328256803147022,
        "share_count": 231,
        "username": "cnn"
      },
      {
        "like_count": 12444,
        "video_description": "A jury is deliberating the fate of Karen Read. Prosecutors allege Karen Read drunkenly struck her boyfriend with her Lexus SUV and left him to die in the snow. Read’s defense contends there was no collision. They have cast her as the victim of a cover-up, alluding to a conspiracy by those who they say killed O’Keefe and framed the defendant, while painting the police investigation as biased and flawed. Read has pleaded not guilty to charges of second-degree murder, vehicular manslaughter while intoxicated and leaving the scene of a collision resulting in death. #CNN #News ",
        "view_count": 242915,
        "id": 7517325985650380087,
        "create_time": 1750263886,
        "region_code": "US",
        "share_count": 121,
        "username": "cnn",
        "comment_count": 257
      },
      {
        "region_code": "US",
        "share_count": 10,
        "video_description": "The Supreme Court upheld Tennessee’s ban on gender-affirming care for trans minors in a blockbuster ruling that will bolster efforts by conservative state lawmakers to pass and preserve other divisive laws targeting transgender Americans. #cnn #news #scotus ",
        "view_count": 28506,
        "username": "cnn",
        "comment_count": 45,
        "create_time": 1750263725,
        "id": 7517325251315862839,
        "like_count": 389
      },
      {
        "create_time": 1750258753,
        "like_count": 19888,
        "region_code": "US",
        "video_description": "President Donald Trump declined to say whether he has decided on US military intervention in Iran. The US has been providing defensive support to Israel since the back-and-forth missile attacks began last week. #CNN #News",
        "view_count": 652043,
        "comment_count": 1001,
        "id": 7517303775971904823,
        "share_count": 1895,
        "username": "cnn"
      },
      {
        "id": 7517291746368228622,
        "like_count": 110354,
        "view_count": 1213292,
        "video_description": "The GOP is divided on the US' involvement in the Iran-Israel conflict. Former Fox News Anchor, Tucker Carlson and Sen. Ted Cruz (R-TX) got into a heated exchange during an interview about the tensions.",
        "comment_count": 1826,
        "create_time": 1750255947,
        "region_code": "US",
        "share_count": 5426,
        "username": "cnn"
      },
      {
        "view_count": 354726,
        "comment_count": 591,
        "id": 7517259189866040589,
        "region_code": "US",
        "username": "cnn",
        "create_time": 1750248312,
        "like_count": 10275,
        "share_count": 299,
        "video_description": "While traveling into Israel to cover the conflict with Iran, Anderson Cooper and CNN's Chuck Hadad captured video of Jordan intercepting Iranian missiles in Jordanian airspace. #CNN #News"
      },
      {
        "video_description": "Over 50 people were killed and more than 200 injured by Israeli forces in the deadliest incident since Israel began allowing aid into Gaza following an extended siege, according to Palestinian health officials. Israel says it is reviewing the incident. #CNN #News #Gaza",
        "view_count": 134276,
        "id": 7517208230846680375,
        "region_code": "US",
        "like_count": 15926,
        "share_count": 1619,
        "username": "cnn",
        "comment_count": 876,
        "create_time": 1750236453
      },
      {
        "id": 7517119262805347598,
        "like_count": 244381,
        "region_code": "US",
        "share_count": 6321,
        "view_count": 1856589,
        "comment_count": 3532,
        "create_time": 1750215731,
        "username": "cnn",
        "video_description": "CNN’s Kaitlan Collins talks with New York City mayoral candidate Zohran Mamdani about the New York Times editorial board’s decision not to endorse a candidate in the race."
      },
      {
        "share_count": 187,
        "view_count": 147297,
        "id": 7517117854349561143,
        "create_time": 1750215399,
        "like_count": 2628,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Salvadoran journalist, Mario Guevara live-streamed his arrest by ice agents during a \"No Kings protest\" near Atlanta, and is still being held on an immigration detainer. Guevara's attorney, Giovanni Díaz, said Guevara has a \"permit\" to work in the United States, but he does not have Green Card. In a press conference, Díaz declined to specify under which immigration status or program Guevara is protected.",
        "comment_count": 117
      },
      {
        "comment_count": 88,
        "create_time": 1750215272,
        "like_count": 2884,
        "region_code": "US",
        "share_count": 170,
        "username": "cnn",
        "video_description": "Mount Lewotobi Laki Laki, one of Indonesia’s most active volcanoes, erupted Tuesday, sending an ash cloud high into the air. The country’s volcanology agency has raised the alert level to the highest. #CNN #News #Indonesia #volcanoes",
        "id": 7517117305919180046,
        "view_count": 116834
      },
      {
        "share_count": 692,
        "create_time": 1750210747,
        "like_count": 18383,
        "region_code": "US",
        "video_description": "CNN's Nick Paton Walsh reports on how the US could get involved in the conflict between Israel and Iran while the countries continue trading strikes for a sixth day, with civilians in flashpoint areas facing waves of attacks.",
        "view_count": 437314,
        "comment_count": 662,
        "id": 7517097869959073037,
        "username": "cnn"
      },
      {
        "like_count": 1870,
        "region_code": "US",
        "video_description": "New York City Comptroller and mayoral candidate Brad Lander was released from federal custody Tuesday afternoon, hours after he was arrested by officers at an immigration court in Manhattan when he tried to escort a migrant whom officers were attempting to arrest.",
        "view_count": 87127,
        "username": "cnn",
        "comment_count": 103,
        "create_time": 1750206015,
        "id": 7517077542205984013,
        "share_count": 120
      },
      {
        "create_time": 1750376190,
        "id": 7517808330857909559,
        "share_count": 7,
        "username": "cnn",
        "view_count": 17737,
        "comment_count": 19,
        "like_count": 231,
        "region_code": "US",
        "video_description": "As Steven Spielberg's summer blockbuster 'Jaws' turns 50, CNN's Harry Enten figures out how likely it is to be attacked by a shark and whether we should fear the waters."
      },
      {
        "share_count": 26,
        "username": "cnn",
        "view_count": 35091,
        "comment_count": 76,
        "create_time": 1750371763,
        "id": 7517789332715883831,
        "like_count": 765,
        "region_code": "US",
        "video_description": "Israel’s strikes not only took out top Iranian leaders, they also caused civilian deaths. CNN’s Katie Polglase breaks down the human toll at the locations where top Iranian officials were killed. #cnn #news "
      },
      {
        "username": "cnn",
        "video_description": "A drug already used to treat HIV has now been given FDA approval to prevent new infections. CNN's Jacqueline Howard explains just how effective the drug is. #cnn #news #HIV #health ",
        "view_count": 75681,
        "comment_count": 88,
        "like_count": 3643,
        "share_count": 357,
        "create_time": 1750367918,
        "id": 7517772759724772621,
        "region_code": "US"
      },
      {
        "id": 7517753215732026679,
        "region_code": "US",
        "share_count": 35,
        "video_description": "Israeli Prime Minister Benjamin Netanyahu reasserted President Donald Trump is ‘a tremendous friend of Israel’ after Iranian missiles struck Soroka Hospital. CNN’s Clarissa Ward reports from Tel Aviv on what officials are saying publicly and privately.",
        "view_count": 99086,
        "comment_count": 702,
        "create_time": 1750363361,
        "like_count": 1839,
        "username": "cnn"
      },
      {
        "like_count": 29149,
        "region_code": "US",
        "view_count": 922867,
        "comment_count": 3740,
        "id": 7517737692831042830,
        "username": "cnn",
        "video_description": "In a White House briefing, Press Secretary Karoline Leavitt shared a statement from President Donald Trump regarding a US strike on Iran.",
        "create_time": 1750359739,
        "share_count": 2766
      },
      {
        "like_count": 10059,
        "video_description": "The Trump administration is ending the 988 Suicide & Crisis Lifeline’s specialized services for LGBTQ+ youth on July 17. CNN's Jacqueline Howard reports. #CNN #News",
        "view_count": 131331,
        "comment_count": 574,
        "create_time": 1750358078,
        "id": 7517730548542868750,
        "region_code": "US",
        "share_count": 653,
        "username": "cnn"
      },
      {
        "comment_count": 52,
        "id": 7517721842199612727,
        "like_count": 618,
        "region_code": "US",
        "share_count": 29,
        "username": "cnn",
        "create_time": 1750356060,
        "video_description": "For Juneteenth, CNN political historian Leah Wright Rigueur and senior political commentator Van Jones discuss the significance of supporting the Black community. #CNN #News",
        "view_count": 28884
      },
      {
        "region_code": "US",
        "share_count": 50,
        "view_count": 115960,
        "comment_count": 91,
        "create_time": 1750343420,
        "id": 7517667518098476301,
        "like_count": 5575,
        "username": "cnn",
        "video_description": "'F1' movie producer Jerry Bruckheimer tells CNN's Sara Sidner that the actors in the film had to act while driving 180 MPH and \"pulling 5G's."
      },
      {
        "username": "cnn",
        "video_description": "CNN's International Diplomatic Editor, Nic Robertson, reports from Beer Sheva, Israel, where a hospital was struck during an Iranian attack. Iran said it was targeting an Israeli intelligence and command center “near a hospital.” There have been no reported deaths from the strike. #israel #iran ",
        "view_count": 179079,
        "create_time": 1750342065,
        "region_code": "US",
        "share_count": 325,
        "comment_count": 2799,
        "id": 7517661738100247821,
        "like_count": 7684
      },
      {
        "id": 7517657514033319181,
        "share_count": 22,
        "username": "cnn",
        "view_count": 90816,
        "comment_count": 306,
        "create_time": 1750341098,
        "like_count": 1300,
        "region_code": "US",
        "video_description": "Israel’s Defense Minister Israel Katz said Iran’s Supreme Leader Ayatollah Ali Khamenei cannot be allowed to “continue to exist,” after an Israeli hospital was struck by an Iranian missile on Thursday."
      },
      {
        "create_time": 1750338616,
        "id": 7517646823780109582,
        "region_code": "US",
        "video_description": "An explosion occurred late Wednesday night at SpaceX’s Starbase facility in South Texas. A Starship rocket preparing for its tenth flight test experienced a “major anomaly,” SpaceX says. There were no injuries and all employees are accounted for, according to SpaceX. The cause of the explosion and the extent of any damage are unclear. CNN has reached out to local police and fire departments for more information. #cnn #news #space",
        "comment_count": 131,
        "like_count": 1853,
        "share_count": 196,
        "username": "cnn",
        "view_count": 75064
      },
      {
        "region_code": "US",
        "username": "cnn",
        "comment_count": 899,
        "id": 7517617860525493517,
        "like_count": 14244,
        "share_count": 632,
        "video_description": "Footage of an Iranian state news bulletin being interrupted by an Israeli airstrike captured attention earlier this week as Israel and Iran strike each other in a dramatic escalation of tension. CNN’s Fred Pleitgen goes inside the TV studio in Tehran, Iran which has been left devastated by the attack. #cnn #news #iran #tehran #israel #tv #middleeast  ",
        "view_count": 364229,
        "create_time": 1750331916
      },
      {
        "region_code": "US",
        "video_description": "Vishwash Kumar Ramesh is the only survivor among 242 on board an Air India flight that crashed in Ahmedabad on June 12. On Wednesday Ramesh attended the funeral for his brother, who died in the tragedy. #CNN #News #India",
        "view_count": 71220,
        "comment_count": 67,
        "create_time": 1750321835,
        "share_count": 42,
        "username": "cnn",
        "id": 7517574455380512014,
        "like_count": 1707
      },
      {
        "video_description": "Air defense systems had been activated over Tehran overnight, according to a Telegram post from Iran’s Islamic Revolutionary Guard Corps. CNN’s Fred Pleitgen reports on the scene. #cnn #news #tehran #iran #israel",
        "view_count": 143982,
        "create_time": 1750319698,
        "id": 7517565547786063118,
        "like_count": 3169,
        "username": "cnn",
        "comment_count": 165,
        "region_code": "US",
        "share_count": 83
      },
      {
        "comment_count": 2725,
        "id": 7517560721635429646,
        "like_count": 14687,
        "share_count": 588,
        "video_description": "CNN's Jeremy Diamond reports from the scene on an Iranian missile strike in the Ramat Gan suburb of Tel Aviv. The incident comes as Israel and Iran trade strikes nearly a week after Israel launched a series of attacks on Iran's nuclear sites and military leadership. #CNN #News #Israel #Iran",
        "create_time": 1750318592,
        "region_code": "US",
        "username": "cnn",
        "view_count": 419566
      },
      {
        "comment_count": 372,
        "create_time": 1750305733,
        "like_count": 8741,
        "share_count": 238,
        "id": 7517505698897481015,
        "region_code": "US",
        "username": "cnn",
        "video_description": "Former President Barack Obama warned that the United States is “dangerously close” to becoming “consistent with autocracies” during a civic group event in Connecticut.",
        "view_count": 171033
      },
      {
        "create_time": 1750300572,
        "id": 7517483591123651854,
        "like_count": 46051,
        "region_code": "US",
        "share_count": 1302,
        "username": "cnn",
        "video_description": "CNN’s Erin Burnett shares exclusive video from inside Tehran sent to CNN from Pouria Nouri, an Iranian filmmaker.",
        "comment_count": 2853,
        "view_count": 1031250
      },
      {
        "video_description": "There’s only one weapon in the world that can destroy a place like Fordow, and one plane that can carry that weapon. CNN military analyst Col. Cedric Leighton (ret.) explains how the Massive Ordnance Penetrator - a sophisticated bunker buster - works. #cnn #news",
        "comment_count": 682,
        "region_code": "US",
        "username": "cnn",
        "share_count": 1414,
        "view_count": 715631,
        "create_time": 1750294357,
        "id": 7517456863223385357,
        "like_count": 28450
      },
      {
        "id": 7518184001945799991,
        "like_count": 21011,
        "region_code": "US",
        "video_description": "CNN’s Fareed Zakaria analyzes what may be motivating President Trump’s foreign policy: a fear of missing out.",
        "view_count": 548632,
        "comment_count": 891,
        "create_time": 1750463634,
        "share_count": 2588,
        "username": "cnn"
      },
      {
        "view_count": 297260,
        "comment_count": 1179,
        "username": "cnn",
        "video_description": "Both Iran and Israel's UN ambassadors say that their countries will continue to fight during a tense UN Security Council meeting. #cnn #news",
        "region_code": "US",
        "share_count": 276,
        "create_time": 1750460345,
        "id": 7518169871289552142,
        "like_count": 14575
      },
      {
        "comment_count": 258,
        "create_time": 1750460318,
        "id": 7518169764871572791,
        "like_count": 4956,
        "share_count": 133,
        "username": "cnn",
        "view_count": 110173,
        "region_code": "US",
        "video_description": "A US citizen has been arrested after a physical altercation with immigration agents after they detained a maintenance worker at a shopping center in Pico Rivera, California."
      },
      {
        "create_time": 1750457253,
        "like_count": 1057,
        "region_code": "US",
        "comment_count": 71,
        "share_count": 46,
        "username": "cnn",
        "video_description": "Talks between European and Iranian officials in Geneva, Switzerland were \"very tense\" at first, but then became much more positive. CNN's Matthew Chance takes us inside the room where these talks took place.",
        "view_count": 49919,
        "id": 7518156580785868087
      },
      {
        "create_time": 1750454221,
        "username": "cnn",
        "comment_count": 813,
        "id": 7518143578632146231,
        "like_count": 7281,
        "region_code": "US",
        "share_count": 605,
        "video_description": "President Donald Trump took direct aim at his director of national intelligence, saying that Tulsi Gabbard “is wrong” about Iran’s efforts toward obtaining a nuclear weapon, as CNN has reported that Gabbard’s standing inside the Trump administration has diminished.",
        "view_count": 275559
      },
      {
        "create_time": 1750454094,
        "like_count": 1077,
        "share_count": 47,
        "username": "cnn",
        "video_description": "After President Donald Trump announced he would make a decision on military action against Iran within two weeks, European and Iranian officials are meeting for discussions in Geneva, Switzerland. CNN's Global Affairs Correspondent Matthew Chance gives his analysis on the diplomatic talks and what comes next. #cnn #news",
        "comment_count": 127,
        "id": 7518143031883615501,
        "region_code": "US",
        "view_count": 55541
      },
      {
        "create_time": 1750451805,
        "id": 7518133196517625102,
        "share_count": 25,
        "username": "cnn",
        "video_description": "CNN’s Christiane Amanpour examines what could happen next in Iran as the country exchanges strikes with Israel and Israeli Prime Minister Benjamin Netanyahu threatens to topple the current regime. Editor’s note: This video has been updated to reflect Iranian missiles directly striking a hospital in Beer Sheva, Israel.",
        "view_count": 67720,
        "comment_count": 122,
        "like_count": 2296,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "video_description": "For the past year, many economists warned that tariffs would increase prices, but inflation is lower today than when President Trump took office. CNN's Matt Egan breaks down why this might be the case and how economists expect that to change in the coming months.",
        "view_count": 26391,
        "comment_count": 24,
        "create_time": 1750451314,
        "id": 7518131089244769550,
        "like_count": 397,
        "share_count": 4,
        "username": "cnn"
      },
      {
        "like_count": 4661,
        "video_description": "The hottest temperatures of the year so far will soon reach the eastern half of the United States as a brutal heat dome starts to build over the weekend. Dangerous, record-breaking heat will impact millions next week. CNN's Tyler Mauldin explains.",
        "view_count": 182745,
        "comment_count": 104,
        "id": 7518116414113287437,
        "region_code": "US",
        "share_count": 301,
        "username": "cnn",
        "create_time": 1750447897
      },
      {
        "create_time": 1750446583,
        "id": 7518110770438163725,
        "like_count": 109020,
        "username": "cnn",
        "view_count": 3722722,
        "comment_count": 3092,
        "region_code": "US",
        "share_count": 3774,
        "video_description": "Laura Holgate, Former US Ambassador to the United Nations International Organizations in Vienna weighs in on the likelihood of nuclear fallout if the US strikes the Fordow nuclear enrichment plant in Iran."
      },
      {
        "create_time": 1750446289,
        "like_count": 8665,
        "username": "cnn",
        "video_description": "President Donald Trump took to Truth Social on Juneteenth this year to criticize the number of 'non-working holidays.' CNN's @Abby Phillip talks about the notable change from when the president once vowed to make it a federal holiday. #juneteenth ",
        "view_count": 185206,
        "comment_count": 424,
        "id": 7518109502697131277,
        "region_code": "US",
        "share_count": 598
      },
      {
        "region_code": "US",
        "share_count": 201,
        "username": "cnn",
        "view_count": 147236,
        "comment_count": 399,
        "id": 7518086099000954125,
        "like_count": 5450,
        "create_time": 1750440839,
        "video_description": "Nobel Peace Prize laureate and human rights activist Narges Mohammadi shares a message for President Donald Trump recorded from a safe shelter in Iran. #cnn #news"
      },
      {
        "video_description": "CNN’s Fred Pleitgen is the first western journalist to enter Iran since the latest conflict with Israel started. He interviewed Majid Farahani, an official with the Iranian presidency, about the escalating tensions with Israel, Iran’s nuclear program and what happens if the US gets directly involved in the conflict. #cnn #news ",
        "view_count": 252159,
        "create_time": 1750439185,
        "id": 7518078999847881998,
        "like_count": 10077,
        "region_code": "US",
        "comment_count": 681,
        "share_count": 259,
        "username": "cnn"
      },
      {
        "share_count": 1372,
        "username": "cnn",
        "video_description": "Protesters take to the streets of central Tehran against Israel's strikes on Iran as well as the Trump administration. CNN's Fred Pleitgen reports what he sees on the ground. #CNN #news #Iran",
        "comment_count": 1992,
        "id": 7518075247250214158,
        "region_code": "US",
        "view_count": 244573,
        "create_time": 1750438313,
        "like_count": 17900
      },
      {
        "share_count": 497,
        "username": "cnn",
        "video_description": "CNN’s Anderson Cooper reports from a bomb shelter in the basement of a hotel in Tel Aviv as Iran fires another round of missiles at Israel. #cnn #news #world",
        "comment_count": 1592,
        "create_time": 1750438121,
        "id": 7518074432384978231,
        "like_count": 16048,
        "region_code": "US",
        "view_count": 565246
      },
      {
        "like_count": 28893,
        "region_code": "US",
        "share_count": 1236,
        "username": "cnn",
        "video_description": "CNN's Nic Robertson shows the aftermath of an Iranian strike on Haifa, Israel, less than an hour after it made impact. The strike wounded at least 17 people according to Israeli national emergency service MDA. #cnn #news #israel #haifa #iran",
        "view_count": 812402,
        "id": 7518053609553104183,
        "create_time": 1750433277,
        "comment_count": 6235
      },
      {
        "share_count": 78,
        "username": "cnn",
        "video_description": "GOP Rep. Max Miller said he was “run off the road” on his way to work in Ohio by an individual who yelled \"Death to Israel\" and had a Palestinian flag. Miller is Jewish and describes himself as a staunch defender of Israel. #cnn #news",
        "view_count": 96990,
        "comment_count": 1044,
        "id": 7518008257806404877,
        "region_code": "US",
        "create_time": 1750422717,
        "like_count": 2988
      },
      {
        "create_time": 1750420574,
        "id": 7517999066370805006,
        "region_code": "US",
        "share_count": 1276,
        "username": "cnn",
        "video_description": "After President Trump opened a two-week negotiating window before he decides whether to strike Iran, Iranian Foreign Minister Abbas Araghchi says the country is not seeking negotiations with the United States.",
        "view_count": 896432,
        "comment_count": 2379,
        "like_count": 31319
      },
      {
        "id": 7517978763720756535,
        "like_count": 6161,
        "region_code": "US",
        "share_count": 561,
        "username": "cnn",
        "video_description": "Hurricane Erick slammed into Mexico’s Oaxaca state as a dangerous Category 3 storm Thursday morning, unleashing powerful winds along the coast and spreading heavy rain over the region. #CNN #news #hurricaneerick #mexico",
        "view_count": 94365,
        "comment_count": 64,
        "create_time": 1750415855
      },
      {
        "region_code": "US",
        "view_count": 720393,
        "comment_count": 2261,
        "create_time": 1750400552,
        "id": 7517912924262763831,
        "like_count": 28733,
        "share_count": 919,
        "username": "cnn",
        "video_description": "First responders are searching buildings for people wounded after an Iranian missile struck close to a tech park in the Israeli city of Beer Sheva, according to Israel’s emergency services agency Magen David Adom (MDA). #CNN #News #Israel #Iran"
      },
      {
        "view_count": 70924,
        "comment_count": 112,
        "id": 7517855547731774775,
        "region_code": "US",
        "video_description": "CNN's Natasha Chen reports from outside Dodger Stadium in Los Angeles where federal agents were posted after being denied access to the stadium according the the Dodgers. The Department of Homeland Security stated that the agents who were at Dodger Stadium were not from ICE and their presence wasn’t related to the immigration crackdown throughout Los Angeles.",
        "create_time": 1750387172,
        "like_count": 2090,
        "share_count": 75,
        "username": "cnn"
      },
      {
        "like_count": 7903,
        "region_code": "US",
        "share_count": 378,
        "video_description": "CNN's Erin Burnett speaks with Ernest Moniz, the former US energy secretary under Obama and negotiator of the Iran nuclear deal, about the country's nuclear capabilities.",
        "view_count": 365624,
        "comment_count": 651,
        "id": 7517854426200116494,
        "create_time": 1750386923,
        "username": "cnn"
      },
      {
        "username": "cnn",
        "comment_count": 502,
        "share_count": 759,
        "like_count": 22961,
        "region_code": "US",
        "video_description": "Former infectious disease expert Dr. Fiona Havers speaks with CNN’s Jake Tapper after resigning from the CDC citing concerns about changes to the agency’s vaccine processes under US Health and Human Services Secretary Robert F. Kennedy Jr. #cnn #news ",
        "view_count": 307153,
        "create_time": 1750384466,
        "id": 7517843915576216846
      },
      {
        "video_description": "CNN’s Anderson Cooper speaks with IAEA Director General Rafael Mariano Grossi about the watchdog agency’s report findings cited in part by Israeli authorities for its attacks on Iran.",
        "create_time": 1750383463,
        "share_count": 193,
        "username": "cnn",
        "region_code": "US",
        "view_count": 258541,
        "comment_count": 749,
        "id": 7517839609657625869,
        "like_count": 5378
      },
      {
        "id": 7517820836426861838,
        "region_code": "US",
        "share_count": 1238,
        "username": "cnn",
        "comment_count": 1042,
        "create_time": 1750379092,
        "like_count": 16440,
        "video_description": "Israeli strikes in Gaza killed more than 70 people on Thursday, with multiple children dying. Injured children, screaming in pain, were brought to Baptist Hospital in Gaza City and other children appeared lifeless as they were carried into the ward. #cnn #news ",
        "view_count": 179353
      },
      {
        "share_count": 119,
        "video_description": "CNN's Fred Pleitgen reports on the ground in Tehran, Iran, and witnesses increased aerial activity over the city as the Israel-Iran conflict continues. #cnn #news",
        "view_count": 335494,
        "comment_count": 365,
        "like_count": 7359,
        "region_code": "US",
        "username": "cnn",
        "create_time": 1750377882,
        "id": 7517815647607229710
      },
      {
        "create_time": 1750543099,
        "id": 7518525187793440055,
        "like_count": 9585,
        "username": "cnn",
        "video_description": "Speaking to senior international correspondent Fred Pleitgen in Tehran, Iranian government spokesperson Fatemeh Mohajerani emphasized the need for Israel to halt their attacks for Iran to even \"think about\" further nuclear negotiations with the US.",
        "view_count": 455523,
        "comment_count": 563,
        "region_code": "US",
        "share_count": 164
      },
      {
        "comment_count": 2041,
        "id": 7518468513959365943,
        "like_count": 12641,
        "username": "cnn",
        "view_count": 446009,
        "create_time": 1750529901,
        "region_code": "US",
        "share_count": 532,
        "video_description": "Commercial airlines have, for days now, halted all flights in and out of Israel due to the ongoing conflict with Iran. CNN spoke to multiple Americans in central Israel who are still struggling to leave the country. #cnn #cnnnews"
      },
      {
        "comment_count": 851,
        "like_count": 83588,
        "region_code": "US",
        "username": "cnn",
        "video_description": "A crowd erupted into cheers for Mahmoud Khalil, his wife and child as they arrived at Newark Airport on Saturday following Khalil’s released on bail from a Louisiana ICE detention center, more than three months after he was arrested outside his apartment on Columbia University’s campus. CNN’s Gloria Pazmino was at the airport for his arrival, which included the presence of Congresswoman Alexandria Ocasio-Cortez. #cnn #news",
        "create_time": 1750529816,
        "id": 7518468138359442701,
        "share_count": 1106,
        "view_count": 856490
      },
      {
        "comment_count": 469,
        "create_time": 1750524170,
        "id": 7518443872884624695,
        "like_count": 10180,
        "username": "cnn",
        "region_code": "US",
        "share_count": 1143,
        "video_description": "A video posted to social media showed a hot air balloon catching fire in the sky before plummeting to the ground in Brazil on Saturday. Eight of the 21 people on board died in the incident, according to the local governor. #cnn #news #brazil #hotairballoon #balloon ",
        "view_count": 404624
      },
      {
        "create_time": 1750516569,
        "like_count": 4881,
        "region_code": "US",
        "username": "cnn",
        "video_description": "The Israeli military has repeatedly said it has “only” targeted military installations yet the Iranian government insists that there have been more than 400 deaths, the majority of whom are civilians. CNN’s Fred Pleitgen visited a hospital in the Iranian capital of Tehran to hear from residents injured in airstrikes. #cnn #news #iran #tehran #israel #middleeast ",
        "view_count": 95797,
        "comment_count": 214,
        "id": 7518411137101155639,
        "share_count": 252
      },
      {
        "comment_count": 14524,
        "id": 7518354106449251597,
        "view_count": 3408457,
        "create_time": 1750503365,
        "like_count": 381114,
        "region_code": "US",
        "share_count": 39443,
        "username": "cnn",
        "video_description": "A Palestinian boy asked a journalist to share his message about the realities of food distribution in Gaza. He was on his way to a flour distribution site in Gaza City with his father, who gave permission for the boy to be filmed. #CNN #News #Gaza #middleeast #palestinian "
      },
      {
        "id": 7518250750372302135,
        "like_count": 37120,
        "region_code": "US",
        "username": "cnn",
        "video_description": "A hidden environmental crisis is unfolding in ancient caves near China's Zhangjiajie Forest Park, famed for its massive quartz-sandstone pillar formations, which are said to have inspired the floating scenery that appears in the 2009 Hollywood blockbuster “Avatar.” Viral social media videos showing piles of trash in the area, some reportedly dumped over a decade ago, are prompting a mass cleanup of the karst caves. #CNN #News #cave #china #chinatiktok #hiking #avatar #environment #trash #garbage #climateaction #cleanup ",
        "comment_count": 301,
        "create_time": 1750479199,
        "share_count": 1098,
        "view_count": 587154
      },
      {
        "create_time": 1750472523,
        "region_code": "US",
        "share_count": 315,
        "username": "cnn",
        "video_description": "CNN's Anderson Cooper reports live from Tel Aviv, as Israel's military says it identified missiles launched from Iran and that defense systems are working to intercept them. The military called on the public to \"enter a protected space\" and stay there until further notice. Israel has also begun a new wave of attacks in Iran, its military said Saturday.",
        "view_count": 969525,
        "comment_count": 835,
        "id": 7518222132363431181,
        "like_count": 14166
      },
      {
        "region_code": "US",
        "share_count": 461,
        "video_description": "Palestinian activist Mahmoud Khalil was released on bail on Friday from a Louisiana ICE detention center, more than three months after he was arrested outside his apartment on Columbia University’s campus. The judge found Khalil is not a flight risk or a danger to public safety, saying it’s “highly unusual” to be seeking his detention at this point.",
        "view_count": 238710,
        "comment_count": 464,
        "like_count": 21204,
        "username": "cnn",
        "create_time": 1750467943,
        "id": 7518202428412415246
      },
      {
        "comment_count": 2404,
        "create_time": 1750632535,
        "id": 7518909340481309965,
        "like_count": 22720,
        "region_code": "US",
        "share_count": 1705,
        "username": "cnn",
        "video_description": "US President Donald Trump’s decision to launch direct strikes against Iranian nuclear sites has sparked a wave of anger in the country, with people on the streets of Tehran telling CNN they expect their country to strike back. #CNN #News #iran #tehran #nuclear #middleeast ",
        "view_count": 411124
      },
      {
        "region_code": "US",
        "view_count": 12000293,
        "like_count": 1098890,
        "create_time": 1750623231,
        "id": 7518869315697855799,
        "share_count": 38659,
        "username": "cnn",
        "video_description": "Sen. Bernie Sanders held a \"Fighting Oligarchy\" rally in Tulsa, Oklahoma, when he received news of President Donald Trump's strikes on Iran. #cnn #news #iran #berniesanders #bernie #oklahoma ",
        "comment_count": 16664
      },
      {
        "share_count": 4555,
        "video_description": "Iran’s largest nuclear complex was dealt a series of severe blows in US strikes on Sunday, a CNN analysis of satellite imagery found. See the before and after images, provided by Maxar Technologies, showing the damage visible at three of Iran's nuclear facilities. Initial damage assessments to the three sites are ongoing, according to the UN’s International Atomic Energy Agency. #cnn #news #iran #satellite #middleeast #nuclear #beforeandafter #beforeafter ",
        "username": "cnn",
        "view_count": 2324555,
        "comment_count": 2934,
        "create_time": 1750619779,
        "id": 7518854495065951502,
        "like_count": 76843,
        "region_code": "US"
      },
      {
        "create_time": 1750607424,
        "like_count": 92652,
        "region_code": "US",
        "share_count": 2957,
        "video_description": "CNN's Fred Pleitgen is on the streets of Tehran, Iran's capital city, a day after US President Donald Trump confirmed he approved US strikes on Iran. Hear from residents in the city who say the strikes strengthen their support for Iranian leadership. #cnn #news #iran #tehran #trump ",
        "view_count": 1881074,
        "comment_count": 5179,
        "id": 7518801384154746126,
        "username": "cnn"
      },
      {
        "region_code": "US",
        "view_count": 345213,
        "comment_count": 1013,
        "create_time": 1750605608,
        "id": 7518793616261778743,
        "video_description": "Iranian Foreign Ministry Spokesperson Esmail Baghaei spoke exclusively to CNN’s Fred Pleitgen in Iran after the US attacked three key nuclear facilities in the country. Baghaei said the US’ actions were “unprecedentedly dangerous” and a “betrayal of diplomacy.” #cnn #news #iran #iranian #trump #middleeast #exclusive #interview ",
        "like_count": 15899,
        "share_count": 565,
        "username": "cnn"
      },
      {
        "create_time": 1750598798,
        "id": 7518764295354715447,
        "region_code": "US",
        "share_count": 7923,
        "username": "cnn",
        "view_count": 4090007,
        "comment_count": 4437,
        "like_count": 147322,
        "video_description": "Chairman of the Joint Chiefs of Staff General Dan Caine detailed the moment US B2 bombers dropped Massive Ordnance Penetrator bombs on Iran's Fordow nuclear plant followed by Tomahawk missiles striking Isfahan. The strikes were announced Saturday by President Trump. #cnn #news #iran #middleeast #trump "
      },
      {
        "share_count": 7791,
        "video_description": "The Iranian Foreign Minister Abbas Araghchi has condemned US strikes on the country’s nuclear facilities. He said Iran continues to defend itself by all means necessary against US and Israeli military aggression, and that the US holds \"full responsibility for the consequences of its actions.\" #iran #us #israel ",
        "view_count": 2925343,
        "comment_count": 3783,
        "create_time": 1750598120,
        "id": 7518761273731894542,
        "like_count": 129296,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "comment_count": 1670,
        "id": 7518752462245842231,
        "region_code": "US",
        "share_count": 333,
        "video_description": "US Defense Secretary Pete Hegseth addressed reporters during a Pentagon briefing Sunday morning following President Trump’s weekend announcement of US strikes on Iran. Trump had said the US had struck Iranian nuclear sites including Fordow, Natanz, and Isfahan. #cnn #news #iran #pentagon ",
        "view_count": 278300,
        "create_time": 1750596071,
        "like_count": 7893,
        "username": "cnn"
      },
      {
        "create_time": 1750590075,
        "id": 7518726511587790094,
        "region_code": "US",
        "share_count": 3435,
        "username": "cnn",
        "view_count": 826398,
        "comment_count": 6380,
        "like_count": 33056,
        "video_description": "CNN International Diplomatic Editor Nic Robertson walks through destroyed apartment buildings in Tel Aviv after the site got hit by Iranian missile strikes in response to the US' attack. #israel #iran #us "
      },
      {
        "video_description": "The US launched a significant military operation targeting Iran's nuclear facilities. CNN military analyst Cedric Leighton breaks down which weapons were deployed, including the Massive Ordnance Penetrator (MOP) for the first time in US combat history. #cnn #news #iran #us #trump #israel",
        "comment_count": 586,
        "create_time": 1750588747,
        "id": 7518720719660846350,
        "like_count": 16951,
        "share_count": 782,
        "username": "cnn",
        "region_code": "US",
        "view_count": 441715
      },
      {
        "create_time": 1750579265,
        "region_code": "US",
        "share_count": 807,
        "video_description": "CNN International Diplomatic Editor Nic Robertson reports from Tel Aviv where rescue teams are on the scene of an apartment building damaged by an Iranian missile strike. #CNN #News",
        "comment_count": 2399,
        "like_count": 25396,
        "username": "cnn",
        "view_count": 1024970,
        "id": 7518680291335015693
      },
      {
        "create_time": 1750576757,
        "id": 7518669501525790007,
        "username": "cnn",
        "video_description": "Israeli emergency responders deployed to multiple sites after reports of impacts from a fresh wave of Iranian missiles. The strikes were the first by Iran since the US announced it had attacked the country's nuclear facilities. #cnn #news #israel #haifa #telaviv #iran #us #trump",
        "comment_count": 3397,
        "like_count": 49859,
        "region_code": "US",
        "share_count": 3098,
        "view_count": 1361304
      },
      {
        "video_description": "The US has struck three nuclear sites in Iran, including Fordow, Natanz, and Isfahan, US President Donald Trump said on social media, as the conflict between Israel and Iran enters its second week. CNN’s Fareed Zakaria joins Anderson Cooper to discuss. #cnn #news",
        "comment_count": 2467,
        "id": 7518619109131554103,
        "region_code": "US",
        "share_count": 735,
        "create_time": 1750564956,
        "like_count": 24176,
        "username": "cnn",
        "view_count": 1335493
      },
      {
        "share_count": 998,
        "comment_count": 2173,
        "id": 7518613214330883341,
        "like_count": 35865,
        "video_description": "Iran’s atomic energy agency strongly condemned US strikes on its nuclear facilities, calling them a “savage assault” and a violation of international law. CNN’s Fred Pleitgen reports from Iran’s capital. #cnn #news #tehran #us #iran #trump",
        "view_count": 1057225,
        "create_time": 1750563588,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "comment_count": 300,
        "share_count": 108,
        "video_description": "CNN’s Alayna Treene reports how President Donald Trump decided to strike Iran after growing frustrated with the pace of negotiations with Iran over its nuclear program.",
        "view_count": 163196,
        "create_time": 1750561836,
        "id": 7518605656811736334,
        "like_count": 3553,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "username": "cnn",
        "video_description": "President Donald Trump addressed the nation from the White House after US strikes on three nuclear sites in Iran. #CNN #News",
        "comment_count": 51206,
        "create_time": 1750560443,
        "like_count": 1099893,
        "view_count": 25728435,
        "id": 7518599730029415694,
        "region_code": "US",
        "share_count": 122312
      },
      {
        "view_count": 191515,
        "id": 7518595273560542477,
        "like_count": 7540,
        "share_count": 967,
        "username": "cnn",
        "video_description": "Hong Kong’s government announced the shift away from the city’s iconic red taxis toward multicolored electric and hybrid vehicles. Toronto native Alan Wu has refurbished one to keep the nostalgia alive for himself and others among the city’s diaspora. #cnn #news #hongkong #travel #taxi #toronto #diaspora",
        "comment_count": 170,
        "create_time": 1750559410,
        "region_code": "US"
      },
      {
        "video_description": "US President Donald Trump announced that the United States has completed a “very successful attack” on nuclear sites in Iran, including Fordow, Natanz and Isfahan.",
        "view_count": 393882,
        "id": 7518571223480094007,
        "region_code": "US",
        "share_count": 1508,
        "username": "cnn",
        "comment_count": 1215,
        "create_time": 1750553819,
        "like_count": 10031
      },
      {
        "create_time": 1750721917,
        "region_code": "US",
        "view_count": 592519,
        "username": "cnn",
        "video_description": "CNN's Clarissa Ward is in Tel Aviv as Iran launched strikes towards a US military base in neighboring Qatar, but according to one source, the Iranians warned the Qataris that the strikes were coming. In short, the US likely knew ahead of time. Ward breaks down why Tehran issued the warning and what it did. #cnn #news #iran #tehran #qatar #iranian #qatari #doha  ",
        "comment_count": 1368,
        "id": 7519293218761084215,
        "like_count": 13941,
        "share_count": 1374
      },
      {
        "video_description": "Democratic Socialist Zohran Mamdani and former Gov. Andrew Cuomo are neck and neck in the race for New York City’s democratic primary for mayor, according to the latest polls from Kalshi. CNN’s Harry Enten breaks down the poll numbers and explains what this election’s results could mean for the Democratic Party. #CNN #politics #andrewcuomo #zohranmamdani #nycmayor",
        "comment_count": 1618,
        "region_code": "US",
        "share_count": 678,
        "username": "cnn",
        "create_time": 1750721193,
        "id": 7519290115332640055,
        "like_count": 64624,
        "view_count": 855006
      },
      {
        "comment_count": 77,
        "id": 7519286819750513975,
        "like_count": 3165,
        "video_description": "CNN’s @Audie Cornish lays out the history of US presidents using the Authorization for Use of Military Force—or AUMF, that gives presidents broad authority for military operations that the last four US presidents have used. #cnn #news ",
        "view_count": 63214,
        "create_time": 1750720418,
        "region_code": "US",
        "share_count": 63,
        "username": "cnn"
      },
      {
        "create_time": 1750719979,
        "like_count": 8552,
        "view_count": 186278,
        "share_count": 237,
        "username": "cnn",
        "video_description": "Rep. Marjorie Taylor Green (R-GA) calls out President Donald Trump's for reversing course on \"key promises\" on the \"MAGA agenda\" after U.S. strikes on Iran nuclear facilities.",
        "comment_count": 0,
        "id": 7519284917478460685,
        "region_code": "US"
      },
      {
        "video_description": "With strikes targeted at US bases in Qatar on Monday, Iran has already begun retaliation against the United States for strikes President Trump authorized over the weekend against Iranian nuclear facilities. CNN’s intelligence analyst John Miller explains how sleeper cells within the US could pose an additional threat.",
        "view_count": 268108,
        "comment_count": 305,
        "create_time": 1750719890,
        "id": 7519284519237668151,
        "like_count": 5616,
        "region_code": "US",
        "username": "cnn",
        "share_count": 468
      },
      {
        "like_count": 7759,
        "region_code": "US",
        "username": "cnn",
        "comment_count": 207,
        "create_time": 1750718021,
        "id": 7519276502026849549,
        "share_count": 531,
        "video_description": "National security analyst Peter Bergen details why Iran's strike against a US airbase in Qatar was \"a gamble\" considering the relationship between the two countries.",
        "view_count": 249807
      },
      {
        "comment_count": 37,
        "id": 7519269926671060279,
        "like_count": 1029,
        "view_count": 56554,
        "create_time": 1750716495,
        "region_code": "US",
        "share_count": 13,
        "username": "cnn",
        "video_description": "CNN's Elizabeth Wagmeister explains why Sean 'Diddy' Combs is not expected to testify, according to a source familiar with the federal trial. Combs has pleaded not guilty to charges that include racketeering conspiracy, sex trafficking and transportation to engage in prostitution. If convicted on all counts, he could face up to life in prison."
      },
      {
        "region_code": "US",
        "share_count": 804,
        "username": "cnn",
        "comment_count": 315,
        "create_time": 1750711051,
        "id": 7519246577056140599,
        "like_count": 11556,
        "video_description": "Video geolocated and verified by CNN shows burning debris falling next to a highway in Qatar after Iranian missiles fired at US base Al-Udeid were intercepted.",
        "view_count": 399086
      },
      {
        "view_count": 131825,
        "comment_count": 134,
        "create_time": 1750710690,
        "share_count": 80,
        "video_description": "Following Iran's attack towards a US base in Qatar, CNN's Fred Pleitgen reports from Tehran an increase in anti-aircraft fire in the skies over Iran's capital city. Qatar’s Defense Ministry said its air defenses “successfully” intercepted the missile attack targeting the Al Udeid Air Base in Qatar. No deaths or injuries have been reported. #cnn #news #iran #tehran #qatar #breakingnews #middleeast ",
        "id": 7519244915453349134,
        "like_count": 3015,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "create_time": 1750710068,
        "region_code": "US",
        "comment_count": 18,
        "like_count": 472,
        "share_count": 23,
        "username": "cnn",
        "video_description": "RSV is the most common cause of hospitalization in babies, but Sanofi is one of a few companies producing a shot that can help prevent this potentially severe illness. CNN's Meg Tirrell tours one of their facilities. #cnn #news #vaccine #rsv ",
        "view_count": 40687,
        "id": 7519242311373540622
      },
      {
        "username": "cnn",
        "video_description": "Footage shows men, women and children running in panic inside of a mall in Doha, Qatar, after Iran fired missiles at the Al Udeid Air Base.",
        "create_time": 1750706260,
        "id": 7519225947946585357,
        "share_count": 6706,
        "view_count": 1144042,
        "comment_count": 1574,
        "like_count": 43719,
        "region_code": "US"
      },
      {
        "create_time": 1750703707,
        "id": 7519214997893942583,
        "like_count": 270938,
        "share_count": 39261,
        "username": "cnn",
        "comment_count": 3146,
        "region_code": "US",
        "video_description": "A sudden storm rolled in over Lake Tahoe causing extreme conditions while people were enjoying a sunny summer day.",
        "view_count": 6759812
      },
      {
        "like_count": 788,
        "share_count": 37,
        "username": "cnn",
        "video_description": "The Vera C. Rubin Observatory released its first images, showcasing millions of galaxies. The images are also expected to reveal thousands of previously unknown space objects. #cnn #news #space ",
        "create_time": 1750702550,
        "id": 7519210016398675214,
        "view_count": 54020,
        "comment_count": 43,
        "region_code": "US"
      },
      {
        "video_description": "An extremely dangerous heat wave is underway for the eastern half of the United States as a potent heat dome reaches its peak, bringing the hottest temperatures of the year so far – the hottest in years for some cities. CNN meteorologist Derek Van Dam reports. #cnn #news #weather",
        "view_count": 319518,
        "comment_count": 327,
        "create_time": 1750702366,
        "id": 7519209182592126263,
        "region_code": "US",
        "share_count": 1125,
        "username": "cnn",
        "like_count": 15354
      },
      {
        "create_time": 1750701242,
        "id": 7519204380982136078,
        "region_code": "US",
        "username": "cnn",
        "view_count": 75548,
        "comment_count": 152,
        "like_count": 1894,
        "share_count": 48,
        "video_description": "President Donald Trump suggested the possibility of regime change in Iran in a social media post Sunday. CNN's Alayna Treene reports."
      },
      {
        "comment_count": 1532,
        "create_time": 1750700760,
        "id": 7519202351782087950,
        "username": "cnn",
        "video_description": "Iran launched multiple missiles toward US bases in Qatar on Monday after the US struck Iran’s nuclear sites over the weekend. Qatar’s air defenses intercepted the missile attack, and there have been no reports of injuries. Still, Qatar condemned Iran’s attack on the Al Udeid Air Base, calling it “a flagrant violation of Qatar’s sovereignty and airspace.” #cnn #news #iran #qatar #usa #breakingnews #middleeast ",
        "like_count": 50570,
        "region_code": "US",
        "share_count": 4540,
        "view_count": 1126898
      },
      {
        "username": "cnn",
        "video_description": "NATO Secretary General Mark Rutte, speaking to reporters during a press conference Monday ahead of a NATO summit in The Hauge, reaffirmed NATO's position that Iran \"should not have its hands on a nuclear weapon\" and that the US strikes over the weekend aimed at the country's nuclear facilities were not \"against international law.\" #cnn #news #nato #iran #usa #middleeast ",
        "comment_count": 1108,
        "share_count": 936,
        "like_count": 15969,
        "region_code": "US",
        "view_count": 474625,
        "create_time": 1750698317,
        "id": 7519191880236584247
      },
      {
        "username": "cnn",
        "view_count": 127333,
        "create_time": 1750696750,
        "share_count": 84,
        "like_count": 3501,
        "region_code": "US",
        "video_description": "As Iran threatens to disrupt and close the Strait of Hormuz, CNN's Nick Paton Walsh breaks down why this narrow passage is so important. #cnn #news #hormuzstrait #iran",
        "comment_count": 167,
        "id": 7519185082570001678
      },
      {
        "share_count": 4704,
        "username": "cnn",
        "video_description": "Dashcam footage posted on social media shows the moment an Iranian airstrike made impact near the Israeli city of Ashdod. According to Israeli national emergency service MDA, crews have been dispatched to reported impact sites across the country following a barrage of missiles from Iran. #cnn #news #ashdod #iran",
        "like_count": 91261,
        "create_time": 1750691922,
        "id": 7519164343028567351,
        "region_code": "US",
        "view_count": 1988157,
        "comment_count": 960
      },
      {
        "comment_count": 64,
        "id": 7519158519522757901,
        "video_description": "The Oklahoma City Thunder won the NBA championship with a Game 7 win on their home court over the Indiana Pacers. #oklahomacitythunder #okc #thunder #indiana #pacers #nbachampions #cnn #news",
        "username": "cnn",
        "view_count": 121009,
        "create_time": 1750690589,
        "like_count": 2336,
        "region_code": "US",
        "share_count": 37
      },
      {
        "comment_count": 2474,
        "id": 7519097730598227255,
        "share_count": 1861,
        "username": "cnn",
        "view_count": 1602020,
        "create_time": 1750676513,
        "like_count": 49134,
        "region_code": "US",
        "video_description": "Israeli airstrikes rocked the north of Tehran on Monday. CNN's Frederik Pleitgen shows the aftermath of the attack. #cnn #news #israel #iran"
      },
      {
        "comment_count": 1060,
        "id": 7519046017115901239,
        "like_count": 19678,
        "region_code": "US",
        "video_description": "The UN Security Council was deeply divided during an emergency session called after US military strikes on Iran’s nuclear facilities. #cnn #news #israel #iran #un #trump",
        "create_time": 1750664434,
        "share_count": 394,
        "username": "cnn",
        "view_count": 487265
      },
      {
        "create_time": 1750806157,
        "id": 7519655128836640013,
        "like_count": 14271,
        "comment_count": 1810,
        "share_count": 1223,
        "username": "cnn",
        "video_description": "Iran’s missile barrage toward a US military base in Qatar was to Iranians at a pro-government rally in Tehran a show of military strength. CNN’s Fred Pleitgen reports from the streets of Iran’s capital. #cnn #news #iran #tehran #middleeast #qatar ",
        "view_count": 396345,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "At least 49 people have been killed near aid distribution sites or while waiting for aid trucks across Gaza over just 24 hours, according to Palestinian health officials. CNN’s Nada Bashir reports on the latest aid site developments in Gaza. #CNN #news #Gaza #aid #israel ",
        "view_count": 192447,
        "comment_count": 652,
        "create_time": 1750802945,
        "id": 7519641335645637902,
        "like_count": 11669,
        "share_count": 528
      },
      {
        "create_time": 1750800799,
        "like_count": 1293,
        "region_code": "US",
        "view_count": 65772,
        "comment_count": 43,
        "id": 7519632049867656503,
        "share_count": 29,
        "username": "cnn",
        "video_description": "CNN's Elizabeth Wagmeister reports from the Manhattan courthouse where the prosecution and defense teams in Sean \"Diddy\" Combs' trial have rested their cases."
      },
      {
        "comment_count": 1092,
        "id": 7519621372113472781,
        "username": "cnn",
        "video_description": "120,000 Americans live in Costa Rica. This former Texan explains why she left the US --After a gut-wrenching series of events, Kema Ward-Hopper and her family were desperate for a change from their life in Houston. Now they are part of a growing American exodus seeking healing and a simpler life amid Costa Rica's natural beauty. #movingabroad #livingabroad #blackexpat #costarica🇨🇷",
        "create_time": 1750798336,
        "like_count": 21785,
        "region_code": "US",
        "share_count": 6010,
        "view_count": 227202
      },
      {
        "video_description": "President Donald Trump’s decision to launch airstrikes against Iran is broadly unpopular with Americans, according to a new CNN poll conducted by SSRS after the strikes. CNN's David Chalian explains the key findings.",
        "comment_count": 234,
        "create_time": 1750796543,
        "id": 7519613718162918670,
        "like_count": 3928,
        "region_code": "US",
        "share_count": 52,
        "username": "cnn",
        "view_count": 129133
      },
      {
        "comment_count": 3804,
        "id": 7519608763913899278,
        "like_count": 57425,
        "username": "cnn",
        "video_description": "The US military strikes on three of Iran’s nuclear facilities last weekend did not destroy the core components of the country’s nuclear program and likely only set it back by months, according to an early US intelligence assessment that was described by three people briefed on it. The assessment, which has not been previously reported, was produced by the Defense Intelligence Agency, the Pentagon’s intelligence arm. It is based on a battle damage assessment conducted by US Central Command in the aftermath of the US strikes, one of the sources said. #cnn #news #iran #usa #intel #nuclear #exclusive #breakingnews #middleeast ",
        "view_count": 1616576,
        "create_time": 1750795389,
        "region_code": "US",
        "share_count": 5721
      },
      {
        "like_count": 15267,
        "region_code": "US",
        "share_count": 634,
        "username": "cnn",
        "video_description": "US President Donald Trump has arrived in the Netherlands for an in-and-out stop at a NATO leaders’ summit that’s been tailored to suit his preferences. On his way over, Trump was focused on the fragile truce between Israel and Iran, but acknowledged there were other issues awaiting him in the Netherlands. #cnn #news #netherlands #nato #trump #donaldtrump #politics #ceasefire #iran #israel ",
        "comment_count": 3266,
        "create_time": 1750789228,
        "id": 7519582343397477646,
        "view_count": 646952
      },
      {
        "id": 7519579619440266510,
        "username": "cnn",
        "create_time": 1750788612,
        "like_count": 6154,
        "region_code": "US",
        "share_count": 122,
        "video_description": "Brad Pitt opened up about his recovery experience in an interview on “Armchair Expert with Dax Shepard.” The actor talked about getting to know Shepard, who is also in recovery, through an Alcoholics Anonymous meeting they both attended. #cnn #news",
        "view_count": 228103,
        "comment_count": 118
      },
      {
        "video_description": "A helicopter crash-landed near a waterfront restaurant in Clay Township, Michigan. Clay Township police said minor injuries were reported. The FAA is investigating the cause of the crash. #cnn #news #helicopter",
        "comment_count": 112,
        "create_time": 1750786751,
        "id": 7519571668558253325,
        "share_count": 182,
        "username": "cnn",
        "like_count": 4347,
        "region_code": "US",
        "view_count": 195454
      },
      {
        "comment_count": 134,
        "id": 7519533358578208013,
        "region_code": "US",
        "share_count": 214,
        "username": "cnn",
        "view_count": 114929,
        "create_time": 1750777846,
        "like_count": 3983,
        "video_description": "Social media footage captured a truck hanging off a bridge in Guizhou Province in southwest China as heavy rains caused landslides at the start of monsoon season. #cnn #news #truck #china"
      },
      {
        "comment_count": 73,
        "like_count": 4178,
        "region_code": "US",
        "create_time": 1750777514,
        "id": 7519531883454156087,
        "share_count": 590,
        "username": "cnn",
        "video_description": "Milwaukee firefighters rescued an alligator in the basement while responding to a house fire. No one was inside and no firefighters were hurt, according to the Milwaukee Fire Department. #cnn #news #alligator #milwaukee",
        "view_count": 89649
      },
      {
        "create_time": 1750777459,
        "id": 7519531684535094542,
        "share_count": 5310,
        "username": "cnn",
        "view_count": 310325,
        "comment_count": 2626,
        "like_count": 14094,
        "region_code": "US",
        "video_description": "Separatists in the Canadian province of Alberta are courting votes for a referendum that could start the process for the province to secede from the rest of the country. Here’s a look into what’s motivating the movement. #cnn #news #canada "
      },
      {
        "view_count": 1176157,
        "comment_count": 3340,
        "create_time": 1750766425,
        "id": 7519484249599151373,
        "like_count": 51467,
        "region_code": "US",
        "share_count": 7935,
        "username": "cnn",
        "video_description": "President Donald Trump condemned both Iran and Israel as the ceasefire he brokered between the two countries appeared to grow more fragile. Trump was critical of both sides, but reserved his harshest condemnation for Israel, who he said “unloaded” on Iran “as soon as we made the deal.” #cnn #news #politics"
      },
      {
        "create_time": 1750758821,
        "like_count": 8297,
        "share_count": 157,
        "view_count": 356423,
        "comment_count": 271,
        "id": 7519451286509587725,
        "region_code": "US",
        "username": "cnn",
        "video_description": "The Israeli military attacked Iran’s notorious Evin prison on Monday, according to Israel’s defense minister and Iranian state news. #cnn #news"
      },
      {
        "username": "cnn",
        "comment_count": 1164,
        "create_time": 1750750932,
        "id": 7519417458365664525,
        "share_count": 380,
        "like_count": 10555,
        "region_code": "US",
        "video_description": "A missile hit a residential building in the southern Israel city of Beer Sheva, according to Israeli authorities. A video geolocated by CNN shows the aftermath of the strike, where residents can be seen walking down a street with debris. #cnn #news #israel #iran",
        "view_count": 263309
      },
      {
        "comment_count": 1075,
        "create_time": 1750739944,
        "share_count": 307,
        "video_description": "CNN’s Erin Burnett reports from the United Arab Emirates as a ceasefire is reportedly set to begin after days of hostilities between Israel, Iran, and the United States. #iran #israel #cnn #news ",
        "id": 7519370630626544951,
        "like_count": 10086,
        "region_code": "US",
        "username": "cnn",
        "view_count": 351503
      },
      {
        "comment_count": 455,
        "id": 7519369962197208334,
        "like_count": 7780,
        "region_code": "US",
        "video_description": "CNN’s Fred Pleitgen reports anti-aircraft fire lighting up the sky over the Iranian capital Tehran, after US President Donald Trump announced a ceasefire between Israel and Iran. #cnn #news #israel #iran ",
        "create_time": 1750739796,
        "share_count": 326,
        "username": "cnn",
        "view_count": 293284
      },
      {
        "id": 7519321693177793847,
        "share_count": 215,
        "username": "cnn",
        "video_description": "The Supreme Court granted President Donald Trump’s emergency request to resume deporting migrants to countries other than their homeland, including places like South Sudan, with minimal notice. The decision is a significant win for the Trump administration, which had argued that a lower court usurped its authority by ordering the Department of Homeland Security to provide written notice to the migrants about where they would be sent as well as an opportunity to challenge that deportation on the grounds that they feared being tortured.",
        "view_count": 129816,
        "comment_count": 346,
        "create_time": 1750728543,
        "like_count": 3511,
        "region_code": "US"
      },
      {
        "create_time": 1750725662,
        "id": 7519309294743981367,
        "like_count": 249041,
        "username": "cnn",
        "view_count": 2575211,
        "comment_count": 5526,
        "share_count": 16697,
        "video_description": "Narciso Barranco, a father of three US Marines, was detained by federal agents while working as a landscaper in California. Video captured the moment he was confronted by the agents.",
        "region_code": "US"
      },
      {
        "username": "cnn",
        "view_count": 234389,
        "like_count": 4754,
        "region_code": "US",
        "share_count": 317,
        "video_description": "CNN's Fareed Zakaria reacts to President Donald Trump announcing a ceasefire between Israel and Iran which he says he hopes to become permanent. Neither Iran nor Israel has made any comments about a pending ceasefire.",
        "comment_count": 497,
        "create_time": 1750725484,
        "id": 7519308526108413197
      },
      {
        "view_count": 442588,
        "comment_count": 499,
        "id": 7520027603512724791,
        "region_code": "US",
        "share_count": 461,
        "username": "cnn",
        "create_time": 1750892909,
        "like_count": 14030,
        "video_description": "26-year-old Brazilian tourist Juliana Marins died after nearly four days of search and rescue operations when she fell hundreds of meters from a ridge near volcano Mount Rinjani on Indonesia’s island of Lombok, authorities said."
      },
      {
        "username": "cnn",
        "video_description": "CNN's Omar Jimenez visits the Brooklyn Nets' Jalen Wilson and Assistant Coach Jay Hernandez to experience the challenges of getting drafted into the NBA.",
        "create_time": 1750891936,
        "id": 7520023440074542350,
        "like_count": 538,
        "region_code": "US",
        "share_count": 7,
        "comment_count": 35,
        "view_count": 34491
      },
      {
        "view_count": 655906,
        "create_time": 1750888328,
        "id": 7520007968952257806,
        "like_count": 21326,
        "region_code": "US",
        "share_count": 1228,
        "username": "cnn",
        "comment_count": 662,
        "video_description": "Amazon founder Jeff Bezos and Lauren Sanchez arrived in Venice, Italy for their wedding. CNN's Melissa Bell reports that the details of the upcoming Venetian wedding have been kept under wraps due to the looming threat of disruptive protests."
      },
      {
        "create_time": 1750888077,
        "id": 7520006835529714999,
        "region_code": "US",
        "username": "cnn",
        "comment_count": 321,
        "like_count": 25261,
        "share_count": 741,
        "video_description": "Waymo's driverless taxis honking all night cause vigilantes to seek unconventional methods to quiet them. CNN's Nick Watt reports from on this man-versus-machine battle in Los Angeles. #cnn #news ",
        "view_count": 378083
      },
      {
        "like_count": 19461,
        "video_description": "Thirty two world leaders attend this year's NATO summit in The Hague, Netherlands. But one leader dominated the discussions: President Donald Trump. CNN's correspondent Clare Sebastian offers her analysis from The Hague. #cnn #news",
        "view_count": 283400,
        "comment_count": 669,
        "create_time": 1750886660,
        "id": 7520000805756243213,
        "region_code": "US",
        "share_count": 1047,
        "username": "cnn"
      },
      {
        "comment_count": 163,
        "share_count": 27,
        "username": "cnn",
        "create_time": 1750883866,
        "id": 7519988774378441998,
        "like_count": 2279,
        "region_code": "US",
        "video_description": "More than 1 in 7 people who got an abortion in 2024 had to leave their state to do it. CNN’s Meg Tirrell explains how abortion access in the United States is shifting, three years after Roe v. Wade was overturned. #cnn #health #abortion ",
        "view_count": 62179
      },
      {
        "video_description": "CNN’s Kaitlan Collins asked President Donald Trump whether the US was relying on Israeli intelligence to assess the damage done by the strikes in Iran. #CNN #News ",
        "view_count": 596564,
        "comment_count": 1303,
        "region_code": "US",
        "share_count": 232,
        "username": "cnn",
        "create_time": 1750880686,
        "id": 7519975094827912503,
        "like_count": 16794
      },
      {
        "like_count": 5418,
        "username": "cnn",
        "video_description": "Attorney General Pam Bondi ducked questions from Democratic Sen. Jeff Merkley about possible foreign influence over President Donald Trump after a recent White House dinner for top purchasers of the president’s memecoin.",
        "view_count": 155273,
        "comment_count": 1075,
        "create_time": 1750880169,
        "id": 7519972906886024461,
        "region_code": "US",
        "share_count": 175
      },
      {
        "region_code": "US",
        "id": 7519968904165215501,
        "create_time": 1750879211,
        "like_count": 526,
        "share_count": 15,
        "username": "cnn",
        "video_description": "Tesla’s much-publicized robotaxi service recently began in one neighborhood in Austin, Texas, for a select group of the company’s fans and only with a Tesla employee in the front passenger seat.",
        "view_count": 24535,
        "comment_count": 41
      },
      {
        "create_time": 1750876645,
        "video_description": "The Trump administration is planning to dismiss asylum claims for potentially hundreds of thousands of migrants in the United States, making them immediately deportable. CNN’s Priscilla Alvarez explains what could happen next to these migrants if the administration follows through. #cnn #news #trump #asylum #asylumseekers #deport",
        "share_count": 938,
        "username": "cnn",
        "view_count": 182875,
        "comment_count": 525,
        "id": 7519957857786187022,
        "like_count": 5774,
        "region_code": "US"
      },
      {
        "id": 7519948366957120782,
        "like_count": 2254,
        "region_code": "US",
        "username": "cnn",
        "video_description": "An American Airlines jet returned to Las Vegas after reporting an engine issue on Wednesday. American flight 1665, operating on an Airbus A321, was heading to Charlotte Douglas International Airport at 8:20 a.m. local time when it had to return to Harry Reid International Airport in Las Vegas, according to the Federal Aviation Administration’s preliminary statement. No injuries were reported, a spokesperson for the airport told CNN. There were 153 passengers on the flight, the spokesperson said. The FAA is investigating. #cnn #news #plane",
        "comment_count": 118,
        "create_time": 1750874433,
        "share_count": 217,
        "view_count": 167030
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "Florida has begun building a migrant detention facility in the Everglades, dubbed “Alligator Alcatraz,” where officials say the surrounding nature will serve as a low-cost security system. #cnn #news #florida ",
        "view_count": 182948,
        "id": 7519945480894172429,
        "like_count": 5460,
        "share_count": 1045,
        "comment_count": 673,
        "create_time": 1750873757
      },
      {
        "id": 7519930787911847181,
        "username": "cnn",
        "region_code": "US",
        "share_count": 74,
        "video_description": "Nearly 150 people in France reported being pricked with syringes during a nationwide street music festival at the weekend. It remains unclear if date-rape drugs were used in the attacks. CNN's Saskya Vandoorne spoke to one of the victims and reports. #CNN #News ",
        "view_count": 103777,
        "comment_count": 44,
        "create_time": 1750870341,
        "like_count": 797
      },
      {
        "username": "cnn",
        "video_description": "New York City nearly hit 100 degrees for the first time in over a decade on Tuesday. The city’s last triple-digit temperature happened on July 18, 2012, but it hasn’t been 100 degrees in June since 1966 – nearly 60 years ago. #cnn #news #weather",
        "view_count": 80177,
        "comment_count": 54,
        "create_time": 1750869350,
        "region_code": "US",
        "id": 7519926540574936334,
        "like_count": 2673,
        "share_count": 60
      },
      {
        "comment_count": 57,
        "id": 7519926120444120334,
        "like_count": 1285,
        "username": "cnn",
        "video_description": "Jeff Bezos and Lauren Sanchez arrived in Venice, Italy before their wedding. The couple was spotted entering the Aman Venice hotel. #CNN #News ",
        "create_time": 1750869253,
        "region_code": "US",
        "share_count": 39,
        "view_count": 118779
      },
      {
        "comment_count": 526,
        "id": 7519913456884092174,
        "like_count": 12174,
        "region_code": "US",
        "share_count": 2604,
        "username": "cnn",
        "create_time": 1750866306,
        "video_description": "NATO Secretary General Mark Rutte referred to US President Donald Trump as \"daddy,\" saying, \"daddy has to sometimes use strong language,\" – seemingly referring to Trump's expletive remarks around uneasy ceasefire talks between Iran and Israel. Rutte later clarified that his language was \"a question of taste.\" #cnn #news #nato #daddy #trump #thehague #usa ",
        "view_count": 485745
      },
      {
        "like_count": 1868,
        "username": "cnn",
        "video_description": "CNN’s Fred Pleitgen describes how a building in the Iranian capital was badly damaged by an airstrike, and spoke to a resident who witnessed the blast. #CNN #News ",
        "comment_count": 144,
        "create_time": 1750862616,
        "share_count": 35,
        "view_count": 75766,
        "id": 7519897609998175502,
        "region_code": "US"
      },
      {
        "id": 7519892150503410999,
        "share_count": 17,
        "username": "cnn",
        "view_count": 56249,
        "comment_count": 82,
        "create_time": 1750861348,
        "video_description": "Axiom Space Mission 4 launched four astronauts from NASA’s Kennedy Space Center in Florida. The flight comes after an extended delay triggered by tests related to leaks plaguing the International Space Station. The group is expected to be in space for two weeks to help carry out about 60 experiments before returning home. #cnn #news #space #nasa #axiom #spacex ",
        "like_count": 1847,
        "region_code": "US"
      },
      {
        "comment_count": 314,
        "create_time": 1750860317,
        "share_count": 89,
        "view_count": 92360,
        "video_description": "US President Donald Trump reiterated his claim that US strikes on Iranian nuclear facilities caused “total obliteration,” although he acknowledged the intelligence was “inconclusive” and preliminary. An initial classified report, revealed in a CNN exclusive, found that the attack only set back Tehran’s nuclear program by a few months. #CNN #News ",
        "id": 7519887727232388366,
        "like_count": 2347,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "create_time": 1750856833,
        "like_count": 128669,
        "video_description": "CNN’s @Abby Phillip rolls the tape on Fox News’ apparent double standard over the use of the F-word. #cnn #news ",
        "comment_count": 1025,
        "id": 7519872765810199821,
        "region_code": "US",
        "share_count": 8054,
        "username": "cnn",
        "view_count": 957457
      },
      {
        "create_time": 1750854044,
        "id": 7519860788694093070,
        "share_count": 38,
        "video_description": "CNN's Frederik Pleitgen looks at the damage caused by an airstrike that took place in Tehran, Iran, several days ago after a ceasefire with Israel. #cnn #news",
        "comment_count": 130,
        "like_count": 1233,
        "region_code": "US",
        "username": "cnn",
        "view_count": 56878
      },
      {
        "comment_count": 287,
        "create_time": 1750838749,
        "like_count": 17257,
        "username": "cnn",
        "video_description": "Australia’s largest lake, Kati Thanda-Lake Eyre, is filling with water and transforming from a desert salt plain to a teeming oasis. #cnn #news #australia",
        "view_count": 321620,
        "id": 7519795114013625655,
        "region_code": "US",
        "share_count": 413
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "New York State assemblyman and democratic socialist Zohran Mamdani declared victory in a speech as he is poised to win the Democratic primary for New York City mayor, with his top challenger Andrew Cuomo conceding the race. According to CNN's projection, Mamdani, whose campaign focused on affordability, will garner less than 50% of the vote, meaning the race will formally be decided by ranked-choice votes. #CNN #News #NewYorkCity",
        "create_time": 1750833599,
        "id": 7519772972823956749,
        "like_count": 1250304,
        "share_count": 47328,
        "view_count": 12327084,
        "comment_count": 29224
      },
      {
        "share_count": 4404,
        "username": "cnn",
        "video_description": "Zohran Mamdani, a 33-year-old state assemblyman and democratic socialist, moved to the brink Tuesday of a stunning win in the Democratic primary for New York City mayor, with his top challenger, Andrew Cuomo, conceding the race. #CNN #News #NewYorkCity",
        "comment_count": 2033,
        "create_time": 1750826226,
        "id": 7519741327949581623,
        "like_count": 156633,
        "region_code": "US",
        "view_count": 1291485
      },
      {
        "create_time": 1750823327,
        "share_count": 275,
        "username": "cnn",
        "comment_count": 144,
        "id": 7519728867922218253,
        "like_count": 13207,
        "region_code": "US",
        "video_description": "Rice prices in Japan have nearly doubled in the past year, exacerbating the country's cost of living crisis. CNN’s Hanako Montgomery explains how this rice crisis emerged. #cnn #news #japan",
        "view_count": 207848
      },
      {
        "video_description": "Israel’s offensive has shown no signs of abating in Gaza. Since Israel’s bombardment of Iran began on June 13, more than 860 Palestinians in Gaza have been killed by Israeli fire, according to health officials in the enclave. CNN’s Clarissa Ward reports.",
        "view_count": 53912,
        "like_count": 1396,
        "region_code": "US",
        "share_count": 19,
        "username": "cnn",
        "comment_count": 52,
        "create_time": 1750822689,
        "id": 7519726137115692302
      },
      {
        "share_count": 755,
        "comment_count": 553,
        "create_time": 1750820721,
        "id": 7519717677389171982,
        "like_count": 35830,
        "region_code": "US",
        "username": "cnn",
        "video_description": "New York state assemblyman Zohran Mamdani was on the brink of a stunning Democratic primary win Tuesday for New York City mayor, with his top challenger, former New York Gov. Andrew Cuomo, conceding the race.#cnn #news #zohranmamdani ",
        "view_count": 541015
      },
      {
        "username": "cnn",
        "video_description": "While discussing Iran with journalists aboard Air Force One, President Donald Trump said Russian President Vladimir Putin called to offer help with the situation in Iran. #cnn #news ",
        "comment_count": 841,
        "create_time": 1750820415,
        "id": 7519716360184761613,
        "like_count": 8832,
        "region_code": "US",
        "share_count": 254,
        "view_count": 280376
      },
      {
        "like_count": 2059,
        "video_description": "CNN's Elizabeth Wagmeister reports on Sean \"Diddy\" Combs' family in court for closing arguments in his criminal trial and a notable difference in Combs' body language.",
        "view_count": 70400,
        "comment_count": 88,
        "create_time": 1750982098,
        "id": 7520410684551630093,
        "region_code": "US",
        "share_count": 19,
        "username": "cnn"
      },
      {
        "comment_count": 168,
        "create_time": 1750981218,
        "id": 7520407004326743310,
        "like_count": 3842,
        "region_code": "US",
        "share_count": 225,
        "username": "cnn",
        "video_description": "Health and Human Services Secretary Robert F. Kennedy Jr.’s new vaccine advisory group has voted to stop using flu shots that contain thimerosal. CNN’s Meg Tirrell breaks down the research behind thimerosal and why this matters.",
        "view_count": 106022
      },
      {
        "create_time": 1750980491,
        "id": 7520403723596680461,
        "like_count": 18842,
        "region_code": "US",
        "share_count": 1970,
        "username": "cnn",
        "comment_count": 2172,
        "video_description": "Multiple celebrities have been spotted in Venice, Italy, for billionaire Jeff Bezos and former journalist Lauren Sanchez’s wedding. #CNN #News ",
        "view_count": 1054591
      },
      {
        "video_description": "The prosecution has concluded its closing arguments, with prosecutor Christy Slavik spending nearly 5 hours today delivering remarks on behalf of the government. Slavik outlined the five counts Sean “Diddy” Combs faces, including racketeering conspiracy, sex trafficking, and transportation to engage in prostitution.",
        "view_count": 21230,
        "comment_count": 14,
        "create_time": 1750979671,
        "like_count": 295,
        "region_code": "US",
        "share_count": 9,
        "id": 7520400361627094285,
        "username": "cnn"
      },
      {
        "id": 7520357008386608397,
        "like_count": 13488,
        "region_code": "US",
        "share_count": 398,
        "video_description": "Oprah, Gates, Kardashians... First day of Bezos wedding weekend well underway CNN's Melissa Bell reports from Venice where billionaire Jeff Bezos and former journalist Lauren Sanchez welcome a growing number of A-list celebrities, all while local activists unfurl their banners in protest.#bezossanchezwedding #venice #cnn #cnnnews @Melissa Bell CNN ",
        "view_count": 232294,
        "comment_count": 261,
        "create_time": 1750969575,
        "username": "cnn"
      },
      {
        "share_count": 14,
        "username": "cnn",
        "view_count": 98996,
        "comment_count": 124,
        "region_code": "US",
        "like_count": 2943,
        "video_description": "In the latest episode of \"The Assignment with Audie Cornish\", Sen. Lisa Murkowski (R-AK) reflects on her role as a centrist in a polarized political climate. She recalls calling Donald Trump after the 2016 election, despite opposing him, to have a direct and honest conversation. Her story is a reminder that unity doesn’t require agreement, just a willingness to talk.",
        "create_time": 1750967939,
        "id": 7520349980515699982
      },
      {
        "comment_count": 3204,
        "id": 7520340643978185998,
        "like_count": 188617,
        "username": "cnn",
        "video_description": "On the one-year anniversary of a deadly anti-government protest, thousands returned to the streets in Kenya. CNN's Larry Madowo followed the youth-led march where some protesters were threatening to descend on President William Ruto's residence to confront the leader. #CNN #news #Kenya",
        "create_time": 1750965766,
        "region_code": "US",
        "share_count": 3500,
        "view_count": 2288188
      },
      {
        "share_count": 538,
        "username": "cnn",
        "view_count": 175558,
        "id": 7520337486392888589,
        "like_count": 6856,
        "region_code": "US",
        "video_description": "Editor-in-chief of Vogue, Anna Wintour, is stepping down and seeking a replacement, the magazine’s publisher Condé Nast confirmed to CNN. She will shift to a role of global chief content officer, where she will oversee every brand’s global operations.",
        "comment_count": 92,
        "create_time": 1750965030
      },
      {
        "video_description": "Twin waterspouts were seen from Bradenton, Florida, just south of Tampa Bay, on June 22. #cnn #news #weather",
        "comment_count": 281,
        "create_time": 1750958158,
        "like_count": 23320,
        "share_count": 1077,
        "id": 7520307969318194446,
        "region_code": "US",
        "username": "cnn",
        "view_count": 384352
      },
      {
        "region_code": "US",
        "share_count": 146,
        "video_description": "At a press conference about the US strikes on Iran's nuclear facilities, the Chairman of the Joint Chiefs of Staff, Gen. Dan Caine, discusses the pilots who carried out the strikes and the reactions from their families after they returned home. #CNN #News ",
        "like_count": 10019,
        "username": "cnn",
        "view_count": 206712,
        "comment_count": 184,
        "create_time": 1750954740,
        "id": 7520293293981240589
      },
      {
        "id": 7520280886680620302,
        "like_count": 25890,
        "username": "cnn",
        "video_description": "At a press conference about the US strikes on Iran's nuclear facilities, the Chairman of the Joint Chiefs of Staff, Gen. Dan Caine, shared video of 'bunker buster' bomb test and shared information about what they know about the strike.",
        "view_count": 1202864,
        "create_time": 1750951853,
        "region_code": "US",
        "share_count": 789,
        "comment_count": 1197
      },
      {
        "region_code": "US",
        "share_count": 2026,
        "view_count": 624722,
        "create_time": 1750950850,
        "id": 7520276577314180365,
        "like_count": 47829,
        "username": "cnn",
        "video_description": "White House press secretary Karoline Leavitt falsely claimed that President Trump came up with the phrase \"peace through strength.\" CNN's Abby Phillip reports on how the phrase has been used for decades. #cnn #news",
        "comment_count": 1994
      },
      {
        "create_time": 1750949463,
        "id": 7520270632387382542,
        "like_count": 3845,
        "view_count": 53299,
        "comment_count": 162,
        "share_count": 181,
        "username": "cnn",
        "video_description": "Social media video, geolocated by CNN, showed the Palestinian town of Kafr Malek in the occupied West Bank being attacked by Israeli settlers on Wednesday. According to the Palestine Red Crescent, two other attacks took place in Palestinian towns. Several people were killed, according to Palestinian and Israeli authorities. The IDF said it exchanged fire with a group it called \"terrorists\" on the scene and made five arrests.",
        "region_code": "US"
      },
      {
        "username": "cnn",
        "video_description": "From Cooper Flagg’s No. 1 selection and China’s rising star Yang Hansen — here’s what you need to know about the 2025 NBA Draft. #cnn #news #nba #nbadraft",
        "create_time": 1750947662,
        "id": 7520262876137901367,
        "share_count": 12,
        "view_count": 38374,
        "comment_count": 28,
        "like_count": 541,
        "region_code": "US"
      },
      {
        "comment_count": 208,
        "create_time": 1750947608,
        "id": 7520262651239288119,
        "like_count": 2684,
        "region_code": "US",
        "share_count": 472,
        "username": "cnn",
        "video_description": "NATO Chief Mark Rutte got the world's attention after referring to President Trump as \"daddy\" after he used the analogy of two children fighting to describe the conflict between Iran and Israel. In a press conference, Rutte, explained his reason for using the term \"daddy.\" Trump spoke about the moment at a press conference, and the White House leaned into the term in a social media post. #cnn #news #trump #markrutte",
        "view_count": 112007
      },
      {
        "id": 7520235797526695223,
        "share_count": 46,
        "video_description": "The CDC's vaccine advisory panel meets for the first time since Robert F. Kennedy Jr. replaced all 17 members with handpicked new ones. CNN’s Meg Tirrell examines the shakeup and what it could mean for childhood immunizations. #cnn #health #vaccine ",
        "view_count": 28332,
        "comment_count": 79,
        "create_time": 1750941359,
        "like_count": 810,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "id": 7520204872147422519,
        "like_count": 23573,
        "username": "cnn",
        "view_count": 440565,
        "comment_count": 330,
        "create_time": 1750934164,
        "region_code": "US",
        "share_count": 637,
        "video_description": "Chinese cities, including Beijing, have been dealing with soaring temperatures this week. CNN International Correspondent Marc Stewart shows how people are coping. #CNN #News"
      },
      {
        "share_count": 587,
        "view_count": 567765,
        "comment_count": 615,
        "create_time": 1750933991,
        "id": 7520204146109140237,
        "region_code": "US",
        "like_count": 27222,
        "username": "cnn",
        "video_description": "Could one of the world's most secretive nations be slowly turning towards more international tourism? CNN's Mike Valerio explains what North Korea's new beach resort could mean for Kim Jong Un and his regime. #northkorea #kimjongun #beachresort "
      },
      {
        "comment_count": 188,
        "create_time": 1750932402,
        "share_count": 76,
        "view_count": 112309,
        "id": 7520197322911911223,
        "like_count": 5627,
        "region_code": "US",
        "username": "cnn",
        "video_description": "As the United States launched airstrikes on Iran’s nuclear facilities, officials and analysts in East Asia warned the move could further entrench North Korea’s commitment to its own nuclear arsenal. CNN's Mike Valerio explains why North Korea may never give up its nuclear weapons program."
      },
      {
        "create_time": 1750927148,
        "region_code": "US",
        "video_description": "Ecuador’s most wanted man and leader of the Los Choneros gang, Jose Adolfo Macias, known as “Fito,” was captured on Wednesday, according to the country’s President Daniel Noboa. He escaped from a prison in Guayaquil in January 2024, which unleashed a wave of violence in the country. #CNN #News #Ecuador",
        "view_count": 649110,
        "comment_count": 306,
        "id": 7520174769350708535,
        "like_count": 57302,
        "share_count": 5150,
        "username": "cnn"
      },
      {
        "username": "cnn",
        "view_count": 641075,
        "create_time": 1750906363,
        "region_code": "US",
        "share_count": 2162,
        "video_description": "CNN’s Erin Burnett examines the Cheyenne Mountain Complex, a bunker buried inside a mountain similar to Iran’s Fordow nuclear site.",
        "comment_count": 850,
        "id": 7520085432088972557,
        "like_count": 27268
      },
      {
        "id": 7520044558294551822,
        "region_code": "US",
        "share_count": 253,
        "video_description": "CNN’s Jake Tapper offers a harsh rebuke to President Trump’s attack on media outlets for reporting on a preliminary Defense Intelligence Agency report from the Pentagon which found US strikes likely may have only set Iran’s ability to produce a nuclear weapon back by a matter of months. President Donald Trump and his administration has repeatedly said that the strikes “obliterated” Iran’s ability to produce a weapon. #CNN  #News ",
        "view_count": 220960,
        "comment_count": 1190,
        "create_time": 1750896853,
        "like_count": 7142,
        "username": "cnn"
      },
      {
        "create_time": 1751065196,
        "id": 7520767596333911351,
        "region_code": "US",
        "share_count": 652,
        "username": "cnn",
        "view_count": 398079,
        "comment_count": 377,
        "like_count": 17450,
        "video_description": "CNN's Boris Sanchez spoke with controversial biohacker Bryan Johnson about the impact of the medical experiments he's done and what he thinks is the most underrated aspect of health."
      },
      {
        "comment_count": 25,
        "region_code": "US",
        "video_description": "Jonathan Anderson, former creative director of Loewe and founder of JW Anderson, made his debut as creative director of Dior. His collection, Dior menswear Spring/Summer 2026, was showcased during Paris Fashion Week. ",
        "view_count": 85061,
        "create_time": 1751064999,
        "id": 7520766762296626446,
        "like_count": 2528,
        "share_count": 33,
        "username": "cnn"
      },
      {
        "id": 7520744869426367758,
        "comment_count": 1367,
        "create_time": 1751059903,
        "like_count": 86058,
        "region_code": "US",
        "share_count": 2157,
        "username": "cnn",
        "video_description": "Mourners and lawmakers gather to pay tribute to former Minnesota State Rep. Melissa Hortman and her husband, Mark Hortman, who were killed in a targeted attack. The couple is joined by the family’s golden retriever, Gilbert, who also died after being shot during the attacks. #CNN #News ",
        "view_count": 1181343
      },
      {
        "create_time": 1751059465,
        "view_count": 211680,
        "like_count": 4306,
        "region_code": "US",
        "share_count": 101,
        "username": "cnn",
        "video_description": "CNN's Melissa Bell gives a tour of where Jeff Bezos and Lauren Sanchez's wedding ceremony is in Venice, Italy. #cnn #news",
        "comment_count": 137,
        "id": 7520742939086114061
      },
      {
        "username": "cnn",
        "video_description": "Sean “Diddy” Combs is facing five charges in a blockbuster sex trafficking trial, but will he be found guilty? CNN’s Elizabeth Wagmeister asks former prosecutor Elie Honig to predict the outcome. #cnn #news ",
        "comment_count": 86,
        "create_time": 1751056607,
        "region_code": "US",
        "share_count": 37,
        "id": 7520730691399666957,
        "like_count": 828,
        "view_count": 86711
      },
      {
        "video_description": "A judge removed Sean Diddy Combs’ son, Justin Combs, from the courtroom and apparently asked him to change his clothing after Combs’ son arrived wearing a shirt that says “Free Sean Combs” to the defense team’s final closing arguments. The controversy comes nearly two weeks after Diddy’s son Christian ‘King’ Combs was also removed and spoken to by the judge for wearing a similar slogan in sight of the jury.",
        "create_time": 1751055635,
        "id": 7520726523037486350,
        "share_count": 85,
        "username": "cnn",
        "view_count": 171632,
        "comment_count": 236,
        "like_count": 4739,
        "region_code": "US"
      },
      {
        "create_time": 1751054264,
        "like_count": 818,
        "region_code": "US",
        "share_count": 28,
        "view_count": 42503,
        "comment_count": 49,
        "id": 7520720590718766391,
        "username": "cnn",
        "video_description": "CNN’s Laura Coates goes over the five counts hip-hop mogul Sean \"Diddy\" Combs is charged with, the key evidence and testimony presented to jurors, and how the defense disputes the allegations. #cnn #diddy #seancombstrial"
      },
      {
        "video_description": "Corseting, feathers and plenty of diamonds adorn guests as they step into water taxis set to take them to the Friday evening festivities for Jeff Bezos and Lauren Sanchez. #jeffbezosandlaurensanchez #weddingtiktok #cnn #news",
        "comment_count": 79,
        "create_time": 1751053958,
        "id": 7520719327075650830,
        "like_count": 1255,
        "region_code": "US",
        "username": "cnn",
        "share_count": 46,
        "view_count": 64462
      },
      {
        "id": 7520701664714575117,
        "like_count": 16605,
        "share_count": 807,
        "username": "cnn",
        "view_count": 584437,
        "comment_count": 1447,
        "create_time": 1751049846,
        "region_code": "US",
        "video_description": "In a White House briefing with reporters President Donald Trump was asked if he would consider bombing Iran's nuclear sites again if future intelligence reports offered a concerning conclusion on Iranian enrichment of uranium. #cnn #news #trump #iran "
      },
      {
        "video_description": "US Defense Secretary Pete Hegseth announced the USNS Harvey Milk is being renamed to the USNS Oscar V. Peterson. During Pride Month in June, he ordered the stripping of the name Harvey Milk who was a gay rights activist and Navy veteran. #cnn #news ",
        "view_count": 191684,
        "comment_count": 580,
        "id": 7520697079212100919,
        "like_count": 5287,
        "username": "cnn",
        "create_time": 1751048782,
        "region_code": "US",
        "share_count": 143
      },
      {
        "id": 7520690106831817997,
        "username": "cnn",
        "video_description": "\"Cobra Kai\" star Martin Kove allegedly bit co-star Alicia Hannah-Kim during a fan convention in Washington, claiming it was a joke, according to police. #cnn #news",
        "comment_count": 2198,
        "like_count": 235060,
        "region_code": "US",
        "share_count": 19932,
        "view_count": 3036745,
        "create_time": 1751047159
      },
      {
        "create_time": 1751046009,
        "id": 7520685171666947342,
        "like_count": 8302,
        "share_count": 523,
        "video_description": "Defense Secretary Pete Hegseth alleges that several media outlets, including CNN, are misrepresenting the Iran nuclear program in their coverage. Watch our montage of what he said and what we said.",
        "comment_count": 1360,
        "username": "cnn",
        "view_count": 137999,
        "region_code": "US"
      },
      {
        "create_time": 1751043884,
        "id": 7520676034878901518,
        "like_count": 1439,
        "share_count": 105,
        "view_count": 75212,
        "comment_count": 198,
        "region_code": "US",
        "username": "cnn",
        "video_description": "President Trump thanked conservative Supreme Court justices and explained what he plans to do next after the Court backed his effort to curtail lower court orders that have hampered his agenda for months. #cnn #news #trump #scotus #supremecourt"
      },
      {
        "comment_count": 287,
        "id": 7520663339513498894,
        "region_code": "US",
        "share_count": 100,
        "username": "cnn",
        "video_description": "The Supreme Court on Friday backed a group of religious parents who want to opt their elementary school children out of engaging with LGBTQ books in the classroom, another major legal win for religious interests at the conservative high court. #CNN #News",
        "create_time": 1751040926,
        "like_count": 2171,
        "view_count": 77828
      },
      {
        "username": "cnn",
        "view_count": 22854,
        "comment_count": 30,
        "like_count": 520,
        "region_code": "US",
        "share_count": 5,
        "video_description": "102-year-old Jake Larson, WWII veteran, and his reaction to winning an Emmy for his interview with CNN's Christiane Amanpour. #cnn #news ",
        "create_time": 1751039293,
        "id": 7520656323613134135
      },
      {
        "create_time": 1751037304,
        "like_count": 7079,
        "region_code": "US",
        "share_count": 853,
        "username": "cnn",
        "view_count": 217617,
        "comment_count": 779,
        "id": 7520647733787610382,
        "video_description": "The Supreme Court backed President Donald Trump’s effort to curtail lower court orders that have hampered his agenda for months. However, it signaled that the president’s controversial plan to effectively end birthright citizenship may never be enforced. #cnn #news #supremecourt #scotus #trump"
      },
      {
        "comment_count": 45,
        "like_count": 752,
        "region_code": "US",
        "share_count": 22,
        "username": "cnn",
        "video_description": "After a stormy evening in Venice, CNN's Melissa Bell explains why details remain closely guarded ahead of the Bezos-Sanchez wedding. #bezos #wedding #venice ",
        "create_time": 1751036682,
        "id": 7520645039035354382,
        "view_count": 49586
      },
      {
        "like_count": 102298,
        "region_code": "US",
        "video_description": "CNN's Erin Burnett speaks with New York City mayoral candidate Zohran Mamdani about concerns over taxing the city's wealthy to fund his proposed initiatives, and whether it will cause them to leave the city. #cnn #news ",
        "view_count": 1411406,
        "comment_count": 6075,
        "id": 7520638201329978638,
        "share_count": 2422,
        "username": "cnn",
        "create_time": 1751035095
      },
      {
        "like_count": 11424,
        "username": "cnn",
        "video_description": "Follow CNN’s Victor Blackwell as he visits Ithaca, New York -- a hidden gem where towering waterfalls, vibrant murals, and soulful food come together to create the ultimate feel-good getaway. Check out CNN’s America’s Best Towns to Visit for this year’s top ten list and much more. #cnn #travel #waterfall ",
        "share_count": 3763,
        "view_count": 138871,
        "comment_count": 191,
        "create_time": 1751033134,
        "id": 7520629827670396215,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "username": "cnn",
        "comment_count": 199,
        "id": 7520627390826007863,
        "like_count": 5633,
        "share_count": 751,
        "video_description": "A “daytime fireball” was caught on video in the sky over South Carolina – causing a sonic boom, according to the American Meteor Society. CNN has reached out to emergency management officials in North Carolina and Tennessee, as well as NASA for comment. #cnn #news #fireball #space ",
        "view_count": 247012,
        "create_time": 1751032571
      },
      {
        "video_description": "CCTV footage released by the Seoul Southern District Prosecutors’ Office captures the moment a man lit a fire on a busy subway in the South Korean capital last month. The footage, from May 31, shows passengers running away after the suspect doused the floor of the train carriage with flammable liquid before setting it alight. Reuters reports that according to the prosecutors' office, six people were injured. The prosecutor's office says it charged the 67-year-old man with attempted murder and arson.",
        "view_count": 61130,
        "like_count": 1034,
        "region_code": "US",
        "share_count": 98,
        "username": "cnn",
        "comment_count": 43,
        "create_time": 1751029810,
        "id": 7520615442965105975
      },
      {
        "comment_count": 55,
        "id": 7520607768076684558,
        "like_count": 496,
        "share_count": 18,
        "create_time": 1751028035,
        "region_code": "US",
        "username": "cnn",
        "video_description": "The Los Angeles Police Department said a break-in occurred at a house in the Los Feliz neighborhood. A law enforcement source familiar with the investigation confirmed to CNN that it belongs to actor Brad Pitt. #CNN #News",
        "view_count": 27190
      },
      {
        "id": 7520551671202712846,
        "share_count": 4,
        "video_description": "Firefighters rescued an eight-year-old girl trapped in a sewer drain for seven hours in Guizhou, China, according to the local firefighting department. The southwestern province has been hit with heavy rains and floods since June 17, with tens of thousands forced to evacuate, according to Chinese state media. #china #weather ",
        "view_count": 18126,
        "comment_count": 38,
        "create_time": 1751015005,
        "like_count": 380,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "view_count": 17607,
        "comment_count": 32,
        "id": 7520532740048047374,
        "region_code": "US",
        "share_count": 8,
        "username": "cnn",
        "create_time": 1751010582,
        "like_count": 444,
        "video_description": "A bear running around the runway at Japan’s Yamagata Airport has forced staff to cancel flights on Thursday. Traps set up near the runway have failed to catch the bear but will remain in place, according to airport officials. Flights departing from and arriving at Yamagata Airport on Friday are operating as usual. #japan #bear #airport "
      },
      {
        "like_count": 31926,
        "region_code": "US",
        "username": "cnn",
        "view_count": 809887,
        "create_time": 1750987048,
        "id": 7520432044619418935,
        "video_description": "President Trump's \"Big Beautiful Bill\" hit a significant roadblock in the Senate with a Senate rules referee striking down key provisions, saying they don't meet the chamber's strict budget rules. Senators are now scrambling to make changes that would allow the bill to be passed by the July 4th deadline. #CNN #News ",
        "comment_count": 959,
        "share_count": 538
      },
      {
        "create_time": 1750986014,
        "region_code": "US",
        "comment_count": 2796,
        "id": 7520427515643514167,
        "like_count": 128651,
        "share_count": 1848,
        "username": "cnn",
        "video_description": "Zohran Mamdani, New York state assemblyman and democratic socialist who won the Democratic primary for New York City mayor, joins CNN’s Erin Burnett to discuss New York City Eric Adam’s recent attacks on him.",
        "view_count": 1519243
      },
      {
        "comment_count": 125,
        "username": "cnn",
        "video_description": "The Trump administration has discussed possibly helping Iran access as much as $30 billion to build a civilian-energy-producing nuclear program, sources say.",
        "view_count": 79246,
        "create_time": 1750982535,
        "id": 7520412604699839799,
        "like_count": 1676,
        "region_code": "US",
        "share_count": 121
      },
      {
        "username": "cnn",
        "video_description": "CNN’s Melissa Bell reports from Venice, Italy, following newlyweds Jeff Bezos and Lauren Sanchez as they wave at spectators during their boat ride through the city. #CNN #News ",
        "view_count": 283633,
        "comment_count": 403,
        "create_time": 1751147201,
        "id": 7521119757819563319,
        "like_count": 6287,
        "region_code": "US",
        "share_count": 161
      },
      {
        "video_description": "Demonstrators with the “No Space for Bezos” group marched through the streets of Venice on the final day of the extravagant wedding celebrations of Jeff Bezos and Lauren Sanchez. CNN’s Melissa Bell reports from the protest. #CNN #News #venice #bezoswedding",
        "comment_count": 110,
        "id": 7521090720711642381,
        "region_code": "US",
        "username": "cnn",
        "view_count": 108172,
        "create_time": 1751140446,
        "like_count": 3413,
        "share_count": 162
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "CNN's Nic Robertson reports from Tel Aviv where tens of thousands of anti-war protesters packed Hostages Square to call for an end to the Gaza war and the return of the remaining hostages.",
        "view_count": 75239,
        "create_time": 1751138608,
        "id": 7521082907062996237,
        "like_count": 3552,
        "comment_count": 336,
        "share_count": 144
      },
      {
        "id": 7521018884812541239,
        "like_count": 14520,
        "video_description": "Scholars and commentators in both the US and China are drawing comparisons between the early months of President Donald Trump’s second term and communist dictator Mao Zedong’s Cultural Revolution. But some believe the way of Mao is unlikely to take root in America. CNN's Kristie Lu Stout explores the similarities and differences between the two leaders. #cnn #news",
        "create_time": 1751123732,
        "region_code": "US",
        "share_count": 786,
        "username": "cnn",
        "view_count": 263154,
        "comment_count": 879
      },
      {
        "create_time": 1751123151,
        "id": 7521016448450399502,
        "like_count": 3137,
        "share_count": 76,
        "username": "cnn",
        "view_count": 127485,
        "comment_count": 174,
        "region_code": "US",
        "video_description": "After tying the knot in a private ceremony on Friday, Jeff Bezos and Lauren Sanchez’s three-day-long Venetian extravaganza will come to a close on Saturday with a final star-studded party. #cnn #news"
      },
      {
        "share_count": 14207,
        "video_description": "CNN’s Frederik Pleitgen witnesses the ‘Hosseini Infants Ceremony’ in Tehran where hundreds of women hold their babies into the air to show they are willing to offer their children to God and to Imam Hossein. The ceremony is held on the first Friday of the month in Islamic calendar. #CNN #News #Iran #Tehran",
        "view_count": 1277851,
        "like_count": 35332,
        "create_time": 1751122211,
        "id": 7521012406143782199,
        "region_code": "US",
        "username": "cnn",
        "comment_count": 4755
      },
      {
        "share_count": 204,
        "view_count": 104390,
        "id": 7520955949981469966,
        "like_count": 3517,
        "region_code": "US",
        "username": "cnn",
        "video_description": "CNN's Frederik Pleitgen describes the scene as thousands of Iranians gathered to mourn military leaders, nuclear scientists and civilians during the country’s 12-day conflict with Israel. #CNN #News #Iran",
        "comment_count": 418,
        "create_time": 1751109157
      },
      {
        "comment_count": 1215,
        "id": 7520821164399168781,
        "region_code": "US",
        "view_count": 314859,
        "create_time": 1751077664,
        "like_count": 23945,
        "share_count": 643,
        "username": "cnn",
        "video_description": "A bystander captured on video the moment immigration agents in street clothes chased a woman across the street trying to detain her outside of a Home Depot where she had been selling food in West Los Angeles just moments prior."
      },
      {
        "username": "cnn",
        "video_description": "Despite lifting its 11-week total blockade of Gaza in May, Israel continues to restrict the types of aid allowed into Gaza. CNN's Jeremy Diamond reports on Gaza's most vulnerable. #CNN #News ",
        "comment_count": 4591,
        "create_time": 1751076490,
        "id": 7520816117183466765,
        "like_count": 194888,
        "region_code": "US",
        "share_count": 16063,
        "view_count": 1329355
      },
      {
        "like_count": 1258,
        "share_count": 22,
        "view_count": 65981,
        "comment_count": 199,
        "create_time": 1751073514,
        "id": 7520803324942175502,
        "region_code": "US",
        "username": "cnn",
        "video_description": "New York City Mayor Eric Adams joins CNN's Jake Tapper to discuss poll numbers that indicate dissatisfaction with his job performance."
      },
      {
        "create_time": 1751073324,
        "region_code": "US",
        "share_count": 1297,
        "username": "cnn",
        "view_count": 405672,
        "comment_count": 239,
        "like_count": 30067,
        "video_description": "University of Virginia president James Ryan announced his resignation amid pressure from the US Department of Justice to dismantle the university’s diversity, equity and inclusion programs. CNN's Betsy Klein reports.",
        "id": 7520802511343734029
      },
      {
        "id": 7520795740755528973,
        "like_count": 3865,
        "share_count": 94,
        "video_description": "Lauren Sanchez revealed her highly-anticipated wedding dress in an exclusive interview with Vogue where she shared the craftsmanship and inspiration behind her custom Dolce & Gabbana gown.",
        "view_count": 415022,
        "comment_count": 199,
        "create_time": 1751071753,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "create_time": 1751069569,
        "share_count": 288,
        "view_count": 75334,
        "video_description": "CNN's Nick Watt reports from Westwood Boulevard in Los Angeles, situated in a neighborhood known as \"Tehrangeles\" for its population of Iranians and Persian Jews. #cnn #news ",
        "comment_count": 130,
        "id": 7520786412053007630,
        "like_count": 2260,
        "region_code": "US",
        "username": "cnn"
      },
      {
        "region_code": "US",
        "username": "cnn",
        "video_description": "Thousands of Colombians take to the streets of Bogota in celebration of Pride, as well as an act of defiance against violence in the country towards community members.",
        "view_count": 66728,
        "create_time": 1751239353,
        "id": 7521515591044222222,
        "like_count": 5429,
        "share_count": 357,
        "comment_count": 227
      },
      {
        "video_description": "From Chicago-style profiteroles to Tyler Florence's truffle-stuffed Wagyu beef, Phil Rosenthal gets everyone to shove delicious food into his mouth in Aspen, Colorado. #cnn #news #travel #aspen #colorado #cooking #wagyu #beef #lifestyle #besttowns #foodie #foodlover #philrosenthal #tylerflorence",
        "create_time": 1751194309,
        "id": 7521321736470646071,
        "share_count": 224,
        "username": "cnn",
        "comment_count": 105,
        "like_count": 3102,
        "region_code": "US",
        "view_count": 45420
      },
      {
        "share_count": 281,
        "username": "cnn",
        "view_count": 105004,
        "region_code": "US",
        "video_description": "Protesters in Budapest are marching against a ban on Pride events across Hungary. People came from 30 different countries to show support under scorching heat, organizers said. #cnn #budapest #hungary #pride #news",
        "comment_count": 345,
        "create_time": 1751183333,
        "id": 7521274726967233805,
        "like_count": 12156
      },
      {
        "like_count": 4337,
        "share_count": 290,
        "video_description": "Three years since Thailand became the first country in Asia to decriminalize cannabis, the government this week imposed new rules designed to rein in the country’s “green rush.” #cnn #news #thailand #weed #cannabis",
        "id": 7521267193888165175,
        "create_time": 1751181546,
        "region_code": "US",
        "username": "cnn",
        "view_count": 106058,
        "comment_count": 116
      },
      {
        "share_count": 57,
        "username": "cnn",
        "region_code": "US",
        "create_time": 1751159913,
        "id": 7521174421684374797,
        "like_count": 3169,
        "video_description": "Two men were walking in their neighborhood when they heard chirping near a sewer. When they approached, they could see a baby bird trapped inside the sewer.",
        "view_count": 68995,
        "comment_count": 113
      },
      {
        "comment_count": 534,
        "create_time": 1751157226,
        "region_code": "US",
        "share_count": 1388,
        "id": 7521162895946747150,
        "like_count": 93960,
        "username": "cnn",
        "video_description": "CNN’s Randi Kaye investigates the mystery of journalist Jodi Huisentruit’s disappearance in 1995. Now thirty years later, police are still tracking down clues. #cnn #news",
        "view_count": 1004945
      },
      {
        "video_description": "Kootenai County Sheriff Bob Norris says that suspect Wess Roley, who ambushed firefighters, later shot himself. Records show that the sheriff’s office and Coeur D’Alene Police had five minor interactions with the 20-year-old. The Sheriff’s office also learned that Roley had ambitions to become a firefighter.",
        "comment_count": 515,
        "create_time": 1751327236,
        "like_count": 9365,
        "region_code": "US",
        "share_count": 529,
        "id": 7521893072238578957,
        "username": "cnn",
        "view_count": 319856
      },
      {
        "like_count": 576,
        "region_code": "US",
        "share_count": 16,
        "video_description": "Over the duration of the Sean “Diddy” Combs trial, influencers have decided to cover the trial by livestreaming from outside the Manhattan courthouse where Combs has appeared. CNN’s Brynn Gingras spoke with some of the influencers who covered the “Diddy” trial.",
        "view_count": 30794,
        "id": 7521886534606376247,
        "create_time": 1751325727,
        "username": "cnn",
        "comment_count": 23
      },
      {
        "view_count": 131288,
        "create_time": 1751315936,
        "id": 7521844600672242999,
        "like_count": 5452,
        "share_count": 432,
        "username": "cnn",
        "comment_count": 414,
        "region_code": "US",
        "video_description": "Starbucks is trying to get back to its roots as a local coffee shop as part of its turnaround plan. The company is redesigning stores with comfortable seats and tables, new espresso bars and other elements to try to draw customers back. CNN goes inside a new store in Bridgehampton, New York that's a model for Starbucks' plans."
      },
      {
        "comment_count": 3185,
        "id": 7521828859919011085,
        "like_count": 257905,
        "create_time": 1751312269,
        "region_code": "US",
        "share_count": 10706,
        "username": "cnn",
        "video_description": "A father jumped into the ocean after his daughter fell overboard from a Disney cruise ship returning to Florida. Both were rescued by the crew aboard the Disney Dream and back to the ship safely.",
        "view_count": 5967240
      },
      {
        "comment_count": 28,
        "id": 7521826299879460110,
        "like_count": 686,
        "region_code": "US",
        "username": "cnn",
        "view_count": 54117,
        "create_time": 1751311671,
        "share_count": 23,
        "video_description": "As Wimbledon gets under way, temperatures have soared in the UK. The high temperature on opening day surpassed the 2001 tournament for the warmest opening day in the tournament’s 147-year history. #CNN #news #Wimbledon"
      },
      {
        "create_time": 1751305874,
        "username": "cnn",
        "video_description": "Jurors are now deliberating in Sean “Diddy” Combs’ federal criminal trial. Combs has pleaded not guilty to federal charges that include racketeering conspiracy and sex trafficking. If convicted on all counts, he could face up to life in prison. CNN's Elizabeth Wagmeister reports. #cnn #news #diddy #diddytrial",
        "view_count": 208137,
        "comment_count": 240,
        "like_count": 4044,
        "region_code": "US",
        "share_count": 264,
        "id": 7521801401941380366
      },
      {
        "video_description": "Tony Delgado and Gabriela Berrospi, entrepreneurs and founders of multimedia brand Latino Wall Street, helped rally the Latino vote for President Donald Trump in 2024. As the administration has escalated ICE raids and deportations this year, they visited Washington D.C. and the White House to advocate for their community and immigration reform. CNN’s @Meena Hart Duerson reports. #cnn #news #trump ",
        "view_count": 88048,
        "create_time": 1751305616,
        "id": 7521800274529340685,
        "like_count": 4035,
        "username": "cnn",
        "comment_count": 569,
        "region_code": "US",
        "share_count": 319
      },
      {
        "id": 7521763224040115469,
        "like_count": 26981,
        "region_code": "US",
        "share_count": 2003,
        "comment_count": 1277,
        "create_time": 1751296990,
        "view_count": 665346,
        "username": "cnn",
        "video_description": "Heatwaves have pushed temperatures above 104 degrees Fahrenheit (40 degrees Celsius) in countries across Europe, including Spain, Greece, Portugal and Italy. Firefighters battled a wildfire near Athens late last week, and regions of Portugal were under high alert on Sunday. According to experts, the extreme weather is linked to climate change. #cnn #news #europe #heatwave"
      },
      {
        "view_count": 1148462,
        "id": 7521735203522350391,
        "like_count": 50169,
        "region_code": "US",
        "share_count": 4805,
        "video_description": "Video posted on social media shows thousands of 'lovebugs' blanketing hiking trails on the Gyeyangsan mountain. South Korea is wrestling with an outbreak of the insects, which have been driven into warmer urban areas like Seoul due to climate change, according to a 2022 study. #cnn #news",
        "comment_count": 680,
        "create_time": 1751290461,
        "username": "cnn"
      },
      {
        "id": 7521719351800581389,
        "like_count": 158023,
        "share_count": 4014,
        "username": "cnn",
        "video_description": "Sen. Thom Tillis (R-NC) warned President Trump and Republicans that the Senate version of the sweeping \"big, beautiful bill\" will break a promise Trump made to not cut Medicaid. Tillis also announced Sunday that he will not seek re-election in 2026. #donaldtrump #bigbeautifulbill #senate #republicans #medicaidcuts #cnn #news",
        "comment_count": 4050,
        "create_time": 1751286773,
        "region_code": "US",
        "view_count": 1796579
      },
      {
        "like_count": 76559,
        "region_code": "US",
        "username": "cnn",
        "view_count": 955040,
        "comment_count": 1270,
        "create_time": 1751282825,
        "id": 7521702372201057591,
        "share_count": 1014,
        "video_description": "Residents of Coeur d’Alene, Idaho, lined the highway to honor two firefighters killed in an ambush while responding to a fire. The procession transporting the firefighters from Kootenai Health to Spokane, Washington, drew a large turnout from the community. #cnn #news #firefighter #idaho"
      },
      {
        "like_count": 13166,
        "region_code": "US",
        "share_count": 1099,
        "create_time": 1751267273,
        "id": 7521635595404250423,
        "username": "cnn",
        "video_description": "Two firefighters were fatally shot while responding to a brush fire in Coeur d’Alene, Idaho. Another man found dead with a firearm on Canfield Mountain is believed to be the only shooter in Sunday’s attacks, according to Kootenai County Sheriff Bob Norris. #cnn #news #idaho #idahoshooting",
        "view_count": 400700,
        "comment_count": 504
      },
      {
        "like_count": 23618,
        "share_count": 640,
        "video_description": "A technical mishap led to Beyoncé’s “flying” car prop to tilt during a Cowboy Carter concert in Houston, with fans capturing the moment on video. The singer was quickly lowered down and without injury, according to Beyoncé’s entertainment and management company.\u2028#cnn #beyonce #cowboycarter",
        "view_count": 890873,
        "comment_count": 661,
        "create_time": 1751250340,
        "username": "cnn",
        "id": 7521562755971779854,
        "region_code": "US"
      },
      {
        "comment_count": 1779,
        "create_time": 1751243954,
        "share_count": 10121,
        "username": "cnn",
        "video_description": "Two people, believed to be fire personnel, were fatally shot and others injured while responding to a brush fire in Coeur d’Alene, Idaho, and at least one active shooter continues to fire at law enforcement with high-powered rifles, according to Kootenai County Sheriff Robert Norris.",
        "view_count": 1259954,
        "id": 7521535354743164215,
        "like_count": 61732,
        "region_code": "US"
      }
    ]
  }
}