{
  "data": {
    "videos": [
      {
        "comment_count": 99,
        "share_count": 173,
        "view_count": 86570,
        "create_time": 1748977664,
        "id": 7511801774056000798,
        "like_count": 11692,
        "region_code": "US",
        "username": "washingtonpost",
        "video_description": "Ukraine’s drone strike took 18 months to plan. For 18 months, Ukraine’s internal security service planned an audacious assault on far-flung Russian airfields — first sneaking drones into Russia, then planting them near key military runways. On Sunday, just ahead of a new round of peace talks, it was go time: Near four unsuspecting Russian military bases, remotely activated roofs lifted off mobile homes and sheds parked on flatbed trucks. Armed Ukrainian drones tucked inside soared upward, then pounced on military aircraft lined up on the runways, engulfing many in flames. The brazen attack — which Ukrainian officials claimed destroyed at least 13 Russian aircraft and damaged dozens of others — shocked Russia and instantly reduced its capabilities to threaten a nuclear attack or launch missile strikes on Ukraine and other countries. It also served as a crucial reminder to Moscow and Ukraine’s Western partners that Kyiv remains capable of exploiting Russia’s weaknesses and disrupting its war plans, despite being outnumbered and outgunned. Caption from article by Siobhán O'Grady, Francesca Ebel, Serhiy Morgunov and Alex Horton"
      },
      {
        "like_count": 5169,
        "share_count": 69,
        "video_description": "The ACLU of Hawaii, which filed the suit in state court, says it has identified at least 127 people arrested from 2022 through 2024 whose breath or blood tests showed a blood alcohol level of 0.00. Nearly 9 in 10 were never charged with any crime — not even a traffic violation. “The bottom line is this totally undermines the public’s trust in law enforcement — not to mention that false arrests are unconstitutional,” said Wookie Kim, legal director at ACLU of Hawaii. In a statement, the Honolulu Police Department told The Washington Post that it is taking the allegations “very seriously” and has launched a comprehensive review of all impaired-driving arrests dating back to 2021.  The case-by-case audits will aim to identify “negative patterns” and improve training, the department said, and will be conducted “with the utmost care and integrity.” Story from an article by: María Luisa Paúl",
        "view_count": 54646,
        "comment_count": 68,
        "create_time": 1748967572,
        "id": 7511758387823119647,
        "region_code": "US",
        "username": "washingtonpost"
      },
      {
        "region_code": "US",
        "share_count": 61,
        "video_description": "A divided Supreme Court cleared the way — for now — for the Trump administration to revoke the provisional legal status of potentially hundreds of thousands of immigrants from Cuba, Haiti, Nicaragua and Venezuela who have been allowed to live and work in the United States while their immigration cases play out. Officials said the decision on immigration parole could affect about 530,000 migrants, though many of them may have obtained another legal status in the United States. Cubans, for instance, are eligible to apply for permanent residency and a path to citizenship under a 1966 federal law. This decision is the second this month in which the high court has given Trump officials permission to terminate programs that protect immigrants fleeing countries racked by war or economic turmoil while litigation on those programs continues. The justices also allowed the administration to revoke temporary protections that allowed a different group of nearly 350,000 Venezuelans to remain in the United States. Caption from article by Justin Jouvenal, Christine Armario and Maria Sacchetti.",
        "view_count": 206690,
        "comment_count": 131,
        "id": 7511507775344659743,
        "username": "washingtonpost",
        "create_time": 1748909208,
        "like_count": 14083
      },
      {
        "comment_count": 298,
        "create_time": 1749062632,
        "id": 7512166683872660766,
        "username": "washingtonpost",
        "view_count": 362075,
        "like_count": 35561,
        "region_code": "US",
        "share_count": 696,
        "video_description": "Elon Musk called Trump’s new bill “a disgusting abomination” that would burden the country with “crushingly unsustainable debt.” Though Musk — who on Friday left his post as head of the U.S. DOGE Service, Trump’s cost-cutting effort — had previously criticized the bill in gentler terms, his posts on X, the social media platform he owns, represented his sharpest attack yet on the Trump White House. For months, Musk had played the role of the president’s “first buddy,” joining Trump frequently in the Oval Office and exhorting the administration to cut government spending. The posts appeared to complicate the path to passage for the legislation, which barely passed the House late last month after conservatives revolted over its enormous price tag. The nonpartisan Congressional Budget Office says the bill would increase the national debt by $2.4 trillion over the next decade. The Senate began consideration of the measure this week, and GOP leaders hope to have it to Trump’s desk by July 4. Trump has encouraged lawmakers to pass the measure, but some Republican Senate budget hawks applauded Musk’s attack Tuesday, a potential sign of trouble. “This massive, outrageous, pork-filled Congressional spending bill is a disgusting abomination,” Musk posted on X. “Shame on those who voted for it: you know you did wrong. You know it.” Caption from article by Jacob Bogage and Theodoric Meyer."
      },
      {
        "username": "washingtonpost",
        "video_description": "Trump reinstated his 2017 travel ban and added some more countries. The presidential proclamation, slated to go into effect June 9, fully restricts the entry of individuals from Afghanistan, Myanmar, Chad, Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. It also partially restricts the entry of travelers from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela. The Trump administration, in a document circulated Wednesday evening, cited national security concerns and said the president made his decision after reviewing a State Department report. Authorities said the ban was necessary to compel foreign governments to cooperate with their agenda and enforce the country’s immigration laws. Countries included in the ban were deemed to have insufficient security vetting procedures for issuing passports or other travel documents and had high rates of citizens who overstayed their visas in the United States, authorities said. The new travel restrictions include exceptions for lawful permanent residents, existing visa holders, certain visa categories, and individuals whose entry serves U.S. national interests. Democrats condemned the administration’s announcement and cast the ban as a betrayal of American values. Sen. Edward J. Markey (Massachusetts) said the move will not make America safer, and Sen. Adam Schiff (California) said the ban will serve to further isolate the United States on the global stage. Rep. Yassamin Ansari (Arizona), who is Iranian American, said the “xenophobic and racist ban will devastate my constituents and families like mine.” Caption from article by David Nakamura, Emily Davies and Marianne LeVine.",
        "view_count": 139671,
        "comment_count": 108,
        "create_time": 1749157714,
        "id": 7512575140228500766,
        "like_count": 13882,
        "region_code": "US",
        "share_count": 130
      },
      {
        "create_time": 1749137319,
        "id": 7512487518277864734,
        "like_count": 1027,
        "username": "washingtonpost",
        "video_description": "Trump DOUBLES Steel and aluminum  Tariffs on steel and aluminum doubled to 50 percent Wednesday, adding higher costs and new uncertainty for businesses across the country that rely on metal imports for machinery, construction and manufacturing. In the order doubling the tariffs, President Donald Trump wrote that the higher levies “will provide greater support to these industries and reduce or eliminate the national security threat posed by imports of steel and aluminum articles and their derivative articles.” But for American companies that rely on specialized metals that aren’t available domestically, the order set off a fresh scramble to raise prices and rethink hiring and investment. Caption from an article by: Abha Bhattarai",
        "view_count": 13668,
        "comment_count": 27,
        "region_code": "US",
        "share_count": 11
      },
      {
        "create_time": 1749502878,
        "region_code": "US",
        "username": "washingtonpost",
        "video_description": "Who gets the 23andMe Data?? The fate of genetic data belonging to millions of 23andMe customers is again up in the air, as the bankrupt company seeks a judge’s permission to consider another bid from its co-founder and undisclosed financial backers after previously accepting an offer from Regeneron Pharmaceuticals. A nonprofit research institute backed by Anne Wojcicki, 23andMe’s co-founder and former CEO, has been pressing 23andMe to consider additional bids purportedly topping Regeneron’s $256 million cash offer last month, arguing that the bankruptcy auction was closed prematurely.  That has put 23andMe in a bind, with the firm saying in court filings it was at risk of litigation unless it effectively reopened the auction to entertain final offers from Wojcicki’s group and Regeneron. So 23andMe is proposing a compromise that would allow TTAM Research Institute, founded by Wojcicki, to make a final bid and give Regeneron the opportunity to make a counteroffer. Should TTAM prevail, 23andMe would pay Regeneron a $10 million breakup fee. Caption from a story by: By Daniel Gilbert and Elizabeth Dwoskin",
        "view_count": 16107,
        "comment_count": 15,
        "id": 7514057560966597918,
        "like_count": 945,
        "share_count": 13
      },
      {
        "region_code": "US",
        "video_description": "President Donald Trump’s order to deploy 2,000 California National Guard troops to Los Angeles appears unprecedented, relying on an unorthodox use of a law aimed at quelling serious domestic unrest or an attack on the United States by a foreign power, some legal experts said Sunday. It marks the first time in about 60 years that an American president has taken such action without a governor’s consent. Furthermore, his executive order authorizes the Pentagon to dispatch military personnel domestically to enable federal functions and protect government property — a chilling sign, the experts said, that Trump is prepared to send troops into other cities in response to protests. “That is completely unprecedented under any legal authority,” said Elizabeth Goitein, senior director of the Liberty and National Security Program at the Brennan Center for Justice. “The use of the military to quell civil unrest is supposed to be an absolute last resort.” Caption from article by Justin Jouvenal and Alex Horton.",
        "view_count": 530950,
        "comment_count": 245,
        "id": 7514007524190752031,
        "share_count": 387,
        "username": "washingtonpost",
        "create_time": 1749491229,
        "like_count": 37691
      },
      {
        "region_code": "US",
        "comment_count": 257,
        "create_time": 1749597479,
        "id": 7514463874414857503,
        "like_count": 20838,
        "share_count": 583,
        "username": "washingtonpost",
        "video_description": "A military parade is coming through D.C this Saturday, June 14th.  Security officials said they plan to close numerous D.C. streets, some for up to four days, and deploy thousands of police officers and federal agents for the U.S. Army’s 250th birthday celebration as the city braces for throngs of onlookers expected to attend a huge military parade and festival along the National Mall. The large-scale military parade is the result of a confluence of interests: a president who has long pushed for the kind of grand pageant he’d witnessed in other countries, and a military that was now willing to show off its might. For a president who loves crowds, who relishes big displays of heavy equipment and whose inauguration was pushed indoors because of cold weather, everything has fallen in place for an event set to take place on June 14 — Trump’s 79th birthday. The Pentagon is now under the control of loyalists, and the guardrails previously in place are gone. Caption from articles by Matt Viser, Dan Lamothe,  Michael Brice-Saddler, Emma Uber and Olivia George",
        "view_count": 218657
      },
      {
        "like_count": 29680,
        "region_code": "US",
        "share_count": 207,
        "video_description": "A federal judge in New York dismissed Justin Baldoni’s $400 million defamation lawsuit against Blake Lively on Monday, a significant step in the sprawling legal saga between the two “It Ends With Us” stars.  Baldoni sued Lively and her husband, Ryan Reynolds, in January, accusing the Hollywood power couple of trying to hurt his career amid the press tour and production of “It Ends With Us,” an adaptation of Colleen Hoover’s best-selling romance novel with the same name. He also sued the New York Times, alleging that the newspaper published an article heavily relying on Lively’s account against Baldoni without fact-checking. Caption from reporting by Herb Scribner. Featuring special guests including @bencafuir",
        "view_count": 524760,
        "comment_count": 86,
        "create_time": 1749677056,
        "id": 7514805632353029406,
        "username": "washingtonpost"
      },
      {
        "id": 7514735480873684255,
        "like_count": 1718,
        "view_count": 30238,
        "share_count": 16,
        "username": "washingtonpost",
        "video_description": "Trump wants to give BABIES $1,000 As Republicans’ massive tax and spending cut bill makes its way through the Senate, President Donald Trump on Monday touted a provision in the measure that would provide every child born in the United States with a $1,000 investment account. Dubbed “Trump accounts,” the tax-deferred investment accounts would be set up for children born in the U.S. after Dec. 31, 2024, and before Jan. 1, 2029 — covering the majority of Trump’s second term. The accounts would, over the course of a child’s first 18 years, track the overall stock market, and parents are allowed to contribute up to $5,000 a year to the account. The accounts would be controlled by the child’s guardians or parents. Caption from an article by: Mariana Alfaro",
        "comment_count": 52,
        "create_time": 1749660716,
        "region_code": "US"
      },
      {
        "create_time": 1749757287,
        "like_count": 7818,
        "region_code": "US",
        "share_count": 261,
        "username": "washingtonpost",
        "comment_count": 99,
        "video_description": "RFK Jr. picked eight new members for the Advisory Committee on Immunization Practices, after ousting 17 independent vaccine experts. Kennedy said the picks will demand “definitive safety and efficacy data” for vaccine recommendations. His choices include at least three critics of mRNA coronavirus vaccines. His picks for the Advisory Committee on Immunization Practices include a well-known pediatric infectious-diseases expert and at least three people who have criticized the use of mRNA coronavirus vaccines. Some of the more notable selections include Martin Kulldorff, the co-author of the Great Barrington Declaration, which called for herd immunity through mass covid infection in 2020, and Vicky Pebsworth, who is listed on the board of the nation’s oldest anti-vaccine group. Caption from article by Lena H. Sun and Lauren Weber.",
        "view_count": 78708,
        "id": 7515150280804109599
      },
      {
        "username": "washingtonpost",
        "video_description": "Can Trump STILL impose tariffs??",
        "create_time": 1749844414,
        "id": 7515524443599408415,
        "like_count": 1201,
        "region_code": "US",
        "share_count": 14,
        "comment_count": 77,
        "view_count": 22280
      },
      {
        "id": 7515467770075696415,
        "username": "washingtonpost",
        "video_description": "Israel launched a “preemptive attack” on Iran overnight. Multiple explosions were reported across Iran early Friday, including in Tehran and at the Natanz nuclear facility. The strikes killed four senior commanders and “two prominent Iranian nuclear scientists.” President Donald Trump told the Wall Street Journal on Friday that his administration was aware of Israel’s plan to strike Iranian nuclear and military sites. In an interview with the newspaper, Trump said he spoke Thursday with Israeli Prime Minister Benjamin Netanyahu and intends to do so again Friday.",
        "view_count": 1634970,
        "comment_count": 1277,
        "create_time": 1749831224,
        "like_count": 80309,
        "region_code": "US",
        "share_count": 2370
      },
      {
        "comment_count": 74,
        "id": 7516637668185263391,
        "like_count": 13277,
        "region_code": "US",
        "share_count": 47,
        "username": "washingtonpost",
        "video_description": "An appeals court is allowing President Donald Trump, for now, to keep the California National Guard deployed in response to protests in Los Angeles, blocking a ruling Thursday by a federal judge that ordered the Trump administration to return control of the troops to California Gov. Gavin Newsom. Caption from article by Caroline O'Donovan, Karin Brulliard, Mark Berman and Kelsey Ables.",
        "create_time": 1750103606,
        "view_count": 226282
      },
      {
        "id": 7516950808441752863,
        "like_count": 1315,
        "share_count": 7,
        "view_count": 15754,
        "comment_count": 34,
        "create_time": 1750176521,
        "video_description": "Wait for it. Dave is in France, explaining news to an international audience! President Donald Trump left the Group of Seven summit a day early to attend to the conflict between Israel and Iran, the White House announced Monday, after he called for “a broader de-escalation of hostilities” in the Middle East in a statement with other global leaders. Trump initially declined to sign the G-7’s statement, but reversed his position following discussions with other leaders in the group and changes to the initial draft, according to a U.S. official who spoke on the condition of anonymity to describe the sensitive conversations. Caption from article by Cat Zakrzewski, Amanda Coletta and Cleve R. Wootson Jr..",
        "region_code": "US",
        "username": "washingtonpost"
      },
      {
        "like_count": 1786,
        "username": "washingtonpost",
        "video_description": "New tax law might END free snacks A change in tax law may make companies rethink a popular workplace perk: food and drink. Starting in 2026, companies will no longer be able to deduct the cost of on-site cafeterias or takeout for workers who stay late. And accountants say the change probably applies to office snacks and coffee, too. Though the cost of such staff freebies is relatively small in the grand scheme of employee benefits, the potential change in tax law comes as many businesses are trimming expenses in the face of tariffs and economic uncertainty. “Companies are in cost-cutting mode, and if they don’t have some incentives, they will continue to cut back,” said Ellen Kossek, an emerita professor of management at Purdue University. “We’ve seen this in Silicon Valley,” she added, referencing the onetime center of such upmarket perks as unlimited vacation time, on-site hair stylists, deluxe cafeterias and coffee bars.",
        "view_count": 20491,
        "create_time": 1750171617,
        "id": 7516929743283850526,
        "share_count": 68,
        "comment_count": 47,
        "region_code": "US"
      },
      {
        "create_time": 1750285287,
        "id": 7517417979076807966,
        "region_code": "US",
        "username": "washingtonpost",
        "view_count": 232206,
        "comment_count": 217,
        "share_count": 195,
        "video_description": "Members of Congress are attending emergency briefings this week after the killing of a Democratic Minnesota state lawmaker and her husband. The man charged in the shootings went to the homes of at least two other Minnesota legislators during his rampage, intending to kill them, authorities said Monday. He extensively stalked his victims and posed as a law enforcement officer during the shootings that killed state Rep. Melissa Hortman and her husband, Mark, and left state Sen. John Hoffman and his wife, Yvette, critically injured, said Joseph H. Thompson, acting U.S. attorney for the District of Minnesota. Video based on reporting by Holly Bailey, Patrick Marley and Jeremy Roebuck.",
        "like_count": 28020
      },
      {
        "like_count": 2307,
        "share_count": 364,
        "view_count": 38656,
        "create_time": 1750431254,
        "id": 7518044947832900894,
        "username": "washingtonpost",
        "video_description": "This school district wants to use AI to help improve school safety  Loudoun County schools will use an artificial intelligence system to help identify fights, bullying or other potential safety threats on campuses. The system, from local tech company VOLT AI, will use AI to monitor video footage from the school district’s existing security cameras to spot incidents that might require staff intervention, such as the presence of weapons or other safety threats or medical emergencies. The cameras are used only in common areas, not bathrooms or locker rooms. When the AI system detects a potential situation, VOLT staff will first try to verify the incident, then send an alert to school personnel with information about what is happening and where in the school. The verification process adds a short delay for responding, but it is designed to ensure there are no false positives, said Dmitry Sokolowski, co-founder of VOLT. Caption from an article by: Karina Elwood",
        "comment_count": 84,
        "region_code": "US"
      },
      {
        "view_count": 10970,
        "comment_count": 37,
        "create_time": 1750783422,
        "region_code": "US",
        "username": "washingtonpost",
        "id": 7519557417521237278,
        "like_count": 1084,
        "share_count": 14,
        "video_description": "UPDATE: U.S. x China trade war China has returned to trade talks with the United States this week holding, from its perspective, a strong hand: Its economy is bearing up better than many people — including President Donald Trump — expected. It has watched as Trump’s unconventional trade policy has suffered some legal setbacks. And it has a geopolitical ace card: It is controlling the export of much-needed rare earths. This shows how the Trump administration underestimated Beijing’s ability to withstand the pain of tariffs, according to analysts both inside and outside China. The tariffs reached a minimum of 145 percent before a temporary truce was declared in Geneva last month. “Back in February, the mainstream narrative in the U.S. was, ‘Oh, the Chinese economy is bad, so if the U.S. is going to use tariff stick, China would have no choice but to surrender,’” said Wu Xinbo, dean of the Institute of International Studies at Fudan University in Shanghai. Caption from an article by Katrina Northrop"
      },
      {
        "comment_count": 119,
        "create_time": 1751302544,
        "like_count": 7253,
        "video_description": "Everyone say hi to video intern @Mariana Trujillo 👋 A divided Supreme Court ruled against Planned Parenthood, saying Medicaid patients do not have a right to sue to obtain non-abortion health care from the organization’s medical providers. The 6-3 ruling, with all three liberal justices dissenting, reversed a lower-court decision that had allowed a Planned Parenthood South Atlantic patient to seek to reinstate the group’s clinics as qualified health care providers after South Carolina cut off all Medicaid funding for the organization because it offers abortion services. The decision means patients who rely on Medicaid will not be able to use the government insurance program for the poor to get services at the Planned Parenthood clinics in South Carolina. Caption from article by Ann E. Marimow.",
        "view_count": 84430,
        "id": 7521787110278368542,
        "region_code": "US",
        "share_count": 60,
        "username": "washingtonpost"
      }
    ]
  }
}