[
  {
    "username": "CNN",
    "created_at": "2025-05-31T23:27:32",
    "text": "The Indiana Pacers reach their first NBA Finals in 25 years and will face the Oklahoma City Thunder after eliminating the New York Knicks: cnn.it/4jtnNE6",
    "likes": 176,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T21:56:04",
    "text": "A former upstate New York prison guard pleaded guilty for his role in what prosecutors called a coverup of the beating death of inmate by fellow guards.",
    "likes": 109,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T21:35:04",
    "text": "Sadly for President Donald Trump’s most ardent fans, there’s probably no room left on Mount Rushmore. | Analysis",
    "likes": 92,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T21:25:01",
    "text": "The most decorated soccer team in England was marred by another tragedy May 26 at the end of its 10-mile trophy parade celebrating a 20th league title. But where Liverpool, as a city and club, has faced tragedy before, this was unlike previous events.",
    "likes": 57,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T21:07:47",
    "text": "Opal Suchata Chuangsri of Thailand was crowned Miss World in India, where the international pageant was held this year.\n\nRead more: cnn.it/3HmbgFi",
    "likes": 179,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T20:22:23",
    "text": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, a confidential report by the UN nuclear watchdog said and called on Tehran to urgently change course and comply with the agency’s probe.",
    "likes": 82,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T19:02:37",
    "text": "New Orleans celebrated the return and burial of the remains of 19 African American people whose skulls had been sent to Germany for racist research practices in the 19th century.",
    "likes": 312,
    "reposts": 82
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T18:03:04",
    "text": "The White House said it will announce a replacement candidate to serve as President Donald Trump’s pick to lead NASA, indicating it will withdraw the nomination of tech billionaire Jared Isaacman.",
    "likes": 77,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T17:06:04",
    "text": "Paris Saint-Germain dominates Inter 5-0 to win its first ever Champions League trophy after years of chasing European glory. \n\nRead more: cnn.it/3Ftl2oA",
    "likes": 142,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T16:38:34",
    "text": "Celebrated actor Valerie Mahaffey, whose stage, film and television work ranged from Shakespeare to the hit 1990s series “Northern Exposure,” died at age 71 after a battle with cancer, according to a statement released by her publicist. cnn.it/3StLRvG",
    "likes": 210,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T16:11:09",
    "text": "A self-proclaimed “MAGA girl,” Cuccia positioned herself as a proudly conservative voice among the normally nonpartisan Pentagon press corps. But she grew perturbed by Hegseth’s actions against the press.",
    "likes": 120,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T15:47:18",
    "text": "The popular Mexican regional music band Grupo Firme announced that it was canceling a performance in a music festival in California over the weekend after the United States government suspended the musicians’ visas.",
    "likes": 146,
    "reposts": 80
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T15:11:41",
    "text": "We all want to get off the plane as soon as it lands, but that can become a disorderly scramble, even before the aircraft has come to halt. Now the Turkish government has decided enough is enough.",
    "likes": 99,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T14:30:39",
    "text": "The slur, which has been used to discriminate against people with disabilities, is finding popularity online again. But its implications are bigger than one word, experts say.",
    "likes": 129,
    "reposts": 40
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T13:17:31",
    "text": "First Aaron Judge and then Shohei Ohtani homered at their respective first at bats of the game, making history as the first reigning MVPs to hit a home run in the opening inning of the same game.",
    "likes": 67,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T12:16:20",
    "text": "In a statement issued on X, the WFP said 77 trucks had crossed into Gaza loaded with flour. All of them “were stopped along the way, with food taken mainly by hungry people trying to feed their families.”",
    "likes": 80,
    "reposts": 33
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T10:51:45",
    "text": "The sale of disposable vapes will be banned in the UK starting Sunday, as the country becomes the latest to tackle the “environmental nightmare” of the single-use devices",
    "likes": 189,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T10:15:49",
    "text": "A bipartisan pair of US senators met with Ukrainian President Volodymyr Zelensky in Kyiv and urged stronger sanctions against Russia, while uncertainty swirls over whether the next round of peace talks will move ahead: cnn.it/4jq2H9O",
    "likes": 139,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T10:04:27",
    "text": "Deep below the surface of the ground in one of the driest parts of the US, there is a looming problem: The water is running out — but not the kind that fills lakes, streams and reservoirs cnn.it/4knn9tg",
    "likes": 94,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T09:43:47",
    "text": "Sen. Joni Ernst’s \"Well, we all are going to die\" remark and the GOP’s flippant defenses of Trump’s agenda | Analysis: cnn.it/43SNEAO",
    "likes": 189,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T09:18:52",
    "text": "80% of Gaza is under an evacuation order. A look at how people are being squeezed, in five maps: cnn.it/44XiGIX",
    "likes": 125,
    "reposts": 60
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T08:29:02",
    "text": "President Trump irritated that his team didn’t tell him about ‘TACO,’ sources say: cnn.it/3HfeMS1",
    "likes": 500,
    "reposts": 98
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T08:13:32",
    "text": "A budget proposal for the Department of Health and Human Services details extensive cuts to funding for the National Institutes of Health, part of an effort to consolidate the work of its 27 institutes into just eight while reducing the agency’s budget nearly 40%",
    "likes": 200,
    "reposts": 84
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T07:35:09",
    "text": "President Donald Trump’s swipes at Apple aren’t just bruising the company’s bottom line — they may also be taking a bite out of your 401(k)",
    "likes": 124,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T06:50:33",
    "text": "During a monthslong investigation, CNN infiltrates and exposes the shadowy global networks that promote an underground marketplace of cat torture videos, aimed at customers who get a kick out of seeing animals suffer. CNN’s Ivan Watson reports.\n\nRead the full story: cnn.it/4jwWcCj",
    "likes": 135,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-31T06:16:14",
    "text": "College and university leaders have been privately negotiating with a deputy to top Trump aide Stephen Miller in hopes of avoiding the same aggressive targeting of Harvard University, a person familiar with the matter says",
    "likes": 81,
    "reposts": 49
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T21:56:07",
    "text": "President Donald Trump’s directives for mass firings at multiple agencies will remain on hold, a federal appeals court ruled.",
    "likes": 328,
    "reposts": 71
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T21:31:59",
    "text": "JPMorgan Chase CEO Jamie Dimon sounded a warning on the fractious US relationship with China — and on “the enemy within.”",
    "likes": 1023,
    "reposts": 222
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T21:12:27",
    "text": "Every night after returning home from work, Chen opens his laptop and switches to his secret life as an undercover activist.\n\nHe is part of a team of internet sleuths whose mission is to shut down a shadowy global network that mutilates and kills cats for profit.",
    "likes": 89,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T20:19:36",
    "text": "A former employee of Sean “Diddy” Combs faced sharp questions on cross-examination as the hip-hop mogul’s federal racketeering and sex trafficking trial ended its third week of testimony.",
    "likes": 36,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T19:59:03",
    "text": "Zion Williamson is being sued by a woman describing herself as a former dating partner and who alleges the New Orleans Pelicans star committed repeated sexual violence against her.",
    "likes": 29,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T19:46:11",
    "text": "Secretary of Defense Pete Hegseth ordered the gutting of a Pentagon office after it disclosed it would be overseeing the testing of President Trump’s Golden Dome missile defense system and the programs associated with the multi-billion dollar project, officials familiar with the matter told CNN.",
    "likes": 152,
    "reposts": 77
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T18:52:55",
    "text": "President Donald Trump announced that he would set tariffs on steel imported into the United States at 50%, double their current rate. \n\nRead more: cnn.it/43JHi5P",
    "likes": 104,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T18:09:43",
    "text": "Starvation, destruction and hopelessness. A photojournalist's rare access to Sudan reveals the horrors of war: cnn.it/4kFnN51",
    "likes": 101,
    "reposts": 42
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T17:56:54",
    "text": "Nearly four dozen people in 18 states have been sickened in an expanding outbreak of salmonella food poisoning tied to recalled cucumbers sent to restaurants, hospitals, cruise ships and grocery stores, including Target stores, federal health officials said. cnn.it/4mFVRzE",
    "likes": 210,
    "reposts": 114
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T17:30:53",
    "text": "A key runway at Newark Liberty International Airport, which has been under construction for months causing significant delays and cancellations, will reopen on Monday.",
    "likes": 45,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T16:46:31",
    "text": "Gold and other precious metals are leaking from Earth’s core into the layers above, eventually making their way up to the surface during the formation of volcanic islands like Hawaii, a new study suggests: cnn.it/3Fj0IpY",
    "likes": 101,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T16:08:17",
    "text": "As you fall asleep each night, you can take comfort in knowing you are never truly alone — thanks to the dozens of eight-legged mites crawling out of your pores to party.",
    "likes": 81,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T14:49:33",
    "text": "Removing fluoride from public drinking water may lead to millions more cavities in US children, study estimates: cnn.it/3Fgdzcv",
    "likes": 158,
    "reposts": 53
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T14:18:42",
    "text": "Former President Joe Biden on his cancer diagnosis: \"We’re going to be able to beat this\" cnn.it/4mFG7gd",
    "likes": 247,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T14:04:21",
    "text": "Solo flyers on US flights can pay much more than those traveling as a pair, report finds: cnn.it/4dIMYBF",
    "likes": 45,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T13:45:45",
    "text": "Four eastern lowland gorillas that were once caught by wildlife traffickers are successfully integrated into a group of wild gorillas, in what is being hailed as the largest translocation of the subspecies ever",
    "likes": 220,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T13:01:30",
    "text": "Michigan Gov. Gretchen Whitmer said President Donald Trump previously told her that he wouldn’t pardon the men convicted of plotting to kidnap her in 2020, despite him telling reporters on Wednesday he would consider it: cnn.it/4kCQMX3",
    "likes": 124,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T12:23:09",
    "text": "Taylor Swift is now the proud owner of her entire catalog of music, roughly six years after she protested the sale of her master recordings by her former record label",
    "likes": 848,
    "reposts": 85
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T12:09:30",
    "text": "The State Department orders all US embassies and consulates to \"immediately begin additional vetting\" for anyone seeking a visa to travel to Harvard",
    "likes": 61,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T11:20:22",
    "text": "A top British canoeist claims he has been banned from competing in the sport because of content he posted on OnlyFans.",
    "likes": 33,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T10:47:36",
    "text": "JUST IN: Trump can suspend Biden-era program giving deportation protections to immigrants from Cuba, Haiti, Nicaragua and Venezuela, the Supreme Court says",
    "likes": 49,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T09:40:50",
    "text": "Archaeologists have discovered the remains of a nearly 3,000-year-old Mayan complex, revealing sanctuaries, pyramids and a unique canal system that could shed further light on the ancient civilization",
    "likes": 163,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T08:49:45",
    "text": "A law enforcement investigation is underway into efforts to impersonate President Donald Trump’s chief of staff, Susie Wiles, according to two sources familiar with the matter: cnn.it/45zcqY2",
    "likes": 37,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T08:20:54",
    "text": "This company says its technology can help save the world. It’s now cutting 20% of its staff as President Trump slashes climate funding: cnn.it/43QALHr",
    "likes": 100,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T06:05:36",
    "text": "British comedian and actor Russell Brand pled not guilty to multiple charges of rape and sexual assault at a court in London.",
    "likes": 45,
    "reposts": 2
  },
  {
    "username": "CNN",
    "created_at": "2025-05-30T04:42:23",
    "text": "\"Rather than set government straight, Elon Musk is leaving Washington with the federal budget all cattywampus,\" writes Zachary B. Wolf | Analysis",
    "likes": 381,
    "reposts": 104
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T22:50:18",
    "text": "Faizan Zaki nearly threw away his opportunity to go from runner-up to champion at the Scripps National Spelling Bee with a shocking moment of overconfidence. Given a second chance, he seized the title of best speller in the English language.\n\nDetails: cnn.it/4kDZSmr",
    "likes": 126,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T22:12:30",
    "text": "A New York City Police detective assigned to Mayor Eric Adams’ security detail will be questioned in relation to a bizarre crypto currency kidnapping and torture plot after he allegedly delivered the victim to his tormentors, according to multiple law enforcement officials briefed on the case.",
    "likes": 175,
    "reposts": 59
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T21:54:40",
    "text": "Academics and economists have long warned that rapidly advancing artificial intelligence will wipe out jobs and upend the global economy. Now that call is coming from inside the house. cnn.it/43RKTzK",
    "likes": 102,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T21:31:36",
    "text": "For a White House that has grown accustomed to a rollercoaster of legal rulings, judicial decisions over the past day throwing President Donald Trump’s tariff plans into question landed like a bombshell.",
    "likes": 322,
    "reposts": 52
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T21:03:15",
    "text": "A Southern elephant seal makes a surprise visit to the residential neighborhood of Gordon's Bay in Cape Town, South Africa, and triggers an almost nine-hour rescue effort to return him to the coast.",
    "likes": 7811,
    "reposts": 1481
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T20:31:58",
    "text": "What are the stakes when a fraction of a second, the length of an extended arm or the weight of a body in motion can mean the difference between victory and defeat?",
    "likes": 39,
    "reposts": 3
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T20:06:16",
    "text": "Homeland Security Secretary Kristi Noem said a migrant threatened to kill President Trump. Investigators believe he was the victim of a setup.",
    "likes": 205,
    "reposts": 73
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T19:38:27",
    "text": "The Department of Homeland Security is putting more than 500 “sanctuary jurisdictions” on notice that the Trump administration views them as obstructing immigration enforcement, as it attempts to increase pressure on communities it believes are standing in the way of the president’s agenda.",
    "likes": 179,
    "reposts": 68
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T19:04:09",
    "text": "The chief executive of one of the world’s leading artificial intelligence labs is warning that the technology could cause a dramatic spike in unemployment in the very near future. He says policymakers and corporate leaders aren’t ready for it.",
    "likes": 114,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T18:29:48",
    "text": "A federal judge said she will order Trump administration officials to not make any changes to Harvard University’s international student visa program indefinitely, delivering another legal victory for the embattled school as its commencement unfolded with an air of protest not far away.",
    "likes": 498,
    "reposts": 98
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T18:02:40",
    "text": "Starbucks is changing one of the most generous parts of its loyalty program, marking the latest effort by CEO Brian Niccol to boost profits.",
    "likes": 34,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T17:34:54",
    "text": "Once dismissed as “ugly ducklings” — too marked, too dark, or too strange — imperfect gems are now stepping into the spotlight, as high-end jewelers increasingly champion stones with unique inclusions or less-than-perfect clarity. cnn.it/43kINbC",
    "likes": 70,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T17:02:53",
    "text": "Comedian Nathan Fielder discusses his new HBO docu-comedy series \"The Rehearsal\" with CNN's Wolf Blitzer and Pamela Brown. Fielder's show explores whether miscommunication between pilots could be a hidden factor in plane crashes.",
    "likes": 85,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T16:57:47",
    "text": "The first report from the Trump administration’s Make America Healthy Again Commission, released last week, appears to be rife with errors, including some studies that don’t exist.",
    "likes": 228,
    "reposts": 92
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T16:24:49",
    "text": "Massive wildfires burning out of control in western and central Canada are forcing thousands to flee as dire forecasts for the country’s fire season come to fruition. The intensifying blazes are also beginning to send hazardous smoke toward major cities in the US.",
    "likes": 113,
    "reposts": 45
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T15:48:24",
    "text": "JUST IN: A federal appeals court has paused the ruling from the Court of International Trade that blocked President Trump's tariffs.",
    "likes": 94,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T15:22:29",
    "text": "Despite hundreds of leads and a multistate manhunt, a convicted double murderer and an experienced fugitive keep evading capture – 13 days after they escaped from a New Orleans jail.\n\nOn Thursday, officials announced reward money totaling $50,000 per fugitive for information leading to each arrest.",
    "likes": 33,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T14:36:02",
    "text": "JUST IN: Israel accepts new US proposal for a Gaza ceasefire-hostage deal, Israeli official says. Hamas says it is reviewing the proposal.",
    "likes": 64,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T14:15:05",
    "text": "JUST IN:  President Donald Trump met with Federal Reserve Chair Jerome Powell for the first time in his second term, scolding him for not lowering borrowing costs. Powell maintained that any decisions won’t be based on the president’s demands.",
    "likes": 1148,
    "reposts": 318
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T13:23:33",
    "text": "At least 70 members of the European Parliament are planning on attending this year’s Pride celebrations in Budapest, Hungary, despite the nation’s ban against LGBTQ gatherings, officials have told CNN",
    "likes": 292,
    "reposts": 62
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T12:50:24",
    "text": "A far-right political activist with a history of anti-gay rhetoric and promoting conspiracy theories about former President Barack Obama said he was fired from a senior leadership role he briefly held at the Kennedy Center — just hours after CNN reached out with questions about his past statements",
    "likes": 149,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T12:27:09",
    "text": "The prosecution has rested its case in the retrial of Karen Read for the murder of her police officer boyfriend in January 2022.",
    "likes": 36,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T11:47:20",
    "text": "BREAKING: Judge says she will issue a preliminary injunction to block Trump administration from making changes to Harvard's student visa program indefinitely",
    "likes": 615,
    "reposts": 137
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T11:35:30",
    "text": "Israel approves biggest expansion of Jewish settlements in the occupied West Bank in decades",
    "likes": 52,
    "reposts": 33
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T10:27:24",
    "text": "The Trump administration’s use of an obscure portion of immigration law to detain and attempt to deport pro-Palestinian activist Mahmoud Khalil is likely unconstitutional, according to an order issued by a federal judge in New Jersey.",
    "likes": 132,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T09:46:55",
    "text": "Trump administration reverses course, giving Harvard 30 days to challenge its bid to strip university of the ability to host international students",
    "likes": 275,
    "reposts": 84
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T08:27:16",
    "text": "After years of bidding wars and climbing home prices, the balance of power in the housing market may finally be shifting.",
    "likes": 119,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-29T06:15:01",
    "text": "The US State Department is reviewing all Harvard University-affiliated visa holders, not just students, three senior State Department officials told CNN.",
    "likes": 240,
    "reposts": 113
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T21:54:57",
    "text": "Elon Musk, who was granted special government employee status to lead the Department of Government Efficiency, has announced that his time in the Trump administration has come “to an end.”\n\nRead more: cnn.it/3ZF4517",
    "likes": 346,
    "reposts": 53
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T21:26:00",
    "text": "If you go to Japan, there's a chance you might meet someone with an unusual name – such as \"Nike,\" \"Pikachu\" or \"Pudding.\"\n\nThis practice has drawn criticism – mainly that it's confusing for hospitals, schools and authorities who don't know how to pronounce them. cnn.it/4kaW0tr",
    "likes": 88,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T21:03:31",
    "text": "The Trump administration will “aggressively revoke visas for Chinese students,” Secretary of State Marco Rubio announced in another blow to international students and higher education institutions across the United States.\n\nMore details: cnn.it/4mA4yM0",
    "likes": 99,
    "reposts": 52
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T19:50:38",
    "text": "A three-judge panel at the US Court of International Trade  ruled to stop Trump’s global tariffs that he imposed citing emergency economic powers, including his “Liberation Day” tariffs imposed on April 2.\n\nRead more: cnn.it/450qBoY",
    "likes": 883,
    "reposts": 172
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T18:33:07",
    "text": "Costa Rican authorities said they arrested 19 people accused of trafficking hundreds of predominantly Asian migrants to the United States.",
    "likes": 80,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T18:21:02",
    "text": "Hailey Bieber’s beauty brand rhode sold to budget makeup powerhouse e.l.f. Beauty for $1 billion.\n\nIt’s e.l.f.’s largest acquisition to date, eclipsing its $355 million purchase of skin care brand Naturium in 2023.\n\nRead more: cnn.it/3SqjNcM",
    "likes": 52,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T18:03:40",
    "text": "The Trump administration has cut off some American companies from selling merchandise to China, according to a US Commerce Department spokesperson. \n\nRead more: cnn.it/3SmkXG9",
    "likes": 83,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T17:21:40",
    "text": "A hungry crowd of Palestinians broke into a United Nations warehouse in central Gaza, resulting in at least two deaths and multiple injuries as famine conditions worsen in the Strip.",
    "likes": 186,
    "reposts": 84
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T17:09:36",
    "text": "Attorneys general from 16 mostly Democrat-controlled US states filed a lawsuit against the Trump administration, arguing that some of the federal government’s attempts to gut National Science Foundation research programs are illegal.",
    "likes": 224,
    "reposts": 55
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T15:37:16",
    "text": "President Donald Trump has nominated Emil Bove, one of his former personal attorneys and now a top Justice Department official, to be a federal appeals court judge",
    "likes": 48,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T14:52:59",
    "text": "Economists and top policymakers at the Federal Reserve see a growing risk of America’s job market weakening because of President Donald Trump’s erratic trade war.",
    "likes": 205,
    "reposts": 52
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T13:59:46",
    "text": "BREAKING: Trump says he'll give Putin two more weeks to see if he's serious about Ukraine peace but wouldn't say what actions he might consider to punish Russia",
    "likes": 83,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T13:15:36",
    "text": "Graduation events unfold this week at Harvard, as the university tries to thread a needle with the White House between resistance and accommodation.",
    "likes": 48,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T12:31:12",
    "text": "The United Nations expects that millions of potential jobs will vanish this year because of an economic slowdown triggered by President Donald Trump’s trade war: cnn.it/45w6vTv",
    "likes": 150,
    "reposts": 58
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T11:20:23",
    "text": "Healthy people who regularly smoked marijuana or consumed THC-laced edibles showed signs of early cardiovascular disease similar to tobacco smokers, a new small study found: cnn.it/4dFQvR2",
    "likes": 84,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T10:38:50",
    "text": "A top Kremlin aide has accused Donald Trump of being “not sufficiently informed” about the situation in Ukraine after the US president said Russian leader Vladimir Putin was “playing with fire.\"",
    "likes": 98,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T10:11:40",
    "text": "JUST IN: Israeli Prime Minister Benjamin Netanyahu says a recent airstrike killed Mohammed Sinwar, Hamas' elusive de facto leader in Gaza cnn.it/4kInyGz",
    "likes": 66,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T09:01:56",
    "text": "A French court has found a retired surgeon guilty of the rape and sexual assault of patients, some of them while under anesthetic, in a trial that has shaken France.",
    "likes": 76,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T07:39:16",
    "text": "Leaders of this city criticized Trump's immigration crackdown. Now they're taking a different approach: cnn.it/3FtOivm",
    "likes": 44,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T07:03:39",
    "text": "Companies are warning investors about the risks of becoming the next target of angry customers: cnn.it/3SnSNug",
    "likes": 111,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T06:50:13",
    "text": "Elon Musk is a longtime pusher of “extremely hardcore” work cultures. But given the scale and severity of the problems hitting Musk’s business empire all at once, an all-out effort may be appropriate. | Analysis by @amorrow.bsky.social cnn.it/4kec0L8",
    "likes": 119,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T05:51:53",
    "text": "Experts who spoke with CNN said making iPhones in the United States would upend the way Apple builds its most lucrative product.",
    "likes": 96,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-28T02:49:17",
    "text": "Elon Musk raised concerns about President Donald Trump’s sweeping tax and spending cuts package, saying in a video that he believes it would raise the US budget deficit and undercut efforts by the Department of Government Efficiency.",
    "likes": 136,
    "reposts": 43
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T22:00:36",
    "text": "The sperm of a man carrying a rare genetic mutation linked to cancer was used to conceive scores of children across Europe, prompting calls for greater regulation and a limit on the number of births allowed from a single donor.",
    "likes": 228,
    "reposts": 82
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T21:51:06",
    "text": "A federal judge struck down an executive order signed by President Donald Trump earlier this year targeting the elite law firm WilmerHale, becoming the latest jurist to permanently block enforcement of an order they concluded is unconstitutional.",
    "likes": 386,
    "reposts": 78
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T21:42:52",
    "text": "In the face of steep funding cuts for climate and weather research and forecasting, scientists have found a new way of engaging the public: livestreamed presentations.",
    "likes": 331,
    "reposts": 85
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T20:52:04",
    "text": "UPDATE: SpaceX's Starship travels farther in its latest test than the two previous flights but loses control on reentry and contact with mission control.",
    "likes": 530,
    "reposts": 100
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T20:37:03",
    "text": "The WNBA announced that its investigation could not substantiate allegations of “racist fan behavior” during a recent game between the Chicago Sky and Indiana Fever in Indianapolis earlier this month that featured Angel Reese and Caitlin Clark.\n\nRead more: cnn.it/4kyLsE5",
    "likes": 49,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T19:58:24",
    "text": "American gymnastics icon Mary Lou Retton faces a misdemeanor charge of driving under the influence following her arrest in her West Virginia hometown.",
    "likes": 61,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T19:31:36",
    "text": "SpaceX set to launch another test of the most powerful rocket ever built after two explosive mishaps earlier this year. \n\nWatch and follow live updates.",
    "likes": 42,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T18:21:48",
    "text": "Rick Derringer, a guitarist and record producer who is responsible for the hit \"Rock and Roll, Hoochie Koo,\" has died.\n\nRead more: cnn.it/4kCFNgf",
    "likes": 182,
    "reposts": 33
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T17:42:12",
    "text": "President Donald Trump has signed full pardons for imprisoned reality show couple Todd and Julie Chrisley, who were sentenced to lengthy prison terms in 2022 for a conspiracy to defraud banks out of more than $30 million, according to a White House official. \n\nRead more: cnn.it/45rCXX8",
    "likes": 213,
    "reposts": 129
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T17:37:18",
    "text": "Republican Sen. Tommy Tuberville announced he is running for governor of Alabama in 2026, as the former college football coach and staunch President Donald Trump ally eyes a new role outside Washington after a single term in office.",
    "likes": 70,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T17:14:06",
    "text": "A quick shove. A split-second clip that would have dominated US news for days aired in France for just 24 hours and then it was gone.",
    "likes": 76,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T16:48:29",
    "text": "President Trump has asked the Supreme Court to make it easier to deport people to South Sudan and other countries that are not their homeland.",
    "likes": 79,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T16:33:13",
    "text": "Three tombs dating back thousands of years have been unearthed in an ancient Egyptian burial complex.\n\nRead more: cnn.it/43KaWsF",
    "likes": 236,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T15:45:09",
    "text": "President Donald Trump stunned European officials and caught some of his own senior advisers off guard with his snap decision to reignite his market-rattling trade war with the European Union.",
    "likes": 102,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T15:33:22",
    "text": "What scientists understand about the voracious feeding habits of the colossal megalodon could be up for some revision.\n\nDetails: cnn.it/3Hfzf9i",
    "likes": 63,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T14:45:32",
    "text": "The European Commission has launched an investigation into four major adult websites, accusing them of not complying with regulations that protect minors from accessing pornography. \n\nRead more: cnn.it/3HdO8ZG",
    "likes": 103,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T14:37:33",
    "text": "A second suspect surrendered to police in the harrowing case of a cryptocurrency trader who was allegedly kidnapped, tortured and held hostage in a Manhattan apartment for several weeks.",
    "likes": 70,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T13:57:51",
    "text": "Two escapees from the New Orleans jailbreak remain on the run, prompting an intensified search nationwide. One is no stranger to breakouts, the other is a convicted killer.",
    "likes": 43,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T11:08:51",
    "text": "RFK Jr. says Covid-19 shots will be removed from the CDC's list of recommended vaccines for healthy kids and pregnant women",
    "likes": 69,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T10:41:48",
    "text": "It’s been a little while since Americans had an inkling of optimism about the economy. cnn.it/4kFIwFT",
    "likes": 44,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T10:08:17",
    "text": "The Supreme Court on Tuesday declined to hear an appeal from a Massachusetts middle school student who was forced to remove a T-shirt that claimed “there are only two genders.”",
    "likes": 91,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T09:28:36",
    "text": "National Public Radio filed a First Amendment lawsuit against the Trump administration on Tuesday, alleging that President Trump’s attempt to defund NPR is a “clear violation of the Constitution.”",
    "likes": 429,
    "reposts": 88
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T08:43:41",
    "text": "Rinse, repeat.\n\nStock futures rose Tuesday after President Donald Trump did a 180-degree turn on his threat to place a massive 50% tariff on goods imported from the European Union.",
    "likes": 137,
    "reposts": 33
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T07:53:17",
    "text": "The Trump administration is poised to direct federal agencies to cancel their contracts with Harvard University, two senior Trump administration officials said, the latest barb against the school as it refuses to bend to the White House’s barrage of policy demands rooted in political ideology.",
    "likes": 129,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T06:27:05",
    "text": "The bucolic, vineyard-dotted Eastern Townships region of southern Quebec has a message for Americans: come hug it out.",
    "likes": 129,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T02:26:43",
    "text": "A former small-town police chief in Arkansas escaped from prison Sunday while serving decades-long prison sentences for murder and rape and is still on the loose, officials said.\n\nHere's what we know.",
    "likes": 115,
    "reposts": 52
  },
  {
    "username": "CNN",
    "created_at": "2025-05-27T01:20:10",
    "text": "Taking place on Memorial Day, the American Music Awards partnered with the Easy Day Foundation, which supports veterans who are transitioning to civilian life after the military. \n\nHere are the winners.",
    "likes": 68,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T22:01:53",
    "text": "President Donald Trump again trained his ire on Harvard University, accusing the school of “judge shopping” during its legal battle with the administration and threatening to cut off $3 billion in federal grant funding over the university’s handling of anti-Israel protests.",
    "likes": 135,
    "reposts": 42
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T21:30:58",
    "text": "When jolted awake by the blare of an alarm clock, it’s tempting to reach for the snooze button to catch a bit more shut-eye. And what’s the harm?\n\nThere’s increasing debate about your snoozing habit, and whether or not it’s silently sabotaging your morning. cnn.it/4jvVVzy",
    "likes": 63,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T20:46:54",
    "text": "JUST IN: Two more inmates who escaped from a New Orleans jail have been captured, Louisiana state police said, leaving two escapees on the run",
    "likes": 95,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T20:25:11",
    "text": "JUST IN: A sixth inmate who broke out of jail in New Orleans 10 days ago has been captured, authorities said. Four escapees remain on the run.",
    "likes": 82,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T20:12:05",
    "text": "A home security camera caught the moment when a box truck driving through a residential neighborhood exploded in Addison, Illinois. The driver walked away with only minor injuries, CNN affiliate WLS reports.",
    "likes": 365,
    "reposts": 65
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T19:29:45",
    "text": "JUST IN: Dozens of people, including children, were injured in the Liverpool parade incident, which police believe was an isolated event and not terrorism.",
    "likes": 82,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T18:43:58",
    "text": "President Donald Trump announced he is granting a “full and unconditional pardon” to a former Virginia sheriff, Scott Jenkins, who was convicted of conspiracy, honest services fraud and bribery.",
    "likes": 234,
    "reposts": 124
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T17:34:07",
    "text": "\"This is the sixth time this term that Trump, who consistently says he has a strong relationship with Putin, has publicly expressed impatience or downright annoyance with the Kremlin boss.\" | Analysis by Matthew Chance",
    "likes": 339,
    "reposts": 55
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T16:40:39",
    "text": "Hong Kong-based cross-media artist Victor Wong's creation, AI Gemini, is an AI-driven robot that creates traditional Chinese landscape paintings — the “first-ever artificial intelligence ink artist in the world,” according to 3812 Gallery, which represents Wong. cnn.it/43du0iQ",
    "likes": 51,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T15:27:53",
    "text": "Indiana Fever star Caitlin Clark has been ruled out for at least two weeks after suffering a left quadriceps strain, the team announced.",
    "likes": 64,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T14:37:25",
    "text": "JUST IN: A man has been detained after a car collided with Liverpool fans during the soccer club's Premier League trophy parade, UK police say.",
    "likes": 76,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T14:01:01",
    "text": "Ten people were shot and at least one other person was injured when a holiday weekend gathering at a charter boat in a South Carolina coastal community turned violent, according to police. cnn.it/4kfE6FY",
    "likes": 51,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T13:56:23",
    "text": "The EPA is drafting a proposed regulation that would end all federal limits on planet-warming pollution generated by coal and gas-fired power plants.",
    "likes": 105,
    "reposts": 53
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T13:38:37",
    "text": "American Taylor Fritz suffered a surprise first-round defeat against Germany’s Daniel Altmaier at the French Open.",
    "likes": 47,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T12:51:05",
    "text": "US special envoy Steve Witkoff says a temporary Gaza ceasefire deal is currently on the table with a pathway to end the war and urges Hamas to accept.",
    "likes": 64,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T11:48:45",
    "text": "Charles B. Rangel, the former New York lawmaker whose trailblazing career saw the high school dropout represent Harlem for four decades in Congress, died on Monday. He was 94. cnn.it/4kdvm3e",
    "likes": 213,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T11:27:13",
    "text": "Dozens of NIH staffers walked out of a town hall at the biomedical research agency’s headquarters last week.",
    "likes": 193,
    "reposts": 59
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T10:36:17",
    "text": "In a Memorial Day post to his Truth Social platform, President Donald Trump marked the solemn occasion honoring America’s war dead by blasting his political opponents and perceived enemies.",
    "likes": 156,
    "reposts": 47
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T09:24:31",
    "text": "The Trump administration is trying to purge DEI efforts from the US military. But many of America’s biggest military blunders occurred because there wasn’t enough diversity in the armed forces.",
    "likes": 184,
    "reposts": 56
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T08:14:46",
    "text": "Current and former federal employees are struggling to get their workplace benefits amid President Donald Trump’s chaotic efforts to reduce the size of the US government.",
    "likes": 178,
    "reposts": 76
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T07:50:13",
    "text": "Firefighters in Germany had to use hydraulic equipment to free a man who got stuck under a train armrest while searching for a dropped AirPod.",
    "likes": 86,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T06:42:15",
    "text": "As authorities in Louisiana continue their hunt for five of the 10 inmates who broke out of a New Orleans jail this month, seven people have been charged with helping the escapees, both from inside jail and once they were at large.",
    "likes": 51,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T06:30:07",
    "text": "She left Germany for the United States in the late seventies, and built a wonderful life in California, but nearly four decades later, Camilla Delsid decided to return to her home country. However, she’s far from happy about it.",
    "likes": 57,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T06:02:32",
    "text": "French President Emmanuel Macron’s office moved swiftly to defuse attention around a viral video showing his wife Brigitte pushing his face away as they deplaned in Vietnam for the first leg of a Southeast Asia tour.",
    "likes": 45,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T04:09:08",
    "text": "Memorial Day marks the unofficial start to summer, but this year, it may also kick off a season of higher prices.",
    "likes": 63,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T03:23:42",
    "text": "Gas prices are sharply lower compared with this time last year.",
    "likes": 38,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-26T01:54:23",
    "text": "Phil Robertson, outdoorsman, businessman and patriarch of the family featured on the A&E reality show “Duck Dynasty,” has died, his family said in a statement. He was 79. cnn.it/4k8POSx",
    "likes": 70,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T22:02:28",
    "text": "For the first time since 1933, the United States men’s hockey team has won the IIHF World Championship tournament.\n\nTeam USA defeated Switzerland 1-0 in overtime at Avicii Arena in Stockholm, Sweden, to win the gold medal. cnn.it/4khU3vs",
    "likes": 688,
    "reposts": 71
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T21:41:11",
    "text": "An American man was arrested after allegedly plotting to throw Molotov cocktails at a branch office of the US embassy in Israel, according to the US Justice Department.",
    "likes": 59,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T21:22:22",
    "text": "Venezuelans on Sunday for the first time elected a governor and other lawmakers for Essequibo, an oil-rich region that Venezuela has laid claim to even though it is widely recognized as being part of neighboring Guyana.",
    "likes": 71,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T20:44:52",
    "text": "“The Greatest Spectacle in Racing” certainly lived up to its name after Álex Palou took the checkered flag to win the 109th running of the Indianapolis 500 on Sunday. cnn.it/3Sl73UB",
    "likes": 96,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T19:55:27",
    "text": "President Donald Trump said he doesn’t know “what the hell happened” to Russian President Vladimir Putin and that he is “not happy with what Putin is doing” after Moscow launched its largest aerial attack of its three-year war on Ukraine overnight.",
    "likes": 155,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T18:54:07",
    "text": "President Donald Trump said that he has agreed to give the European Union an extension until July 9 on tariffs, after a “very nice call” from European Commission President Ursula von der Leyen.",
    "likes": 117,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T18:05:08",
    "text": "Nearly 45,000 people suffered a power outage in and around Nice, southern France on Sunday, after an electrical transformer was set on fire overnight, according to the city’s mayor.",
    "likes": 81,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T17:04:49",
    "text": "On a remote, crescent-shaped island surrounded by crystal clear ocean live some of the most plastic-contaminated birds in the world. Scientists say the crisis is getting worse. cnn.it/4dxUEpZ",
    "likes": 439,
    "reposts": 171
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T16:06:16",
    "text": "Being an honest public servant will always be a rewarding choice, Federal Reserve Chair Jerome Powell said in a speech at a pre-graduation ceremony at Princeton University amid months of unrelenting personal attacks from President Donald Trump.",
    "likes": 496,
    "reposts": 91
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T15:07:27",
    "text": "President Trump is calling for a \"baby boom,\" but IVF may be under threat: cnn.it/4k9w8xU",
    "likes": 94,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T14:59:38",
    "text": "Hunting and conflict with fishermen brought the Mediterranean monk seal to the brink of extinction. But now, thanks to conservation efforts and legal protections, it’s making a comeback: cnn.it/4dui9jQ",
    "likes": 123,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T14:11:26",
    "text": "After a slow start to 2025, the Hollywood box office has pulled off a “Stitchpossible” comeback buoyed by a huge holiday weekend cnn.it/4dB4uYv",
    "likes": 63,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T13:48:44",
    "text": "As Trump aims to expand presidential authority, can anyone stop him? | Analysis: cnn.it/43LA0PZ",
    "likes": 96,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T13:18:20",
    "text": "Georgia man who fled with live-in nanny after his wife’s killing is charged with murder 19 years later: cnn.it/4ktz8Fe",
    "likes": 90,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T12:52:49",
    "text": "Even if consumers don’t know if they’re actually suffering from a lack of fluids, they’re still buying electrolyte-filled products like they are.\n\nHow America’s obsession with staying hydrated became a $1.5 billion business: cnn.it/4jlAvoG",
    "likes": 80,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T12:25:01",
    "text": "A new study may have uncovered exactly what makes orange cats special: cnn.it/3FaYuJc",
    "likes": 220,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T11:51:00",
    "text": "US \"silence\" encouraging Putin, says Zelensky, after Russia launches record air assault: cnn.it/4mBeFAo",
    "likes": 204,
    "reposts": 66
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T10:53:01",
    "text": "Anglo-Saxons buried a mysterious vessel over a millennium ago. Archaeologists discovered its contents: cnn.it/3SPAEFN",
    "likes": 97,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T10:09:06",
    "text": "A cryptocurrency investor is accused of kidnapping a man and keeping him locked up for weeks in an upscale Manhattan apartment. Authorities say the man was beaten, shocked and led to believe that his family was in danger if he didn’t give up his Bitcoin password.",
    "likes": 129,
    "reposts": 50
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T09:43:17",
    "text": "What happens to America’s 114 billion pennies once the US stops making them? cnn.it/44TQqa3",
    "likes": 73,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T09:17:41",
    "text": "Why Wall Street views Scott Bessent as their best hope to moderate President Trump’s most hawkish trade and economic gut instincts: cnn.it/3SkGe2P",
    "likes": 53,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T08:50:55",
    "text": "A record number of Americans applied for British citizenship between January and March, according to the first set of data covering the start of Donald Trump’s second presidential term: cnn.it/4jCo9st",
    "likes": 441,
    "reposts": 117
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T08:17:41",
    "text": "A Black 18-year-old college student was lynched on a playground 95 years ago. His nephew just accepted his posthumous degree: cnn.it/4k5wFB7",
    "likes": 688,
    "reposts": 97
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T07:24:08",
    "text": "At least 12 people were killed overnight in Russia's largest aerial bombardment on Ukraine, even as the two sides swapped hundreds of prisoners: cnn.it/3ZvN9tY",
    "likes": 100,
    "reposts": 48
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T06:53:03",
    "text": "\"It only missed by a few meters\": A man managed to sleep through an enormous container ship running aground on his front lawn cnn.it/3ST0pFg",
    "likes": 208,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-25T06:01:20",
    "text": "The 10 inmates who broke out of a New Orleans jail in a stunning overnight escape last week used electric hair trimmers with multiple clipper blades to help cut their way through the cell walls, a source with direct knowledge of the investigation told CNN: cnn.it/4jep95D",
    "likes": 77,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T21:28:39",
    "text": "A woman in Texas is suing the state’s Lottery Commission for not paying out an $83.5 million award, more than three months after the numbers on her ticket matched the winning numbers in a drawing, according to court documents obtained by CNN",
    "likes": 312,
    "reposts": 59
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T17:40:18",
    "text": "The awards recognized plenty of films that debuted toward the tail end of the program in what turned out to be a starry but lopsided year in terms of critical acclaim.",
    "likes": 55,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T16:56:50",
    "text": "Operation Benjamin works with the American Battle Monuments Commission to help find Jewish soldiers who were buried in American military cemeteries around the world under Latin crosses and correct those inadvertent errors by replacing their headstones with a Star of David.",
    "likes": 184,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T14:53:09",
    "text": "An estimated 4,000 fatal unintentional drownings happen every year in the United States — an average of 11 drowning deaths per day — according to the Centers for Disease Control and Prevention.",
    "likes": 100,
    "reposts": 43
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T13:52:47",
    "text": "In its quieter moments, the public art acted as a beacon, calling on Americans – together – to mourn, celebrate, argue, strategize and reflect on the ongoing fight against racism in the United States and the nation’s commitment to equality.",
    "likes": 120,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T12:28:32",
    "text": "Many retailers have issued warnings that they won’t, as Trump has suggested, “eat” the additional costs caused by those import taxes. That means anything from groceries and clothing to toys and cars could cost Americans more. cnn.it/3ShEE1R",
    "likes": 483,
    "reposts": 153
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T11:28:35",
    "text": "Their patience has worn thin over Israel’s decision to expand the war and, in the words of one Israeli minister, “conquer” the territory – a move paired with plans to forcibly displace Gaza’s entire population to the south and block all humanitarian aid for 11 weeks.",
    "likes": 127,
    "reposts": 38
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T10:19:40",
    "text": "Social media platform X, formerly known as Twitter, has been inaccessible for thousands of US users early Saturday, according to Downdetector.com",
    "likes": 475,
    "reposts": 80
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T10:18:07",
    "text": "Infection-causing fungi responsible for millions of deaths a year will spread significantly to new regions as the planet heats up, new research predicts",
    "likes": 228,
    "reposts": 88
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T08:59:30",
    "text": "Popular Mexican singer Julión Álvarez says he and his band had to cancel a show in Texas after the singer’s visa to enter the United States had been allegedly revoked.",
    "likes": 242,
    "reposts": 87
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T08:04:46",
    "text": "Ukraine’s capital of Kyiv came under a large-scale Russian drone and missile attack overnight, just hours after Russia and Ukraine began a major prisoner exchange: cnn.it/45mj6Zp",
    "likes": 101,
    "reposts": 42
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T07:15:08",
    "text": "Senate Democrats have threatened to not move forward with confirmations of President Donald Trump’s US attorney nominees around the country – already following through with a hold on one of his picks: cnn.it/4dxIEVI",
    "likes": 300,
    "reposts": 59
  },
  {
    "username": "CNN",
    "created_at": "2025-05-24T06:12:03",
    "text": "The Trump administration has been ordered to facilitate the return of a Guatemalan man who was wrongly deported to Mexico in February, after he told authorities about his fears of violence and torture across the border: cnn.it/3ZzQA2K",
    "likes": 244,
    "reposts": 52
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T21:10:28",
    "text": "The Department of Justice said that it struck a deal with aircraft maker Boeing to avoid prosecution of the company over two fatal crashes of the 737 Max, according to a court filing in the case.",
    "likes": 95,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T18:45:38",
    "text": "At least twelve people were injured in a hot air balloon crash near an archaeological site near Mexico City, local authorities said.\n\nRead more: cnn.it/3SgTqpB",
    "likes": 66,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T17:46:38",
    "text": "Qaadir and Naazir Lewis, 19-year-old identical twins, were found fatally shot at the remote summit of a Georgia mountain. The mystery has baffled their family for months, but police now say they know what happened.",
    "likes": 44,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T17:25:57",
    "text": "The Trump administration has put multiple National Security Council staffers on administrative leave, sources say.",
    "likes": 377,
    "reposts": 96
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T17:00:29",
    "text": "International Harvard students say they are experiencing “pure panic” amid the Trump administration’s move to bar foreign enrollment.",
    "likes": 399,
    "reposts": 103
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T16:18:10",
    "text": "President Donald Trump announced a partnership between U.S. Steel and Japanese steelmaker Nippon that he says will keep the headquarters in Pittsburgh and draw $14 billion in investment toward the US economy.",
    "likes": 47,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T16:02:58",
    "text": "Chief Justice John Roberts on Friday temporarily paused action in an emergency appeal over whether the Department of Government Efficiency must turn over public documents – like other government agencies – or whether it is shielded from such requests because it is part of the White House.",
    "likes": 61,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T15:19:07",
    "text": "President Donald Trump showed an image alleging the murder of White farmers in South Africa, but it was actually an image from the Democratic Republic of Congo, according to Reuters.",
    "likes": 419,
    "reposts": 125
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T15:17:14",
    "text": "Several people were injured in a knife attack at Hamburg's Central Station. A suspect has been arrested, police say.",
    "likes": 38,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T14:40:42",
    "text": "The ringleader of a plot to tie up and rob Kim Kardashian has been found guilty by a Paris court. cnn.it/4dFE47W",
    "likes": 47,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T14:08:53",
    "text": "Labubu, a palm-sized plush toy with sharp teeth and a cult following, has become a toy too popular to sell.",
    "likes": 35,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T13:34:25",
    "text": "Billy Joel announced he's canceling all of his scheduled concerts after recently being diagnosed with a neurological condition cnn.it/4kcdvJU",
    "likes": 183,
    "reposts": 44
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T12:57:30",
    "text": "Millions of low-income Americans, including families with children, could lose their food stamp benefits under House Republicans’ newly passed tax and spending cuts package, according to a new analysis.",
    "likes": 128,
    "reposts": 58
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T12:04:56",
    "text": "A federal judge has halted the Trump administration's ban on Harvard's ability to enroll international students",
    "likes": 354,
    "reposts": 68
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T11:42:21",
    "text": "The Trump administration is giving businesses a free pass from a wide variety of enforcement actions.",
    "likes": 101,
    "reposts": 50
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T11:16:09",
    "text": "President Donald Trump on Friday demanded Apple make its iPhones in the United States or face a 25% tariff. \n\nUS-made iPhones will likely cost more than three times their current price, analysts say.",
    "likes": 205,
    "reposts": 68
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T10:16:11",
    "text": "More than 200 wealthy crypto bros gathered for a black-tie dinner at President Donald Trump’s golf club just outside Washington, DC – a special reward for the top holders of the president’s personal $TRUMP meme coin.",
    "likes": 76,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T08:35:19",
    "text": "BREAKING: Harvard University is suing the Trump administration to halt the federal ban on the school enrolling international students",
    "likes": 691,
    "reposts": 111
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T08:34:42",
    "text": "BREAKING: President Trump threatens a 50% tariff on goods from the European Union cnn.it/3H6Ambb",
    "likes": 72,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T08:00:19",
    "text": "President Trump is demanding Apple make its iPhones in the United States or face a 25% tariff",
    "likes": 118,
    "reposts": 52
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T07:20:52",
    "text": "She grew up on the fringes of America’s worst-ever school shootings. Then one happened 100 yards away.",
    "likes": 50,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T06:16:11",
    "text": "A US federal indictment accuses a Russian man of leading a global cybercrime ring that caused hundreds of millions of dollars in damage to victims around the world: cnn.it/4jdIGTJ",
    "likes": 116,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-23T03:31:39",
    "text": "The Trump administration alleged Thursday that Columbia University violated federal civil rights law by acting with “deliberate indifference” towards harassment of Jewish students on campus since October 2023.",
    "likes": 58,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T21:50:49",
    "text": "When entrepreneur and Reddit co-founder Alexis Ohanian started to think about investing in women’s soccer, opposition to the idea came from an unlikely source: his wife, tennis legend Serena Williams.",
    "likes": 65,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T20:43:32",
    "text": "Wildlife rangers are being killed at a rate of nearly two a week, and it’s a toll Prince William has said the world can no longer ignore.",
    "likes": 198,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T20:25:05",
    "text": "Distinct clawed footprints found on a slab of 356 million-year-old rock from Australia suggest that reptile relatives appeared between 35 million and 40 million years earlier than previously believed.",
    "likes": 106,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T20:13:00",
    "text": "Writings linked to suspect accused of killing Israeli Embassy staffers in DC discuss \"armed action\" as a form of protest",
    "likes": 55,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T20:07:59",
    "text": "Italian police say they chased down a German tourist after spotting him transporting an ancient Roman artifact on a rented e-scooter.",
    "likes": 110,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T19:43:17",
    "text": "Gentle parenting is all over social media, but there is a lot of confusion about what it actually means. Experts explain how it balances warmth and structure. cnn.it/4jdRWY0",
    "likes": 43,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T19:28:42",
    "text": "Kid Cudi says his Porsche was torched after Combs learned he was dating Cassie Ventura.\n\nHere are the takeaways from today's testimonies.",
    "likes": 58,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T19:05:57",
    "text": "Artificial intelligence startup Anthropic says its new AI model can work for nearly seven hours in a row, in another sign that AI could soon handle full shifts of work now done by humans. cnn.it/4dtvfOt",
    "likes": 37,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T18:55:09",
    "text": "The Trump administration’s decision to revoke Harvard University’s ability to enroll international students raises significant questions about the impact on the school community and its academic research.",
    "likes": 104,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T18:44:32",
    "text": "US President Donald Trump showed a screenshot of Reuters video taken in the Democratic Republic of Congo as part of what he falsely presented on Wednesday as evidence of mass killings of white South Africans.",
    "likes": 1392,
    "reposts": 442
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T18:02:23",
    "text": "They hailed from different parts of the world, but their paths led them both to pursue careers in diplomacy and to the Israeli embassy in Washington, DC.\n\nTheir love story was tragically cut short when a gunman fatally shot the couple as they were leaving an event at the Capital Jewish Museum.",
    "likes": 81,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T17:52:55",
    "text": "Clownfish, a small orange and white species made famous by the “Finding Nemo” movies, have been found to shrink in order to boost their chances of surviving marine heat waves, according to a new study. cnn.it/4kpX24q",
    "likes": 137,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T17:36:02",
    "text": "A federal judge has blocked the Trump administration from terminating the legal status that allows foreign students to study at colleges and universities in the US.",
    "likes": 300,
    "reposts": 56
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T17:02:59",
    "text": "The Supreme Court said President Donald Trump doesn't have to rehire senior officials he fired from two independent federal labor agencies that enforce worker protections, while the officials continue fighting in court to reverse their terminations.",
    "likes": 55,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T16:54:54",
    "text": "JUST IN: The man accused of killing two Israeli Embassy staffers in Washington, DC, has been charged with murder",
    "likes": 64,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T16:53:56",
    "text": "Nike is returning to Amazon after an absence of more than five years and hiking prices on some products as its new CEO works to reverse a revenue slump. cnn.it/3Fpml7T",
    "likes": 49,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T16:11:54",
    "text": "Directives from Trump and Pete Hegseth set off a sweeping effort in recent months to scour course offerings and syllabuses, cancelling two classes, cutting some readings and reviewing books for possible removal from the library as well as cancelling clubs for students of color and women.",
    "likes": 63,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T15:51:45",
    "text": "Eight migrant detainees who were on a US flight destined for South Sudan are currently at a US military base in Djibouti, awaiting next steps as details over their case are hammered out in court, two US officials told CNN.",
    "likes": 76,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T15:29:11",
    "text": "Growing concern about the national debt impacted home borrowing rates this week.\n\nMortgage rates track the benchmark 10-year Treasury yield, which climbed higher as bonds sold off after US federal debt was downgraded from a perfect rating by Moody’s Ratings on Friday. cnn.it/3Shn6Tn",
    "likes": 61,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T15:18:33",
    "text": "The British government will roll out the use of medication to suppress the sex drive of sex offenders, as part of a package of measures to reduce the risk of reoffending and alleviate the pressures on the prison system, which is running out of space.",
    "likes": 137,
    "reposts": 38
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T14:35:41",
    "text": "The Trump administration on Thursday revoked Harvard University’s ability to enroll international students, marking a sharp escalation in the ongoing back-and-forth between the White House and the university. cnn.it/4kqKTNj",
    "likes": 100,
    "reposts": 40
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T13:36:50",
    "text": "At the heart of the situation is the fact that air traffic control over Newark was transferred to a facility in Philadelphia last July, leaving controllers more than 100 miles away to rely on data flowing through telecom lines to stay connected to what’s happening in Newark’s airspace.",
    "likes": 111,
    "reposts": 43
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T13:07:10",
    "text": "Ultraprocessed foods, toxins and poor diet are contributing to a rise in chronic illnesses, particularly among children, MAHA health report finds. cnn.it/4mro4dy",
    "likes": 203,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T12:30:30",
    "text": "A federal judge on Thursday blocked President Donald Trump’s executive order to shut down the Education Department and ordered the agency to reinstate employees who were fired in mass layoffs. cnn.it/4k1Xgio",
    "likes": 353,
    "reposts": 72
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T12:05:45",
    "text": "Staring down another above-average hurricane season, America’s weather forecasting and disaster response agencies are more hollowed out than ever before – and that could leave tens of millions of Americans more vulnerable to these massive storms. cnn.it/3ZpQESz",
    "likes": 85,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T11:27:13",
    "text": "Multiple people onboard a business jet that crashed into a San Diego neighborhood that houses military families are dead, authorities say.",
    "likes": 136,
    "reposts": 66
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T11:23:02",
    "text": "Here’s a visual timeline of how 10 inmates used strategic planning, bad infrastructure and sheer luck to escape a jail in the heart of New Orleans. cnn.it/4dtDny8",
    "likes": 32,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T11:03:11",
    "text": "Treasury Department will phase out production of pennies and will soon stop putting new one-cent coins into circulation. cnn.it/4kAGxmq",
    "likes": 75,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T10:31:12",
    "text": "Supreme Court leaves in place a ruling to block the nation's first religious charter school. Justice Amy Coney Barrett recused herself from the case.",
    "likes": 164,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T09:08:54",
    "text": "Small plane crashes in a San Diego neighborhood, setting homes and cars on fire",
    "likes": 138,
    "reposts": 56
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T06:59:42",
    "text": "BREAKING: The House passes Trump's domestic policy bill after GOP leaders win over holdouts. It next goes to the Senate.",
    "likes": 35,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T06:12:19",
    "text": "Air traffic controllers say recent issues at Newark Liberty International Airport are rooted in a plan from Trump’s first term: cnn.it/3HjVWsB",
    "likes": 298,
    "reposts": 108
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T05:52:15",
    "text": "The plaintiffs, all over the age of 40, claim that they submitted hundreds of job applications through Workday and were rejected each time — sometimes within minutes or hours. They blame Workday's algorithm.",
    "likes": 142,
    "reposts": 48
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T05:49:07",
    "text": "North Korea’s newest warship was severely damaged during a launch ceremony, with leader Kim Jong Un, who witnessed the accident, saying it brought shame to the nation’s prestige and vowing to punish those found responsible, state media reported",
    "likes": 111,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T05:35:05",
    "text": "The decidedly unsexy bond market is usually pretty quiet. But when they want to, bond investors can send a loud, clear message to Washington. They did just that Thursday.",
    "likes": 1043,
    "reposts": 302
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T04:46:51",
    "text": "Todd Harder voted for Donald Trump and knows firsthand his community would benefit if the president can deliver on his promise of a quick American manufacturing renaissance.\n\nBut Harder doesn’t believe he will ever see it. cnn.it/4mnINz3",
    "likes": 66,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-22T00:23:02",
    "text": "Two staff members at the Israeli Embassy in Washington, DC, were killed Wednesday night near the Capital Jewish Museum, Secretary of Homeland Security Kristi Noem said.",
    "likes": 81,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T22:35:08",
    "text": "US and European authorities announced a major crackdown on a prolific hacking tool that has been used by hundreds of hackers in damaging ransomware attacks, bank thefts and other digital crimes.",
    "likes": 89,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T21:46:44",
    "text": "A 24-year-old man was arrested for allegedly forging documents to enroll in an Ohio high school, where he studied for over a year before the identity fraud was discovered, authorities said.",
    "likes": 35,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T21:14:52",
    "text": "Foreign nationals with $5 million to spare will soon be able to register for a new “gold card” visa that would give them the right to live and work permanently in the United States, Commerce Secretary Howard Lutnick said.",
    "likes": 97,
    "reposts": 71
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T20:24:39",
    "text": "JUST IN: Indianapolis Colts owner and CEO Jim Irsay has died at the age of 65, the team announced. cnn.it/439YHWf",
    "likes": 63,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T20:10:32",
    "text": "A federal agent, an expert on abuse trauma and a former executive assistant testified Wednesday in Sean “Diddy” Combs’ federal racketeering and sex trafficking trial.",
    "likes": 40,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T19:36:10",
    "text": "Moments before President Trump escorted his South African counterpart into the Oval Office, White House aides could be seen wheeling two large-screen televisions down the driveway and into the West Wing.\n\nLittle could have prepared President Cyril Ramaphosa for what he was about to see.",
    "likes": 155,
    "reposts": 45
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T18:55:06",
    "text": "The sensitive interior of human teeth might have originated from a seemingly unlikely place: sensory tissue in fish that were swimming in Earth’s oceans 465 million years ago. cnn.it/4doNuEq",
    "likes": 98,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T18:21:23",
    "text": "Secretary of Defense Pete Hegseth hosted a Christian prayer service at the Pentagon for employees that included a sermon by his hometown pastor who said President Donald Trump had been “sovereignly appointed.”\n\nHegseth told the audience that the service would be a monthly event.",
    "likes": 169,
    "reposts": 70
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T17:50:07",
    "text": "Tottenham Hotspur defeated Manchester United 1-0 to win the Europa League final in Bilbao, Spain.\n\nThe victory secured Spurs its first cup title in 17 years. cnn.it/4k2PtRn",
    "likes": 275,
    "reposts": 40
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T17:19:45",
    "text": "Armed men hijacked a tourist boat in the Amazon rainforest in Peru, robbed all 14 people on board and forced them to empty their bank accounts via mobile apps, according to one of the victims.",
    "likes": 84,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T16:47:40",
    "text": "Donald Trump Jr. teased a future run for the presidency during an appearance at the Qatar Economic Forum, saying “that calling is there” when asked if he would “consider picking up the reins” and “run for office” when his father, President Donald Trump, leaves the White House.",
    "likes": 59,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T16:13:19",
    "text": "JUST IN: US stocks, bonds and the dollar fell on Wednesday as concerns mount about the premier status of American assets. cnn.it/44NJCuE",
    "likes": 647,
    "reposts": 181
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T15:37:35",
    "text": "The Italian government has this week enacted a law that makes it impossible for anyone to get Italian citizenship through their great-grandparents, dashing the hopes of those who have already paid money to start the process. cnn.it/3YUk4Z5",
    "likes": 88,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T14:58:01",
    "text": "As President Donald Trump works to muscle his sweeping tax and spending cuts package through Congress, a network of conservative groups has undertaken a multimillion-dollar advertising blitz to spread his message to voters and pressure recalcitrant lawmakers to get in line.",
    "likes": 57,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T14:23:37",
    "text": "JUST IN: The Trump administration \"unquestionably\" violated a court order with a possible deportation flight to South Sudan, a federal judge has ruled.",
    "likes": 362,
    "reposts": 121
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T14:23:29",
    "text": "Amid growing concerns within the Federal Emergency Management Agency that internal turmoil has left it unprepared for the fast-approaching hurricane season, the agency is taking significant steps to bolster its disaster response workforce and training infrastructure.",
    "likes": 81,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T13:48:05",
    "text": "The Pentagon has accepted a Boeing 747 jet from Qatar to be used by President Trump after the aircraft is modified to include \"proper security measures.\" cnn.it/4jdcsrG",
    "likes": 98,
    "reposts": 43
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T13:19:03",
    "text": "President Trump pushes unsubstantiated claims of \"White genocide\" in South Africa during tense White House meeting with the nation's president. cnn.it/3F5w6bo",
    "likes": 128,
    "reposts": 43
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T13:06:26",
    "text": "Years before recent communications blackouts led to widespread chaos at Newark Liberty International Airport, air traffic controllers and pilots around the country repeatedly reported equipment failures that left them scrambling to avoid mid-air collisions and other catastrophes. cnn.it/3YTZXdo",
    "likes": 72,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T12:33:54",
    "text": "The controversial “tush push” play will not be banned for the upcoming NFL season, according to multiple reporters covering the owners’ meeting in Minnesota. cnn.it/4k90G35",
    "likes": 49,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T11:57:55",
    "text": "Ties between both nations have been fraught since Trump froze aid to South Africa in February over claims it was mistreating its minority White population.",
    "likes": 45,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T11:29:47",
    "text": "In total, African countries lost 60 million euros in rejected visa fees in 2024, analysis from the LAGO Collective shows.\n\nAfricans have long complained about inconsistent, sometimes baffling decisions about who gets approved or denied while applying for European visas.",
    "likes": 42,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T10:46:06",
    "text": "The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.",
    "likes": 88,
    "reposts": 58
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T10:22:21",
    "text": "FDA crackdown on off-brand Ozempic products set to take effect, threatening supply and access for many: cnn.it/3Fc29GD",
    "likes": 68,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T09:46:53",
    "text": "The Trump administration cut funding for flood prevention projects in blue states across the country while creating new water construction opportunities in red states, undoing a Biden-era proposal that would have allocated money more evenly, according to analysis prepared by Democratic staffers",
    "likes": 194,
    "reposts": 112
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T08:56:37",
    "text": "JUST IN: Democratic Rep. Gerry Connolly of Virginia has died at age 75, according to a statement from his family. cnn.it/4kwOid2",
    "likes": 378,
    "reposts": 81
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T07:56:45",
    "text": "Target was already facing a very public revolt from some of its most loyal customers. Now it’s warning about tariffs: cnn.it/3SeHgxu",
    "likes": 156,
    "reposts": 42
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T07:22:19",
    "text": "Intercepted Russian radio chatter obtained by CNN appears to correspond with drone footage showing the suspected execution of Ukrainian prisoners of war last year. The killing of surrendering Ukrainian troops is alleged by Kyiv and international experts to be part of an orchestrated Russian policy.",
    "likes": 280,
    "reposts": 115
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T07:02:58",
    "text": "Former senior aide to ex-Ukrainian president Viktor Yanukovych shot dead outside the American School in Madrid, Spanish police source says",
    "likes": 86,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T06:17:48",
    "text": "Tax experts, IRS employees and former Treasury officials are all warning that the US government could lose hundreds of billions of dollars in revenue because of staffing cuts to the tax agency, undercutting claims that the sweeping jobs cuts will save the government money: cnn.it/4jchdSk",
    "likes": 255,
    "reposts": 97
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T06:00:28",
    "text": "Despite a brief market scare, the richest 10 Americans got $365 billion richer over the past year, according to a new analysis from Oxfam.",
    "likes": 180,
    "reposts": 97
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T05:11:58",
    "text": "The US has been talking with Hamas through an American intermediary in Doha this week in hopes of brokering an Israel-Gaza ceasefire agreement, according to a source, as US officials say President Donald Trump is growing increasingly frustrated with Israel’s handling of the conflict.",
    "likes": 59,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T05:06:08",
    "text": "A sizeable share of the US population depends on these programs. More than 71 million people are enrolled in Medicaid, and roughly 42 million Americans receive food stamps, according to the federal agencies that oversee them.",
    "likes": 142,
    "reposts": 63
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T02:48:56",
    "text": "JUST IN: Russian President Vladimir Putin visited Kursk for the first time since Moscow claimed to have completely recaptured the region following a surprise incursion by Ukrainian forces last year, Russian state news agency TASS reported",
    "likes": 34,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T02:00:07",
    "text": "President Donald Trump has laid out new details of his ambitious plan for a multibillion-dollar “Golden Dome” missile defense system to protect the United States from foreign attacks, saying it should be complete before he leaves office. cnn.it/4k5mInp",
    "likes": 36,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-21T01:52:48",
    "text": "Amid an antitrust battle with the Justice Department, global entertainment company Live Nation is adding one of President Trump’s closest advisors to its board of directors.",
    "likes": 34,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T21:45:23",
    "text": "The Justice Department has opened an investigation into former New York Gov. Andrew Cuomo after Republicans accused him of lying to Congress in a Covid-19 testimony, a source says.\n\nRead more: cnn.it/44NyWfA",
    "likes": 75,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T21:17:40",
    "text": "A fifth inmate was recaptured following the jail break in New Orleans last week. Five escapees remain on the loose.\n\nRead more: cnn.it/43qlFXV",
    "likes": 69,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T20:56:59",
    "text": "Epic Games’ wildly popular multiplayer shooter game “Fortnite” was available again on Apple’s app store in the US, capping a ban of nearly five years and marking a major win for the video company.\n\nDetails: cnn.it/4kxUfqa",
    "likes": 37,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T19:22:45",
    "text": "A former assistant to Sean “Diddy” Combs, Cassie Ventura’s mother and an exotic dancer nicknamed “The Punisher” all testified during Combs’ federal criminal trial as the prosecution continued to make its case against the hip-hop mogul.",
    "likes": 34,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T18:13:38",
    "text": "The US has obtained new intelligence suggesting that Israel is making preparations to strike Iranian nuclear facilities, even as the Trump administration has been pursuing a diplomatic deal with Tehran.",
    "likes": 150,
    "reposts": 84
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T17:55:22",
    "text": "Ten gold bracelets, 17 cigar cases, a powder compact, a comb, and a whopping 598 gold coins: The items are all part of a valuable and somewhat mysterious stash, found by chance by two hikers in the northeastern Czech Republic.\n\nRead more: cnn.it/4kxINea",
    "likes": 122,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T17:15:31",
    "text": "Newly freed Israeli-American hostage Edan Alexander provided new information about Israeli hostage Matan Zangauker, confirming that he is alive but suffering from significant weight loss, abdominal pain and mental distress, according to Zangauker’s family.",
    "likes": 67,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T16:42:23",
    "text": "NFL owners have voted to allow players in the league to participate in the flag football competition at the upcoming 2028 Olympic Games in Los Angeles. \n\nDetails: cnn.it/43qa0bw",
    "likes": 70,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T16:21:45",
    "text": "George Wendt, an actor and comedian who was beloved for his performance as Norm Peterson on the long-running comedy series “Cheers” has died, his family announced.\n\nRead more: cnn.it/4k7chQ9",
    "likes": 1191,
    "reposts": 159
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T15:14:09",
    "text": "Angel Reese praised the WNBA for taking up an investigation into alleged abuse aimed at the Chicago Sky player and the way the league and her team have had her back.",
    "likes": 123,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T14:40:13",
    "text": "Google’s AI push comes as publishers – particularly independent ones – have raised concerns about how the prominence of AI-generated answers could threaten their businesses.\n\nRead more: cnn.it/3Fr4htY",
    "likes": 47,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T14:20:59",
    "text": "Tariffs and tensions between governments are driving a wedge between Americans and Canadians, even in Point Roberts, Washington, where the ties have been deep for generations.",
    "likes": 89,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T14:08:51",
    "text": "President Donald Trump delivered a blunt message to House Republicans Tuesday morning: Stop negotiating and move ahead with his massive domestic policy bill.",
    "likes": 61,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T13:39:44",
    "text": "Elon Musk, who spent a record amount of money to help elect President Trump, says he plans to spend a lot less on politics in the future.",
    "likes": 99,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T10:54:14",
    "text": "Authorities have arrested an Orleans Parish Sheriff’s Office employee following the escape of 10 inmates, the Louisiana Attorney General’s office confirmed Tuesday, The Associated Press reported.",
    "likes": 47,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T10:32:37",
    "text": "UK pauses trade negotiations with Israel over its military operation in Gaza and settler violence in the West Bank.",
    "likes": 155,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T10:05:11",
    "text": "At least four people from Donald Trump’s first term who were deemed too extreme or politically toxic to win Senate confirmation – or even keep their jobs – are now back in the fold and in some cases with more power than before.",
    "likes": 79,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T09:38:53",
    "text": "After the US lost its last perfect credit rating on Friday, Republicans and Democrats responded by pointing fingers at each other.",
    "likes": 87,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T08:50:37",
    "text": "In the final two years of his presidency, Joe Biden was hidden from the public eye to shield the extent of his decline, according to a new book from CNN’s Jake Tapper and Axios’ Alex Thompson.",
    "likes": 54,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T06:21:46",
    "text": "The Trump administration intends to use a civil anti-fraud law to investigate and potentially punish and withdraw federal funding from universities that promote diversity and inclusion policies, the Department of Justice announced.",
    "likes": 101,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T05:18:02",
    "text": "\"It's been a full year since Google's AI overview tool went viral for encouraging people to eat glue and put rocks on pizza,\" writes Allison Morrow. \"At the time, the mood around the coverage seemed to be: Oh that silly AI is just hallucinating again.\" cnn.it/4mu13qw",
    "likes": 99,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T04:15:58",
    "text": "Despite a 90-day truce in its trade war with the United States, China appears to be maintaining tight control over its rare earth exports – preserving a key source of leverage in future negotiations amid intensifying strategic rivalry with Washington.",
    "likes": 100,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-20T01:34:11",
    "text": "The Senate voted to advance first-of-its-kind legislation to regulate “stablecoins,” a kind of cryptocurrency. Democrats had initially voted to block the bill earlier this month amid concerns over President Donald Trump’s cryptocurrency deals.",
    "likes": 71,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T21:59:46",
    "text": "A close call earlier this month at LaGuardia Airport in New York City between two commercial jets is under investigation, the FAA and National Transportation Safety Board confirmed.",
    "likes": 104,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T21:24:48",
    "text": "A Harvard Medical School professor who works with the Veterans Affairs Department to assess veterans’ risk of suicide hopes his project can survive a fierce internal debate at the department on whether to cancel research contracts with Harvard.",
    "likes": 294,
    "reposts": 93
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T20:56:02",
    "text": "JUST IN: The DOJ has charged Democratic Rep. LaMonica McIver with assaulting law enforcement during a chaotic skirmish outside of an ICE detention facility",
    "likes": 128,
    "reposts": 68
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T20:40:40",
    "text": "JUST IN: A fourth criminal has been captured in the manhunt for 10 escapees from a New Orleans jail that has local, state and federal authorities scrambling",
    "likes": 67,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T20:03:08",
    "text": "US homebuilders pulled back on projects in April amid whipsaw tariff announcements and growing fears of economic stress, new data on Friday revealed.",
    "likes": 172,
    "reposts": 62
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T19:55:10",
    "text": "President Donald Trump’s decision to impose a steep tax on most goods that come into America has tested the mettle of small business owners whose companies are reliant on global trade.",
    "likes": 110,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T19:53:40",
    "text": "Authorities in El Salvador have arrested a prominent attorney critical of President Nayib Bukele, in a move criticized by rights groups who say it reflects an increasing trend of “authoritarianism” in the country.",
    "likes": 446,
    "reposts": 203
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T19:42:54",
    "text": "Contrary to the narrative from the president, sources say that the Trump administration was the one that approached Qatar about acquiring a Boeing 747.",
    "likes": 1526,
    "reposts": 601
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T19:12:54",
    "text": "A federal judge said that she had concerns about being “hoodwinked” by plans put forward in her courtroom by a Trump appointee to rebuild three offices focused on civil rights oversight within the Department of Homeland Security that were eviscerated with mass layoffs set to take effect this week.",
    "likes": 137,
    "reposts": 59
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T18:56:19",
    "text": "Cassie Ventura is no longer on the stand, but she was the central character in testimony from three witnesses on Monday in the federal criminal case against Sean “Diddy” Combs.",
    "likes": 48,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T18:19:10",
    "text": "What’s happening in southwest Memphis reveals the tension between two very different narratives of what AI can bring US communities. cnn.it/4k3pMQX",
    "likes": 259,
    "reposts": 82
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T18:01:23",
    "text": "The first flight carrying migrants who chose to self-deport from the United States as part of a new Department of Homeland Security initiative offering free flights and $1,000 stipends has landed in Honduras.",
    "likes": 72,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T17:48:14",
    "text": "A divided federal appeals court rejected a request from the Trump administration to put on hold a judge’s order requiring the government to “facilitate” the return of a 20-year-old Venezuelan refugee who was deported earlier this year to El Salvador.",
    "likes": 151,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T17:26:41",
    "text": "The jury in Sean \"Diddy\" Combs' racketeering and sex-trafficking trial has been dismissed for the day after hearing testimony from three witnesses. Here's a recap.",
    "likes": 33,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T16:20:34",
    "text": "The Trump administration has agreed to pay nearly $5 million to the family of Ashli Babbitt, a pro-Donald Trump rioter who was shot and killed after breaching the US Capitol on January 6, 2021, according to a person familiar with the matter.",
    "likes": 87,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T15:55:16",
    "text": "In recent years, people ranging from Taylor Swift and Rep. Alexandria Ocasio-Cortez to high school girls around the country have been victims of non-consensual, explicit deepfakes.\n\nNow there is federal law criminalizing the sharing of those images. cnn.it/4mpboE6",
    "likes": 245,
    "reposts": 62
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T15:17:53",
    "text": "The FAA is investigating another radio outage at the troubled air traffic approach control facility responsible for flights approaching and departing Newark Liberty International Airport.",
    "likes": 90,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T14:59:03",
    "text": "President Donald Trump is considering nominating Emil Bove, his former personal attorney who currently holds a senior role at the Justice Department, as a federal appeals judge, a person familiar with the matter confirmed to CNN.",
    "likes": 44,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T14:42:38",
    "text": "Scientists studying footage from Jicarón Island spotted something unusual: a capuchin monkey carrying an infant howler on his back. Now, they’re trying to learn what it means. cnn.it/3H1dtWA",
    "likes": 78,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T14:24:35",
    "text": "President Trump says Russia and Ukraine will \"immediately\" begin ceasefire negotiations after a two-hour call with Russian leader Vladimir Putin.",
    "likes": 72,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T13:51:58",
    "text": "A federal judge has ruled that the Trump administration unlawfully removed the board of the US Institute of Peace earlier this year and that subsequent actions taken by officials installed by DOGE to cripple the agency are therefore “null and void.”",
    "likes": 412,
    "reposts": 108
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T13:36:02",
    "text": "The FBI is probing the Democratic New York attorney general’s real estate transactions, Director Kash Patel confirmed in an interview with Fox News on Sunday.",
    "likes": 85,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T13:09:39",
    "text": "The Supreme Court has allowed the Trump administration to move toward ending temporary deportation protections for potentially hundreds of thousands of Venezuelans.",
    "likes": 46,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T12:43:15",
    "text": "Wendy McMahon, the top executive in charge of CBS News, has resigned. It's the second high-profile departure at the news operation amid President Trump's intensifying political pressure.",
    "likes": 119,
    "reposts": 46
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T11:38:01",
    "text": "House Republican leaders are still trying to resolve major internal battles over President Donald Trump’s massive domestic policy bill, even as Speaker Mike Johnson is engaged in last-ditch negotiations to win over GOP members’ conflicting demands before an expected floor vote later this week",
    "likes": 67,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T10:22:51",
    "text": "The 82-year-old former president’s diagnosis — an “aggressive form” of prostate cancer that has spread to his bones — is the latest chapter in his family’s tragic history.",
    "likes": 125,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T08:04:20",
    "text": "The WNBA have said it will be investigating reports of racial slurs directed towards Angel Reese during the Chicago Sky's loss to the Indiana Fever. cnn.it/4knDehY",
    "likes": 88,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T06:41:12",
    "text": "\"President Donald Trump is sending a stern warning to Corporate America: He will use his bully pulpit to publicly shame companies that dare to raise prices because of tariffs,\" writes David Goldman | Analysis",
    "likes": 159,
    "reposts": 58
  },
  {
    "username": "CNN",
    "created_at": "2025-05-19T01:43:23",
    "text": "The House Budget Committee voted Sunday night to advance President Donald Trump’s legislative agenda, with the sweeping bill clearing a key hurdle while setting up a potentially contentious series of votes with hardliners this week.",
    "likes": 60,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T22:01:32",
    "text": "As a severe weather outbreak became increasingly likely Friday, meteorologists at the National Weather Service office in Jackson, Kentucky, made the decision to call everyone in and staff the overnight shift, according to Tom Fahy, who represents the NWS Employees Union.",
    "likes": 154,
    "reposts": 45
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T20:59:27",
    "text": "Former President Joe Biden has been diagnosed with prostate cancer that has spread to his bones. Biden and his family are currently reviewing treatment options.\n\nRead more: cnn.it/4jbsSRE",
    "likes": 223,
    "reposts": 38
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T20:04:51",
    "text": "Romania’s pro-European Union presidential candidate Nicușor Dan won the country’s presidential election Sunday, defeating his ultranationalist rival.",
    "likes": 542,
    "reposts": 60
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T19:11:07",
    "text": "JUST IN: World No. 1 Scottie Scheffler captures first PGA Championship and third major win cnn.it/43zFmh4",
    "likes": 121,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T19:02:00",
    "text": "Kamala Harris reacts to former President Joe Biden's prostate cancer diagnosis: “Joe is a fighter — and I know he will face this challenge with the same strength, resilience, and optimism that have always defined his life and leadership.\" cnn.it/4knfHh8",
    "likes": 611,
    "reposts": 63
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T19:00:12",
    "text": "JUST IN: New Jersey Transit reaches tentative deal with engineers union that could end strike",
    "likes": 80,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T18:08:03",
    "text": "President Trump wishes Joe Biden a “fast and successful recovery\" following the former president’s prostate cancer diagnosis",
    "likes": 82,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T16:12:39",
    "text": "BREAKING: Former President Joe Biden has been diagnosed with an \"aggressive form\" of prostate cancer, which has spread to his bones. cnn.it/4kpDRYA",
    "likes": 448,
    "reposts": 161
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T16:06:58",
    "text": "Agency shake-ups and new appointees have begun to splinter the alliance between traditional Trump world allies and Kennedy’s MAHA acolytes.",
    "likes": 73,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T15:13:34",
    "text": "A British mountain guide has scaled Mount Everest for the 19th time, breaking his own record for the most ascents of the world’s highest mountain by a non-Sherpa guide. cnn.it/3GUW5Tt",
    "likes": 102,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T13:55:28",
    "text": "How the nighttime escape of 10 inmates from a New Orleans jail unfolded: cnn.it/3Fn9nrb",
    "likes": 57,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T13:37:16",
    "text": "JUST IN: Authorities identify the suspect killed in an explosion Saturday outside a Palm Springs fertility clinic. Four people were injured in the blast.",
    "likes": 88,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T13:07:53",
    "text": "Pennsylvania man arrested on suspicion of murder 8 years after his wife vanished from a Philly suburb: cnn.it/4k0qoXd",
    "likes": 81,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T12:10:34",
    "text": "Long working hours might not just be bad for you – they could also be altering the structure of your brain, a new study suggests",
    "likes": 100,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T11:27:50",
    "text": "A passenger had heart attack symptoms on a flight. A cardiologist and a pocket-sized tool on board may have helped save his life",
    "likes": 187,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T10:46:35",
    "text": "The Mexican Navy training ship that struck the Brooklyn Bridge was moving in the “wrong direction,” a senior city official with knowledge of the investigation tells CNN: cnn.it/4j5Niv1",
    "likes": 59,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T10:33:23",
    "text": "Tariff rates will soon return to “reciprocal” level if countries don’t reach trade agreements during the 90-day pause, Treasury Secretary Scott Bessent says",
    "likes": 70,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T09:27:27",
    "text": "Pope Leo XIV condemned the exploitation of the poor and called for unity in the church during his inaugural Mass in St. Peter’s Square, an event attended by world leaders, royalty and tens of thousands of believers",
    "likes": 510,
    "reposts": 83
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T08:40:01",
    "text": "Why this podcaster's approach to talking about uncomfortable topics is resonating with millions: cnn.it/45fsxtD",
    "likes": 48,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T08:15:07",
    "text": "International mediators are making renewed efforts to reach a truce in Gaza after Israel launched a major new offensive in the territory, as the health ministry there reported more than 100 people killed in overnight strikes",
    "likes": 81,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T07:29:13",
    "text": "President Trump lowered tariffs on China. But here’s why that won’t spare Americans from price hikes and shortages: cnn.it/431SZWg",
    "likes": 163,
    "reposts": 59
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T06:54:25",
    "text": "Russia has battered Ukraine overnight with its largest drone attack since the war began, Ukraine’s military says: cnn.it/4dkIgcR",
    "likes": 100,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T04:34:04",
    "text": "Pope Leo greets crowds from popemobile as inaugural Mass begins at the Vatican cnn.it/4kvl0vn",
    "likes": 328,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-18T02:48:45",
    "text": "Two dead and more than a dozen injured after a Mexican Navy training ship struck the Brooklyn Bridge, New York City mayor says. Follow live updates: cnn.it/43zspnv",
    "likes": 101,
    "reposts": 38
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T22:17:32",
    "text": "JUST IN: At least 20 injured after Mexican Navy training ship strikes the Brooklyn Bridge, source says",
    "likes": 464,
    "reposts": 152
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T20:28:05",
    "text": "BREAKING: Authorities say explosion outside of Palm Springs fertility clinic was an \"intentional act of terrorism\"",
    "likes": 761,
    "reposts": 260
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T19:35:40",
    "text": "JUST IN: Favorite Journalism crosses the finish line first at the 150th Preakness Stakes after an incredible closing stretch",
    "likes": 127,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T19:25:29",
    "text": "Austria has won its third Eurovision Song Contest after a glittering grand final, with singer JJ earning the continent's votes for the operatic pop anthem \"Wasted Love.\" cnn.it/3YPTwYZ",
    "likes": 158,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T18:06:18",
    "text": "The provision comes as President Donald Trump has used the powers of his office in extraordinary ways to target top law firms, elite universities and other perceived political enemies.",
    "likes": 237,
    "reposts": 74
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T17:30:01",
    "text": "Police and firefighters responded to an explosion Saturday that rocked a neighborhood and damaged a fertility clinic in the California city of Palm Springs.",
    "likes": 120,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T17:13:49",
    "text": "Antonio Brown was briefly detained by police early Saturday following an altercation in which gunshots were fired outside a celebrity boxing event in Miami, according to the former NFL star and video posted to social media.",
    "likes": 48,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T14:11:38",
    "text": "Over the first four months of the Trump administration, DOGE has upended the federal government.",
    "likes": 125,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T13:57:47",
    "text": "The Department of Justice announced the agreement as part of a settlement between the federal government and gun manufacturer Rare Breed Triggers, in litigation brought by the Biden administration.",
    "likes": 77,
    "reposts": 48
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T13:22:56",
    "text": "President Donald Trump wasted no time enacting his immigration crackdown after being inaugurated for a second term.",
    "likes": 54,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T12:24:13",
    "text": "Trump says he plans to speak to Putin on the phone Monday, followed by Zelensky and members of NATO.",
    "likes": 59,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T11:25:34",
    "text": "Through her grueling testimony, prosecutors set the groundwork to bolster their claim that Combs not only sexually trafficked Ventura but also led a broader criminal enterprise with the help of associates, legal experts told CNN.",
    "likes": 77,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T09:47:12",
    "text": "A violent, tornado-spawning storm system tore across the central US, leaving at least 21 people dead in Missouri and southeastern Kentucky as it cut a path of destruction across several states: cnn.it/44HTR3C",
    "likes": 154,
    "reposts": 59
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T09:08:26",
    "text": "Archaeologists have uncovered evidence that four people, including a child, in the ancient Roman town of Pompeii used furniture to block a door and shield themselves from the eruption of Mount Vesuvius.",
    "likes": 184,
    "reposts": 43
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T08:17:47",
    "text": "Spotify is scrambling to remove dozens of podcasts promoting online prescription drug sales: cnn.it/4kpv7lf",
    "likes": 94,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T06:59:30",
    "text": "Walmart has warned that its products will become more expensive due to President Donald Trump’s tariffs: cnn.it/4mpFdo8",
    "likes": 253,
    "reposts": 65
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T06:26:22",
    "text": "Elon Musk’s prominent role in President Donald Trump’s White House appears to be fading, but the tech billionaire’s brainchild – the budget-slashing Department of Government Efficiency – is poised to continue its work after his departure",
    "likes": 93,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T05:56:19",
    "text": "Dangerously high levels of arsenic and cadmium found in store-bought rice, report finds: cnn.it/43laaRo",
    "likes": 139,
    "reposts": 53
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T05:26:16",
    "text": "A Russian drone attack on a bus in northeastern Ukraine killed at least nine people and injured seven others, Ukrainian officials said, just hours after the two countries met for the first direct peace talks in three years",
    "likes": 99,
    "reposts": 44
  },
  {
    "username": "CNN",
    "created_at": "2025-05-17T04:46:38",
    "text": "Beneath the waters of South Australia’s coast, marine archaeologists say they've discovered a lost Dutch merchant vessel that sank nearly 170 years ago: cnn.it/4j4ANA0",
    "likes": 115,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T23:15:14",
    "text": "Why a controversial census in India could further divide the nation along caste lines: cnn.it/430AIbR",
    "likes": 61,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T22:34:56",
    "text": "Over a decade after 43 students from a rural teaching college vanished in southern Mexico, a new arrest has stirred fresh scrutiny and reopened old wounds: cnn.it/4dm9bFp",
    "likes": 106,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T22:03:46",
    "text": "New York University said it is withholding the diploma of a student who condemned \"genocide\" in Gaza while delivering a graduation speech – a move the university called a violation of the student's commitment to comply with school rules. Read more: cnn.it/4dlDWdr",
    "likes": 430,
    "reposts": 137
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T21:46:56",
    "text": "A critical network of Atlantic Ocean currents is weakening, a new study finds. It’s already supercharging sea level rise in the US: cnn.it/43jbfsT",
    "likes": 151,
    "reposts": 74
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T21:06:56",
    "text": "With the help of more than five dozen fossils, paleontologists have uncovered a tiny three-eyed predator nicknamed the “sea moth” that swam in Earth’s oceans more than 500 million years ago: cnn.it/3GWhLhO",
    "likes": 103,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T20:32:55",
    "text": "Storm kills at least 4 people in St. Louis as millions remain under the threat of strong tornadoes and violent winds: cnn.it/4jckRvI",
    "likes": 82,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T20:11:39",
    "text": "Cassie Ventura's attorney Douglas Wigdor read aloud a statement on behalf of her husband, Alex Fine, after Ventura finished testifying in the trial of Sean \"Diddy\" Combs.\n\nRead takeaways from the day in court: cnn.it/4dlUdPq",
    "likes": 130,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T19:53:58",
    "text": "The federal judge overseeing the case of Kilmar Abrego Garcia appeared extremely frustrated by the Trump administration’s efforts to thwart a search for answers on what officials are doing to facilitate his return from El Salvador: cnn.it/4kas6Fu",
    "likes": 360,
    "reposts": 94
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T19:43:20",
    "text": "FDA greenlights first blood test to help diagnose Alzheimer’s disease in the US: cnn.it/4k2hUz3",
    "likes": 189,
    "reposts": 49
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T19:25:46",
    "text": "Audio released of Biden interview with special counsel who described him as an ‘elderly man with a poor memory’: cnn.it/44CvrbH",
    "likes": 106,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T18:42:18",
    "text": "Hackers linked to a notorious cybercriminal group have conducted cyberattacks on multiple US retail companies in the last 10 days, prompting the FBI to step up cyber-intelligence briefings for major companies in the sector, three sources say: cnn.it/44BDwNQ",
    "likes": 95,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T17:58:55",
    "text": "A producer who has pitched the idea to DHS said he envisions the show as being a “positive love letter to America” while dismissing criticism that it would be “punching down” on contestants.",
    "likes": 49,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T17:22:29",
    "text": "The United States loses its last perfect credit rating, a loss that could rattle financial markets and push up interest rates. cnn.it/3HdNJ9l",
    "likes": 596,
    "reposts": 198
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T17:16:14",
    "text": "Former FBI Director James Comey will be interviewed on Friday by the US Secret Service investigating his cryptic social media post.",
    "likes": 130,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T16:30:26",
    "text": "The decision is a significant loss for President Trump, who wants to use the law to speed deportations – and avoid the kind of review normally required before removing people from the country.",
    "likes": 521,
    "reposts": 98
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T15:39:23",
    "text": "Eleven inmates escaped from the Orleans Justice Center in New Orleans, and so far only one of the men has been found, the local sheriff said Friday.",
    "likes": 68,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T15:20:34",
    "text": "The president’s comments come days after Springsteen lambasted Trump during the first show of his latest tour with the E Street Band.",
    "likes": 177,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T12:44:27",
    "text": "President Donald Trump’s agenda has been thrown into chaos after a group of GOP hardliners blocked the bill in a key committee vote on Friday – dealing a major embarrassment to House Republican leaders and Trump himself.",
    "likes": 398,
    "reposts": 79
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T11:57:22",
    "text": "The story of transplants has always been one of altruism. After all, organs can be neither sold nor purchased. They can only be donated as a gift of life.",
    "likes": 53,
    "reposts": 2
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T11:34:59",
    "text": "The man convicted of stabbing Salman Rushdie on a New York lecture stage in 2022, leaving the prizewinning author blind in one eye, was sentenced Friday to serve 25 years in prison.",
    "likes": 102,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T10:06:53",
    "text": "Keeping cool could cost a lot more this summer – yet another financial squeeze for inflation-weary consumers: cnn.it/3YOMKT9",
    "likes": 44,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T09:14:04",
    "text": "A dangerous day of severe thunderstorms – including the potential for long-lasting, powerful tornadoes and hurricane-strength wind gusts – is ahead for the eastern half of the United States today",
    "likes": 81,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T08:31:38",
    "text": "A bronze statue of Melania Trump near her hometown in Slovenia has gone missing, five years after it replaced a wooden statue damaged by arsonists",
    "likes": 201,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T07:51:54",
    "text": "President Donald Trump says the clock is ticking for countries to make a deal or face higher tariffs: cnn.it/43u1Xvz",
    "likes": 61,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T06:53:19",
    "text": "Russian and Ukrainian officials are meeting for direct talks - the first since the early weeks of the war. Follow live updates.",
    "likes": 51,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T06:25:12",
    "text": "When Denise learned in February that she might have to pay out of pocket for her weekly therapy sessions, the military veteran from Virginia started to panic.",
    "likes": 102,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T05:30:12",
    "text": "As the US and China came to an agreement to lower tariffs sharply this week, trade war uncertainty has, for now, subsided. But Wall Street has a new question for President Donald Trump: What about tax cuts?",
    "likes": 122,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-16T01:07:44",
    "text": "Engineers at New Jersey Transit went on strike, halting trains on the nation's third largest commuter rail service and affecting 100,000 passengers.",
    "likes": 142,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T22:03:19",
    "text": "A “copy” of Magna Carta bought decades ago by Harvard Law School for just $27.50 is now understood to be an extremely rare original from 1300, according to new research. cnn.it/3SCl3JF",
    "likes": 800,
    "reposts": 105
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T21:45:19",
    "text": "The Atlantic Ocean has a toxic seaweed problem.\n\nFloating in brown islands of algae, this year’s sargassum bloom has already broken its own size record by millions of tons — and the growing season isn’t done yet. cnn.it/3S7nhAE",
    "likes": 111,
    "reposts": 43
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T21:33:06",
    "text": "Former Director of the FBI James Comey took down an Instagram post of seashells spelling out the numbers “86 47” after Republicans claimed that it was a threat against President Donald Trump.",
    "likes": 175,
    "reposts": 45
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T21:00:29",
    "text": "The United States and United Arab Emirates will partner to build a massive data center complex in Abu Dhabi to advance artificial intelligence capabilities with 5-gigawatts of capacity — enough to power a major city.",
    "likes": 54,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T20:34:46",
    "text": "Hundreds of obsidian artifacts have revealed where the Aztecs acquired the volcanic glass they used for tools, ornamental pieces or religious objects centuries ago — and their vast trade networks included their rivals. cnn.it/3Fd28SC",
    "likes": 127,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T20:01:31",
    "text": "It was news that Pauline Stuart thought might never come: The man believed to be responsible for the death of her teenage son years earlier is finally behind bars.",
    "likes": 90,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T18:57:04",
    "text": "CNN will exclusively televise actor George Clooney’s record-breaking Broadway show “Good Night, and Good Luck,” on Saturday, June 7, the network announced Thursday.",
    "likes": 684,
    "reposts": 102
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T18:21:23",
    "text": "Ed Martin, who left his position this week as the top federal prosecutor in Washington, DC, to take another job within the Justice Department because his chances of being confirmed to the post were dwindling, is facing an ethics probe, according to a letter reviewed by CNN.",
    "likes": 872,
    "reposts": 197
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T17:46:01",
    "text": "Hackers have been using AI-generated voice messages to impersonate senior US government officials in an ongoing effort to break into the online accounts of current and former US officials, the FBI warned.",
    "likes": 111,
    "reposts": 56
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T17:12:48",
    "text": "UnitedHealth Group, one of America’s biggest corporations and a member of the exclusive Dow Jones Industrial Average, is suddenly unraveling.",
    "likes": 812,
    "reposts": 215
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T16:35:00",
    "text": "A baby born with a rare and dangerous genetic disease is growing and thriving after getting an experimental gene editing treatment made just for him. cnn.it/4diYovz",
    "likes": 250,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T16:02:43",
    "text": "Florida has become the second state in the nation to ban the addition of fluoride to public drinking water.",
    "likes": 67,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T15:29:26",
    "text": "The Supreme Court seemed open to lifting a series of nationwide orders blocking President Donald Trump from enforcing his birthright citizenship policy, even as several of the justices wrestled with the practical implications of allowing the government to deny citizenship to people born in the US.",
    "likes": 43,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T15:07:31",
    "text": "Singer Chris Brown was arrested Thursday in England for allegedly hitting someone with a bottle in a London nightclub in 2023.",
    "likes": 70,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T14:36:31",
    "text": "Since returning to the White House, President Donald Trump has made several moves to crack down on immigration, and one of his efforts will be considered by the Supreme Court on Thursday.\n\nHere’s where immigration stands in the United States.",
    "likes": 42,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T14:09:40",
    "text": "Israeli Prime Minister Benjamin Netanyahu has pledged to eradicate Hamas with a strategy that would see the military hold more territory in Gaza and push the entire civilian population into a smaller area in the south.",
    "likes": 72,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T13:33:06",
    "text": "It’s an example, according to whistleblowers, of the type of work that is now paused after the department’s Office for Civil Rights and Civil Liberties was dissolved in late March.",
    "likes": 52,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T12:07:24",
    "text": "In one of Chicago’s south suburbs, while other boys were playing cops and robbers, the future Pope Leo XIV would pretend to hold Mass in the basement of his family’s small brick home, reading from scripture and distributing disk-shaped candy wafers to his two older brothers.",
    "likes": 91,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T11:21:23",
    "text": "Wisconsin judge pleads not guilty to federal charges accusing her of helping a man evade immigration agents.",
    "likes": 548,
    "reposts": 67
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T11:06:39",
    "text": "Ukraine's President Volodymyr Zelensky says he's sending a delegation for peace talks with Russian officials.\n\nFollow live updates.",
    "likes": 170,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T10:07:18",
    "text": "Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader \"unfit\" for office. cnn.it/4mo7o6W",
    "likes": 845,
    "reposts": 145
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T09:05:35",
    "text": "Poor morale. Unclear mission. An internal FEMA review is raising serious concerns about how the agency would respond to a major disaster. cnn.it/4djTMp2",
    "likes": 195,
    "reposts": 48
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T07:41:25",
    "text": "Walmart announces plans to start raising prices on some items later this month due to higher tariffs",
    "likes": 232,
    "reposts": 79
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T07:19:12",
    "text": "Dick's Sporting Goods is buying rival Foot Locker in a $2.4 billion deal cnn.it/43hLI3g",
    "likes": 91,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T06:59:45",
    "text": "As Trump continues his aggressive and fast-paced efforts, here’s where immigration stands in the United States:",
    "likes": 31,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T05:46:59",
    "text": "Samples of store-bought rice from more than 100 different brands purchased in the United States contained dangerously high levels of arsenic and cadmium, according to a new report released exclusively to CNN.",
    "likes": 134,
    "reposts": 54
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T02:12:00",
    "text": "Boeing has secured a deal with Qatar for up to 210 jets in what the White House is calling the aircraft maker’s “largest-ever” widebody order, worth $96 billion dollars.",
    "likes": 83,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-15T02:03:32",
    "text": "American consumers, battle-scarred by the pandemic and the subsequent surge in inflation, are already changing their spending patterns and delaying some purchases due to President Donald Trump’s chaotic tariff policy and the broader economic uncertainty, new survey data shows.",
    "likes": 101,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T21:55:07",
    "text": "A Russian-born scientist and Harvard University researcher, who was already facing deportation back to Russia, was charged with trying to smuggle frog embryos into the country.",
    "likes": 93,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T21:26:54",
    "text": "Some X users asked Grok – the AI chatbot available through Elon Musk’s social media platform – questions about simple topics like baseball players or videos of fish being flushed down toilets.\n\nIn response, they got replies about the theory of “white genocide” in South Africa.",
    "likes": 261,
    "reposts": 80
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T21:10:07",
    "text": "After being in the hot seat for about nine hours over two days, Cassie Ventura is done with direct questioning from prosecutors.\n\nRead more: cnn.it/4djo4Iw",
    "likes": 65,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T20:27:11",
    "text": "The EPA says it plans to weaken limits on some \"forever chemicals\" in drinking water that were finalized last year, while maintaining standards for two common ones.",
    "likes": 94,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T20:07:43",
    "text": "With President Donald Trump’s agenda on the line, Speaker Mike Johnson is stuck in the middle between two disgruntled factions of the House GOP that want completely different things. If he can’t find a way to appease both, it could derail the whole bill: cnn.it/3S6ErhN",
    "likes": 154,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T19:45:54",
    "text": "Jeanine Pirro sworn in as DC’s top federal prosecutor: cnn.it/3SzZw4e",
    "likes": 70,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T19:17:38",
    "text": "Voting technology firm Smartmatic, which is suing Fox News for defamation over its 2020 election coverage, claimed senior corporate executives including Rupert Murdoch intentionally destroyed evidence in the case, according to court filings: cnn.it/3S1Rcu5",
    "likes": 1489,
    "reposts": 541
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T18:29:25",
    "text": "Have you ever had Siri go off unintentionally? If so, you might be entitled to some cash from Apple: cnn.it/4miHm4Q",
    "likes": 60,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T18:03:14",
    "text": "A federal judge said that the Trump Justice Department likely engaged in unconstitutional retaliation when it cut off grants to American Bar Association programs assisting victims of domestic violence: cnn.it/4iYVs8x",
    "likes": 600,
    "reposts": 174
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T17:17:45",
    "text": "A significant overhaul of the National Security Council at the White House is expected in the coming days, including a staff reduction and a reinforced top-down approach with decision-making concentrated at the highest levels, three senior Trump administration officials told CNN: cnn.it/4jmCCsp",
    "likes": 67,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T17:11:31",
    "text": "Some members of Biden's Cabinet did not believe he could be relied upon in a 2 a.m. emergency by the last year of his presidency, new book reveals",
    "likes": 46,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T17:09:34",
    "text": "JUST IN: Harvard president to take a 25% pay cut as the university says it is \"blacklisted\" from getting federal funding",
    "likes": 247,
    "reposts": 58
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T16:39:01",
    "text": "The Supreme Court is set to take up a case that could decide how quickly President Donald Trump can implement his second term agenda as it hears arguments about nationwide injunctions that allow a single judge to block a policy for the entire country: cnn.it/43f3pR3",
    "likes": 60,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T15:39:09",
    "text": "A Wisconsin judge charged with helping a man who is in the country illegally evade US immigration agents who were trying to detain him at her courthouse filed a motion to dismiss the case Wednesday, arguing that there’s no legal basis for it.",
    "likes": 751,
    "reposts": 154
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T14:52:53",
    "text": "Cassie Ventura testifies about the alleged abuse she endured from the music mogul and how \"Freak Offs\" led to medical issues. Follow live updates:",
    "likes": 37,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T13:47:52",
    "text": "A Venezuelan toddler who had been kept in US government custody after her parents were deported has been returned to Venezuela.",
    "likes": 122,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T13:11:33",
    "text": "A judge in Virginia ordered the release of Georgetown University scholar Badar Khan Suri, marking at least the third time a detained student or academic targeted by the Trump administration because of their protest activity or affiliation was released from immigration detention. cnn.it/4dlC30o",
    "likes": 325,
    "reposts": 64
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T10:20:02",
    "text": "US drug overdose deaths dropped last year by 27%, but experts warn federal cuts could threaten that progress",
    "likes": 99,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T09:52:28",
    "text": "The Trump administration has effectively “blacklisted” Harvard University from getting federal funding as part of its ongoing battle over discrimination and ideology, the university says in a new court filing.",
    "likes": 156,
    "reposts": 53
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T08:49:31",
    "text": "For the last few years, the home renovation space has been booming, but Washington’s ever-shifting tariff policies threaten to change that.",
    "likes": 43,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T07:57:51",
    "text": "US ports are facing a dramatic slowdown in cargo – but they could see the exact opposite in a matter of weeks.",
    "likes": 64,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T07:24:03",
    "text": "If you’re planning to upgrade your iPhone this fall, you may need to prepare to pay more — even if the sticker price doesn’t change.",
    "likes": 38,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T06:25:20",
    "text": "Here's what we know about this year's Canadian wildfire forecast and how impacts could cross the border. cnn.it/43uho70",
    "likes": 87,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T05:49:05",
    "text": "The Social Security Administration is combing through its databases to check whether beneficiaries are alive or dead. It has already added dates of death to millions of people’s records.\n\nThe problem: Some people who have recently been declared dead are actually alive.",
    "likes": 247,
    "reposts": 92
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T04:27:28",
    "text": "BREAKING: US President Trump has met with Syria's leader, a day after Trump announced plans to lift sanctions on the country. Follow live updates. cnn.it/4dfQkMd",
    "likes": 59,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T04:08:38",
    "text": "“The goal is to have a manageable number of flights land at Newark,” Transportation Secretary Sean Duffy told reporters at a news conference. “Families shouldn’t have to wait four or five hours for a flight that never takes off.”",
    "likes": 47,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-14T01:52:52",
    "text": "Nearly half a century after a young California woman was strangled to death, officials say a thumbprint on a carton of cigarettes has led to an arrest.",
    "likes": 119,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T22:09:12",
    "text": "Rescue boats were used to evacuate an elementary school in Allegany County, Maryland as heavy rains brought flooding to the region, the county’s emergency services department said.",
    "likes": 117,
    "reposts": 45
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T21:17:36",
    "text": "The Trump administration plans to deploy hundreds more federal personnel to ramp up arrests of undocumented immigrants as soon as this week, according to two sources familiar with the planning.",
    "likes": 71,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T20:55:59",
    "text": "A judge resentenced Erik and Lyle Menendez to 50 years to life in prison for the 1989 murders of their parents, ruling Tuesday the brothers will be eligible for parole.\n\nRead more: cnn.it/43sjwvU",
    "likes": 65,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T18:40:06",
    "text": "A judge struck down Michigan’s 24-hour waiting period before an abortion, saying it conflicts with a voter-approved amendment that locked abortion rights in the state constitution in 2022.",
    "likes": 1317,
    "reposts": 252
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T18:16:25",
    "text": "Converting a luxury jet gifted by Qatar to President Donald Trump into a replacement for Air Force One could potentially cost hundreds of millions of dollars and take up to two years to install the necessary security equipment, communications, and defensive capabilities. cnn.it/3S2UahW",
    "likes": 281,
    "reposts": 97
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T17:33:04",
    "text": "The S&P 500 benchmark stock index hit another milestone in its remarkable march higher from the brink of a bear market in recent weeks: It has now erased all its losses for this year.",
    "likes": 67,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T17:00:23",
    "text": "Boston Celtics star Jayson Tatum ruptured his right Achilles tendon in Monday night’s playoff game and will be out for an extended period of time, the team announced.",
    "likes": 46,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T16:37:22",
    "text": "Major League Baseball has removed Pete Rose and \"Shoeless\" Joe Jackson, two of the sport's most famous players who were previously kicked out of baseball for gambling on the game, from the league's permanently ineligible list.\n\nRead more: cnn.it/43ntihY",
    "likes": 77,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T16:18:21",
    "text": "Several family members of Mexican drug trafficker Joaquín “El Chapo” Guzmán have entered the US as part of negotiations in a case against one of his sons.",
    "likes": 64,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T15:43:47",
    "text": "For months, President Donald Trump has falsely claimed that egg prices are tumbling. It wasn’t true then, but it’s true now.\n\nRead more: cnn.it/43t0PrZ",
    "likes": 73,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T15:11:06",
    "text": "Nearly a decade ago, Airbnb envisioned being more than just an app to book a home for a vacation. Its latest redesign could be a major push toward becoming the kind of “end-to-end travel app,” that CEO Brian Chesky has said he wants to create. \n\nRead more: cnn.it/4de3OYC",
    "likes": 32,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T14:28:22",
    "text": "Four ex-military friends are planning to summit Everest without the usual lengthy acclimatization period, relying on inhalations of noble gas xenon to prepare them. \n\nCritics warn that this method may be unsafe and unethical.",
    "likes": 49,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T14:11:43",
    "text": "Pressed into a piece of rock is the flattened, 47 million-year-old body of a cicada.\n\nMeasuring about 1 inch long with a wingspan of 2.7 inches, its fossilized form is nearly intact, with its veined wings spread wide. cnn.it/4k19ZCc",
    "likes": 180,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T13:03:52",
    "text": "Israel targeted Hamas leader Mohammad Sinwar in a strike on a hospital in Gaza, months after killing his brother Yahya Sinwar.",
    "likes": 44,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T12:56:18",
    "text": "President Donald Trump announced Tuesday that he plans to lift sanctions on Syria following the fall of the Assad regime, which he said will “give them a chance at greatness.”",
    "likes": 43,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T11:11:43",
    "text": "Cassie Ventura, a key prosecution witness and Sean \"Diddy\" Combs' ex-girlfriend, takes the stand in the music mogul's sex trafficking trial.\n\nFollow live updates: cnn.it/3FfefP3",
    "likes": 39,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T10:41:11",
    "text": "The Trump administration is cutting another $450 million in federal grants to Harvard University – on top of $2.2 billion already slashed – tightening even further its ideological pressure on America’s oldest and wealthiest university amid a broader battle over control of US college campuses.",
    "likes": 97,
    "reposts": 48
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T10:07:33",
    "text": "Former President Joe Biden's physical deterioration was severe enough that aides discussed putting him in a wheelchair if he won a second term, new book says: cnn.it/457f2vV",
    "likes": 67,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T08:44:49",
    "text": "Annual US inflation slowed more than expected in April, a welcome sign at a time when Trump's tariff threats are stoking concern",
    "likes": 46,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T08:16:43",
    "text": "Three years after it seized control of Mariupol following a brutal 86-day siege, Russia is using a more subtle power to keep its grip on the Ukrainian port city: social media influencers. cnn.it/4jTcMNq",
    "likes": 70,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T08:00:52",
    "text": "Andrew Witty, who helped steer UnitedHealth Group after the 2024 murder of CEO Brian Thompson, is stepping down for \"personal reasons\"",
    "likes": 104,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T07:44:20",
    "text": "Kim Kardashian arrived at a Paris court to testify in the trial of the burglars accused of tying up and robbing her at gunpoint nearly nine years ago. cnn.it/459yici",
    "likes": 36,
    "reposts": 0
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T07:10:25",
    "text": "Former President Joe Biden’s physical deterioration was severe enough in the second half of his presidency that his aides privately discussed putting him in a wheelchair for his second term, according to a new book from CNN’s Jake Tapper and Axios’ Alex Thompson.",
    "likes": 157,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T04:41:05",
    "text": "French film star Gérard Depardieu found guilty of sexual assault by a Paris court",
    "likes": 146,
    "reposts": 38
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T03:06:58",
    "text": "JUST IN: US President Trump arrives in Saudi Arabia to kickstart his Middle East trip, as he tries to position himself as global dealmaker. Follow live updates.",
    "likes": 35,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-13T01:00:49",
    "text": "Chinese leader Xi Jinping has hit out at “bullying” and “hegemonism,” in his first public remarks since a temporary truce over tariffs was agreed in the trade war between the United States and China.",
    "likes": 234,
    "reposts": 60
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T22:04:30",
    "text": "Many people like to play something to quiet their thoughts as they fall asleep. Experts share how to do it while preserving your sleep quality.",
    "likes": 85,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T21:23:48",
    "text": "“Indefensible.” “It’s a bribe.” “Such a stain” on the administration.\n\nSome of President Donald Trump’s staunchest supporters are among the loudest critics of his plan to accept a jet from Qatar for use as Air Force One.",
    "likes": 531,
    "reposts": 137
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T20:43:42",
    "text": "While Harvard and the Trump administration share “common ground” on issues such as ending antisemitism and other bigotry on campus and encouraging a “multiplicity of viewpoints” at the school, the “overreach” of the federal government has hindered those objectives, the university’s president wrote.",
    "likes": 128,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T20:14:04",
    "text": "Coercion or consent?\n\nThat is the central question posed to a federal jury on the first day of testimony in Sean “Diddy” Combs' racketeering and sex trafficking trial in New York City.",
    "likes": 44,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T19:37:32",
    "text": "JUST IN: The Dallas Mavericks have won the NBA draft lottery, giving them the No. 1 overall pick in the 2025 NBA draft.",
    "likes": 73,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T19:20:14",
    "text": "AMC Theatres, the world’s largest theater chain, will be offering even more discounts to moviegoers starting this summer. cnn.it/3ZfoZDM",
    "likes": 193,
    "reposts": 46
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T19:00:56",
    "text": "Rapper Tory Lanez was hospitalized after an attack at a California prison where he’s serving a 10-year sentence for shooting hip-hop star Megan Thee Stallion in the feet, authorities said.",
    "likes": 59,
    "reposts": 3
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T18:39:16",
    "text": "The curator Koyo Kouoh, a giant of the contemporary art world who tirelessly championed African artists and became the first woman from the continent to curate the Venice Biennale, died on Saturday at age 57. cnn.it/4iWd5FV",
    "likes": 213,
    "reposts": 70
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T18:32:13",
    "text": "A Florida State University student accused of killing two people and injuring six others on campus has been released from the hospital and faces murder charges, according to Tallahassee police.",
    "likes": 79,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T18:17:50",
    "text": "Two senior Justice Department officials appointed by President Donald Trump to run the Library of Congress were denied access on Monday, according to a person familiar with the interaction.",
    "likes": 309,
    "reposts": 49
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T17:31:36",
    "text": "A federal judge won’t block a controversial Trump administration initiative to share highly sensitive taxpayer information with federal immigration authorities in hopes of tracking down undocumented immigrants and quickly deporting them out of the country.",
    "likes": 101,
    "reposts": 70
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T17:01:31",
    "text": "As tensions ratcheted up over the last week of fighting, Pakistan did not consider deploying nuclear warheads to strike India, the country’s foreign minister Ishaq Dar told CNN on Monday.",
    "likes": 51,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T16:38:05",
    "text": "McDonald’s is seeking to hire up to 375,000 people ahead of the busy summer season, marking one of its biggest employment initiatives in five years. cnn.it/3S3btPY",
    "likes": 75,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T14:46:41",
    "text": "A flight carrying a group of 59 White South Africans granted refugee status in the US by the Trump administration arrived at Washington Dulles airport on Monday, a State Department official said.",
    "likes": 63,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T11:58:41",
    "text": "JUST IN: Hamas hands Edan Alexander, the last known living American hostage in Gaza, to the Red Cross",
    "likes": 150,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T11:15:29",
    "text": "Delays continue to affect flights at Newark Liberty International Airport, due to an air traffic control staffing shortage.\n\nAs CNN previously reported, at least five controllers there took 45 days of trauma leave after losing radar and radio communication on April 28.",
    "likes": 521,
    "reposts": 156
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T10:27:46",
    "text": "Dozens of boxes of Nazi material confiscated by Argentinean authorities during World War II were recently rediscovered in the Supreme Court's basement, the court reveals.",
    "likes": 113,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T09:42:28",
    "text": "Dow soars over 1,000 points at open after US and China agree to temporarily roll back tariffs for 90 days.",
    "likes": 44,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T09:31:56",
    "text": "While Trump's tariffs may help some small US businesses, many others will feel the pain.",
    "likes": 49,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T08:29:42",
    "text": "As Donald Trump shakes up the very institutions, alliances, and free trade order that have underpinned America's global dominance since World War II, some in China are reminded of their own former leader — one who wielded revolutionary zeal to tear down the old world more than half a century ago.",
    "likes": 80,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T07:25:34",
    "text": "Sean \"Diddy\" Combs will have the support of his family as opening statements in his sex-trafficking trial are set to begin in downtown Manhattan.",
    "likes": 32,
    "reposts": 3
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T06:25:52",
    "text": "The United States aviation industry continues to grapple with the worst air traffic controller shortage in nearly 30 years as a recent spate of incidents has thrust the high-stress profession into the spotlight.",
    "likes": 125,
    "reposts": 45
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T05:22:56",
    "text": "President Donald Trump embarks on the first major international trip of his second term — an opportunity to shore up relations with a trio of key Middle Eastern allies and prove his might as a dealmaker on the world stage.",
    "likes": 47,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T04:20:12",
    "text": "The Kurdistan Workers Party militia have announced its decision to dissolve the group, a historic move after decades of conflict with Turkey that have killed tens of thousands of people.",
    "likes": 70,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-12T03:21:06",
    "text": "US and China agree to drastically roll back tariffs for an initial 90-day period, according to a joint statement.",
    "likes": 79,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T22:02:43",
    "text": "The governor of the Mexican state of Baja California says the United States has withdrawn tourist visas from her and her husband.",
    "likes": 444,
    "reposts": 171
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T21:30:14",
    "text": "Mónica got pregnant last year around the same time President Donald Trump was elected to a second term. And that is when her race against the calendar began.",
    "likes": 82,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T20:33:03",
    "text": "In June 2023, Jon Halper started selling THC beverages at Top Ten Liquors, his chain of Minnesota stores. The drinks, which contain the main intoxicating chemical compound found in cannabis, were a massive hit.\n\nAfter just two years, THC beverages make up about 15% of overall sales, he said.",
    "likes": 109,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T19:42:15",
    "text": "JUST IN: President Donald Trump announced he'll sign an executive order on Monday that aims to cut drug prices, resurrecting a controversial policy from his first term.",
    "likes": 110,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T18:58:59",
    "text": "Stock futures rose after Treasury Secretary Scott Bessent said “substantial progress” was made in trade negotiations with Chinese officials, potentially thawing tensions kickstarted by Trump’s escalating tariff policy.",
    "likes": 55,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T18:05:35",
    "text": "Four people have died and four are critically injured after a fire broke out at a multistory apartment building in Milwaukee’s Concordia neighborhood Sunday morning, CNN affiliates report.",
    "likes": 91,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T16:54:15",
    "text": "May’s full moon, known by its popular nickname as the flower moon to signify the many blossoms of spring, will be bright in the sky on Sunday night — despite it being a “micromoon.”",
    "likes": 172,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T15:27:11",
    "text": "JUST IN: Hamas announces the imminent release of the last known living American hostage held in Gaza, Edan Alexander. cnn.it/43gcZDz",
    "likes": 283,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T15:06:10",
    "text": "The direct ancestor of Tyrannosaurus rex would have arrived in North America after crossing a land bridge from Asia, according to a new study. The report is the latest to weigh in on the fierce debate among paleontologists over the origins of the king of the dinosaurs: cnn.it/3H0Gz8i",
    "likes": 122,
    "reposts": 18
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T14:33:09",
    "text": "Despite its reputation as ironclad, it was possible to escape Alcatraz. All it took was brains, guts and 50 raincoats: cnn.it/3EPPSrg",
    "likes": 93,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T13:46:24",
    "text": "Democrats involved in tense encounter at ICE facility say the Trump administration is trying to intimidate them: cnn.it/44uzJBX",
    "likes": 249,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T13:03:25",
    "text": "The Trump administration is set to accept a luxury plane from the Qatari royal family that will be retrofitted and used as Air Force One during his second term, two people familiar with the agreement told CNN: cnn.it/4mcO4JE",
    "likes": 189,
    "reposts": 56
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T12:50:21",
    "text": "Top US officials emerge from China trade talks touting ‘substantial progress’ and a ‘deal’: cnn.it/3EPTbyG",
    "likes": 46,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T11:47:42",
    "text": "\"Kai is such a fighter\": Liev Schreiber shows his support for his trans daughter",
    "likes": 646,
    "reposts": 54
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T10:14:38",
    "text": "Another air traffic control equipment outage at Newark airport caused the FAA to implement a brief ground stop for inbound flights today",
    "likes": 232,
    "reposts": 88
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T10:11:47",
    "text": "Combs and Ventura’s longterm relationship, which played out between 2007 and 2018, is at the heart of the criminal case against him. \n\nVentura could be called to the witness stand during his trial as early as Monday. cnn.it/3Zbn5Ec",
    "likes": 35,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T09:02:50",
    "text": "\"Several of the key voter groups that provided President Donald Trump’s most important electoral gains in November are recoiling from him as his term moves past the 100-day mark. But it remains unclear how much Democrats can benefit from these growing doubts,\" writes Ronald Brownstein | Analysis",
    "likes": 95,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-11T06:29:40",
    "text": "The pontiff steps out onto the balcony of St. Peter's Basilica to deliver his first Sunday blessing since his election",
    "likes": 262,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T21:14:11",
    "text": "Russian President Vladimir Putin has proposed holding “direct talks” with Ukraine on Thursday in Istanbul, as European leaders and the United States attempt to put pressure on Moscow to agree to a 30-day ceasefire",
    "likes": 135,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T20:57:13",
    "text": "Researchers working to decipher the contents of a burned, still-rolled scroll uncovered both the author and the title of the text nearly 2,000 years after it was buried in the Mount Vesuvius eruption: cnn.it/42U4crX",
    "likes": 166,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T20:09:44",
    "text": "Tufts University student Rümeysa Öztürk arrives back home after spending six weeks at a Louisiana detention center.",
    "likes": 1240,
    "reposts": 180
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T18:58:43",
    "text": "Three members of Congress from New Jersey, along with protesters, faced off with Department of Homeland Security officers on Friday after visiting a local ICE detention facility.",
    "likes": 254,
    "reposts": 68
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T17:25:47",
    "text": "The future of habeas corpus has been pushed into the spotlight as President Donald Trump has been involved in discussions inside his administration over potentially taking the extreme step of suspending the procedure.",
    "likes": 176,
    "reposts": 86
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T16:16:43",
    "text": "Across the country, K-12 schools and universities have denied information to the public – even to parents of injured students – citing student privacy or FERPA, the Family Educational Rights and Privacy Act.",
    "likes": 62,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T15:54:21",
    "text": "Combs has pleaded not guilty to five counts, including one count of racketeering conspiracy, two counts of sex trafficking and two counts of transportation to engage in prostitution. If convicted, he could face a sentence of up to life in prison.",
    "likes": 64,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T15:29:20",
    "text": "Indian foreign secretary accuses Pakistan of violating ceasefire, Pakistan denies any violation of the agreement. \n\nFollow live updates.",
    "likes": 62,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T11:58:22",
    "text": "The morning after John Prevost watched his younger brother Robert become Pope Leo XIV, he received a familiar phone call.",
    "likes": 161,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T10:53:35",
    "text": "After months of contending with the Trump administration’s multipronged effort to downsize the federal workforce, government employees are now facing the possibility of another major change that could push even more of them out the door.",
    "likes": 120,
    "reposts": 44
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T10:10:55",
    "text": "Pope Leo XIV indicated that his papacy will follow closely in the footsteps of the late Pope Francis, telling church cardinals that they should take up that “precious legacy” and identifying artificial intelligence as a main challenge for working people and “human dignity.”",
    "likes": 517,
    "reposts": 85
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T09:41:58",
    "text": "A mild 4.1 magnitude earthquake in Tennessee was felt across the southeastern US, including in North Carolina and the Atlanta metropolitan area",
    "likes": 148,
    "reposts": 46
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T09:33:36",
    "text": "Many K-12 schools and universities have denied information to the public, citing student privacy – even when those details involve safety concerns or parents’ own children.",
    "likes": 48,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T08:47:04",
    "text": "There are more ways than ever to rub elbows with President Donald Trump and his inner circle — especially for those willing to pay.",
    "likes": 98,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T08:43:22",
    "text": "A Soviet-era spacecraft that was designed to make a soft landing on Venus – but instead remained trapped in Earth orbit for decades – likely fell from the sky early this morning, according to the European Space Agency: cnn.it/3RUXYBN",
    "likes": 144,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T08:18:05",
    "text": "BREAKING: India and Pakistan have agreed to a \"full and immediate ceasefire\" following a night of talks mediated by the US, President Trump says.\n\nFollow live updates: cnn.it/43eqa7W",
    "likes": 99,
    "reposts": 33
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T07:48:49",
    "text": "Ukraine and its European allies call for Russia to agree to a 30-day ceasefire, starting as early as Monday, after meeting in Kyiv",
    "likes": 235,
    "reposts": 42
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T06:31:06",
    "text": "US-China trade talks have begun in Geneva: cnn.it/4kbfq0N",
    "likes": 55,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T06:05:56",
    "text": "On Friday morning, West Coast port officials told CNN about a startling sight: Not a single cargo vessel had left China with goods for the two major West Coast ports in the past 12 hours. That hasn’t happened since the pandemic. cnn.it/3YA0Rf6",
    "likes": 1202,
    "reposts": 518
  },
  {
    "username": "CNN",
    "created_at": "2025-05-10T03:10:36",
    "text": "The US Postal Service Board of Governors announced that David Steiner, a board member at FedEx, will be the next postmaster general – a move that comes amid concerns the Trump administration will push for privatization of the independent government agency: cnn.it/3RUGOnR",
    "likes": 189,
    "reposts": 102
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T21:49:01",
    "text": "A federal judge is halting the Trump administration from carrying out, under a February executive order, mass firings or major reorganizations of multiple agencies going forward.",
    "likes": 526,
    "reposts": 108
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T21:19:58",
    "text": "President Trump has been involved in talks over potentially suspending habeas corpus, which allows people to challenge their detention, sources say.",
    "likes": 213,
    "reposts": 96
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T20:54:57",
    "text": "Newark Mayor Ras Baraka has been released from ICE custody after being arrested at an immigration detention center where he was protesting its opening. \n\nRead more: cnn.it/4jRo0lN",
    "likes": 695,
    "reposts": 139
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T20:09:50",
    "text": "Taylor Swift has been subpoenaed in the case between Blake Lively and Justin Baldoni.",
    "likes": 97,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T18:41:41",
    "text": "Tufts University student Rümeysa Öztürk has been released from an immigration detention center following a federal judge's order.",
    "likes": 1259,
    "reposts": 208
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T18:28:34",
    "text": "Researchers have found pages of a rare medieval manuscript masquerading as a cover and stitched into the binding of another book, according to experts at the Cambridge University Library in England. \n\nRead more: cnn.it/4m5ku8Z",
    "likes": 430,
    "reposts": 74
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T18:21:45",
    "text": "Lawmakers have until August to address the debt ceiling or the US could default on its obligations for the first time ever, Treasury Secretary Scott Bessent wrote to congressional leaders.",
    "likes": 73,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T17:02:03",
    "text": "Bill Gates is calling out fellow tech billionaire Elon Musk over cuts made to US government spending under his watch through DOGE, saying the gutting of USAID would lead to millions of deaths around the world.\n\nRead more: cnn.it/3GLyqVj",
    "likes": 804,
    "reposts": 203
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T16:40:35",
    "text": "The FDA has approved three new color additives from natural sources “that will expand the palette of available colors from natural sources for manufacturers to safely use in food,” the agency said.",
    "likes": 69,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T16:27:46",
    "text": "To get screened for cervical cancer, patients in the US may no longer need take the time off from work for an in-person doctor’s appointment.",
    "likes": 103,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T15:55:55",
    "text": "Newark Mayor Ras Baraka was arrested at an ICE Detention Center where he was protesting its opening, a federal prosecutor said.",
    "likes": 466,
    "reposts": 172
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T15:21:30",
    "text": "The Minnesota Timberwolves’ organization said there is an investigation ongoing involving a spectator who is accused of “making racially charged comments” toward Draymond Green during Minnesota’s Game 2 win.",
    "likes": 63,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T14:54:08",
    "text": "The Women’s World Cup will expand to 48 teams for the 2031 edition of the tournament, which could be hosted by the United States.\n\nRead more: cnn.it/44r8MyZ",
    "likes": 97,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T12:26:04",
    "text": "Like other major cities in America’s Rust Belt, Milwaukee has long been burdened by lead.",
    "likes": 46,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T11:54:34",
    "text": "Air traffic controllers handling flights in and out of Newark airport experienced another outage early Friday, sources say. cnn.it/3F0v93U",
    "likes": 102,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T11:11:29",
    "text": "CNN Exclusive: Trump’s son-in-law Jared Kushner is privately advising the administration ahead of the president’s trip to the Middle East.",
    "likes": 78,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T09:12:58",
    "text": "JUST IN: Retired Supreme Court Justice David H. Souter has died, the Supreme Court says. He was 85.",
    "likes": 80,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T08:12:30",
    "text": "JUST IN: President Trump says the US should lower its 145% tariff on most Chinese goods to 80% ahead of trade talks between the two countries this weekend. cnn.it/3EVJlLC",
    "likes": 156,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T08:04:08",
    "text": "Two internal reports obtained by CNN show the FAA was aware of the potential for communications issues between air traffic controllers and planes. CNN's @kyunglahcnn.bsky.social reports. \n\nRead the full story: cnn.it/42PeQ33",
    "likes": 193,
    "reposts": 73
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T07:09:27",
    "text": "The tariff fallout won’t just limit consumers’ choice — it will also stunt innovation and create winners and losers in the retail industry, companies and trade researchers say.",
    "likes": 120,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T06:37:09",
    "text": "Aviation experts told CNN that the conclusions in that report – as well as another report from 2024 that evaluated risks of air traffic controllers in two different locations struggling to coordinate – should raise questions about the agency’s safety analysis.",
    "likes": 206,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-09T05:22:43",
    "text": "JUST IN: Newly elected Pope Leo XIV celebrates his first eucharist at the Sistine Chapel. Follow live updates.",
    "likes": 153,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T21:52:16",
    "text": "President Donald Trump has finally gotten his first trade deal done. | Analysis",
    "likes": 128,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T21:33:24",
    "text": "In the latest development in the legal battle between Blake Lively and Justin Baldoni, Lively’s have confirmed that the actress intends to take the stand when the case heads to trial next year.",
    "likes": 90,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T20:06:49",
    "text": "Cardinal Robert Francis Prevost – now known as Pope Leo XIV — is the first pope from the United States.\n\nThe 69-year-old is known as a leader with global experience. He spent much of his career as a missionary in South America and most recently led a powerful Vatican office for bishop appointments.",
    "likes": 579,
    "reposts": 83
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T19:47:26",
    "text": "First lady Melania Trump honored one of her predecessors, the late first lady Barbara Bush, with the unveiling of a new US postage stamp at the White House Thursday, heralding Bush’s “forward-thinking vision” and 1990 call for a female president.",
    "likes": 133,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T19:09:12",
    "text": "President Donald Trump has announced that he’s appointing Fox News host and former prosecutor Jeanine Pirro the interim US attorney for Washington, DC, after his first pick faced what appeared to be insurmountable pushback from Republicans on Capitol Hill. cnn.it/3Sq6KHY",
    "likes": 64,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T18:34:51",
    "text": "The newly elected American pope, Robert Prevost, appears to have previously reposted social media posts critical of Vice President JD Vance and the immigration policies of President Donald Trump — views that were in line with his predecessor and could cause friction with the White House.",
    "likes": 598,
    "reposts": 79
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T18:25:16",
    "text": "President Donald Trump celebrated the news that Cardinal Robert Prevost has been elected as the first US-born pope. The pontiff will be known as Pope Leo XIV.",
    "likes": 47,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T18:20:48",
    "text": "Eighty years ago, Luciano \"Louis\" Graziano witnessed history when the Nazis surrendered. Now 102, he recalls what came next. cnn.it/4k5op4h",
    "likes": 157,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T18:12:21",
    "text": "Barry Keoghan finally got to meet Ringo Starr, who he is set to portray in the upcoming Beatles biopics, and the two “just sat in the garden chatting away” during the meeting.",
    "likes": 97,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T17:57:55",
    "text": "Once a senior adviser with a West Wing office and a broad portfolio, Ivanka Trump emerged for her first major public event of her father’s second term – this time, as a private citizen representing a private sector company.",
    "likes": 30,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T17:47:01",
    "text": "Former President Joe Biden blasted President Donald Trump’s first 100 days and defended his own performance as president during an appearance on ABC’s “The View,” his first live television interview since leaving the White House in January.",
    "likes": 182,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T17:31:28",
    "text": "Exclusive: A flurry of civil cases could await Sean \"Diddy\" Combs after his criminal trial.",
    "likes": 62,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T17:26:21",
    "text": "Are you a fan of cinnamon? A doctor explains why sprinkling some in your coffee is probably OK, but taking daily cinnamon supplements likely isn't. cnn.it/3H0rGCX",
    "likes": 42,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T17:11:50",
    "text": "A federal court has ruled that Alabama engaged in intentional discrimination when it refused to draw a congressional plan with a second Black majority district after courts, including the Supreme Court, repeatedly rejected maps with just one such district.",
    "likes": 929,
    "reposts": 239
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T16:57:34",
    "text": "Leo is now tied for the fourth most common name chosen by popes, along with Clement. Only John, Gregory and Benedict have proven more popular.\n\nBut we haven’t had a Pope Leo in more than a century.",
    "likes": 114,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T16:44:45",
    "text": "A Palestinian student arrested during an interview about finalizing his US citizenship helped launch a $1 million fundraising campaign to strengthen the legal safety net for immigrants in Vermont on Thursday, a week after a federal judge freed him from custody.",
    "likes": 2183,
    "reposts": 604
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T16:20:17",
    "text": "President Donald Trump is considering naming Fox News host and former prosecutor Jeanine Pirro as the acting US attorney for Washington, DC, two sources familiar with the matter confirmed to CNN.",
    "likes": 60,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T15:57:29",
    "text": "One of the Pacific Ocean's lesser-known volcanoes will blow its vent in the coming months, causing 10,000 earthquakes in one day. Here's what scientists are saying. cnn.it/4iTyC1Y",
    "likes": 238,
    "reposts": 84
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T15:49:47",
    "text": "Senate Democrats blocked a first-of-its-kind bill aimed at regulating cryptocurrency in the US amid Democratic concerns over President Donald Trump’s cryptocurrency dealings.\n\nThe vote came after months of intense negotiations between Democrats and Republicans.",
    "likes": 164,
    "reposts": 38
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T15:27:25",
    "text": "Almost anyone who has used the internet has probably experienced a window popping up and claiming that your device has a virus, encouraging you to click for tech support or security software. It’s a common online scam, and one that Google is aiming to fight more aggressively using AI. cnn.it/44pmLp1",
    "likes": 87,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T15:15:33",
    "text": "Cardinal Robert Francis Prevost, 69, from Chicago, is the first ever pope from the US. He will be known as Leo XIV.\n\nA leader with global experience, he spent much of his career as a missionary in South America and most recently led a powerful Vatican office for bishop appointments. cnn.it/4ddrlsO",
    "likes": 961,
    "reposts": 205
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T14:55:50",
    "text": "The acting administrator of FEMA has been fired one day after he broke with fellow members of the administration when he told lawmakers he does not support dismantling the agency, a Department of Homeland Security spokesperson confirmed to CNN.",
    "likes": 314,
    "reposts": 118
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T14:50:47",
    "text": "Cardinal Robert Prevost, of the United States, has been elected as the 267th pope of the Catholic Church and the first American pontiff in history.\n\nHe will be known as Leo XIV.",
    "likes": 241,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T14:33:35",
    "text": "Josaia Raisuqe, who won the men’s rugby sevens silver medal with Fiji at the Paris 2024 Olympics, has died, his club Castres Olympique said in a statement. He was 30 years old. cnn.it/432EOij",
    "likes": 32,
    "reposts": 2
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T14:22:24",
    "text": "President Trump says he'll announce a new nominee for DC's top prosecutor after his first controversial pick faced key GOP pushback on Capitol Hill.",
    "likes": 79,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T13:23:29",
    "text": "The new pope is revealed as Robert Prevost of the US, the first American pontiff in history.\n\nHe'll be known as Pope Leo XIV.\n\nFollow live updates: cnn.it/3RXX7QN",
    "likes": 502,
    "reposts": 145
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T12:48:02",
    "text": "White smoke has risen above the Sistine Chapel, the signal that cardinals have chosen a new pope on the second day of the conclave.\n\nHis identity, and the name he will take as pontiff, will be revealed soon.\n\nFollow live updates: cnn.it/4kcWyi1",
    "likes": 188,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T12:22:54",
    "text": "A new pope has been elected to lead the Catholic Church. His identity will be revealed shortly. Follow live updates.",
    "likes": 130,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T11:48:31",
    "text": "By end of the week, a jury is expected to be seated in the federal sex trafficking trial of Sean “Diddy” Combs.\n\nIt’s a stunning turn of events for the once kingmaker in music, a man who reached billionaire status as a rapper, producer and entrepreneur.",
    "likes": 37,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T11:04:08",
    "text": "The House has passed a Republican-led bill that would rename the Gulf of Mexico to the Gulf of America, moving a step closer to codifying President Donald Trump’s push to rename the body of water.",
    "likes": 56,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T10:06:32",
    "text": "NOAA will stop updating a key disasters database that has publicly tracked the cost of extreme weather and climate events: cnn.it/3YzP7ZW",
    "likes": 195,
    "reposts": 125
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T09:38:11",
    "text": "Universities across the country are scrambling to comply with President Donald Trump’s anti-diversity push in an effort to hold on to hundreds of millions of dollars in federal grants that fund critical medical research.",
    "likes": 79,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T08:54:56",
    "text": "Bill Gates announced new plans to distribute “virtually all” of his wealth — around $200 billion, he estimates — within the next 20 years.",
    "likes": 859,
    "reposts": 153
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T07:43:52",
    "text": "Trump says he will announce a trade deal with the UK today, the first major pact since the US imposed high tariffs on trading partners.",
    "likes": 37,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T06:12:46",
    "text": "As one of the last federal agencies to face major changes in President Trump’s norm-bending second term, the CIA is bracing for significant cuts and a reorganization that seeks to elevate covert operations by hiring more officers to go in the field and fewer analysts to sit behind computer screens.",
    "likes": 52,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T06:11:28",
    "text": "President Donald Trump is laser-focused on securing high-value critical minerals for the United States, whether through pushing to buy Greenland or demanding a share of Ukraine’s resources. But there’s another — and possibly far more dangerous — place where he now seeks them: the ocean depths.",
    "likes": 65,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T06:00:57",
    "text": "JUST IN: Black smoke rises from the Sistine Chapel as cardinals fail to agree on a new pope after two more rounds of voting. They'll meet again shortly.",
    "likes": 106,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T05:27:51",
    "text": "The film — released in cinemas today and available to stream globally on Disney+ and Hulu in June — coincides with Attenborough’s 99th birthday, and describes how the ocean has changed during his lifetime.",
    "likes": 350,
    "reposts": 67
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T05:00:23",
    "text": "A priceless treasure trove of biodata gathered from generations of Americans by Harvard University researchers may soon be lost due to additional funding cuts by the Trump administration, a leading nutrition researcher told CNN.",
    "likes": 115,
    "reposts": 62
  },
  {
    "username": "CNN",
    "created_at": "2025-05-08T04:32:55",
    "text": "Pakistan claims it downed 12 Indian drones overnight in what it calls a new \"serious provocation.\" cnn.it/3EJ160H",
    "likes": 56,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T21:14:37",
    "text": "More than 1,000 measles cases have been reported in the United States in 2025, according to a CNN tally. \n\nDetails: cnn.it/4daNRCL",
    "likes": 775,
    "reposts": 347
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T21:04:07",
    "text": "Multiple people were taken into custody after a crowd of pro-Palestinian demonstrators tried to force their way into a campus library, officials say. \n\nRead more: cnn.it/4k8O37G",
    "likes": 105,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T20:08:48",
    "text": "Trump's sweeping agenda bill has hit a wall as a divided Republican conference battles over reshaping Medicaid.",
    "likes": 231,
    "reposts": 63
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T19:51:51",
    "text": "Chief Justice John Roberts stressed the importance of judicial independence during public remarks, noting that the judiciary’s role as a co-equal branch of government is central to the nation’s political system.",
    "likes": 294,
    "reposts": 64
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T19:12:03",
    "text": "Days into Harvey Weinstein‘s first sexual assault trial in 2020, prosecutors privately spoke for the first time with a former model who alleged that he had forced oral sex on her.",
    "likes": 105,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T17:57:14",
    "text": "The sightseeing helicopter that plunged in the Hudson River and killed six people in April “suddenly separated into three major sections,” a preliminary report from the NTSB found.",
    "likes": 68,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T17:29:18",
    "text": "Paris Saint-Germain defeated Arsenal 2-1 on the night and 3-1 on aggregate to earn a date against Inter Milan in the final in Munich’s Allianz Arena. Les Parisiens move on but Arsenal didn’t go out quietly. \n\nDetails: cnn.it/43iwa0p",
    "likes": 55,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T16:55:48",
    "text": "Exclusive: When President Donald Trump descends on the Kennedy Performing Arts Center next month for a high-dollar fundraiser and a performance of \"Les Misérables,\" he won't be seeing the usual cast performing, sources told CNN. \n\nRead more: cnn.it/3Yy52rH",
    "likes": 394,
    "reposts": 83
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T16:18:13",
    "text": "A qualified pool of 45 prospective jurors was secured for the jury selection process in the Sean “Diddy” Combs sex-trafficking trial.",
    "likes": 56,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T15:33:46",
    "text": "Three former Memphis officers have been acquitted of state charges, including second-degree murder, in the fatal beating of Tyre Nichols after he ran away from a traffic stop in 2023. \n\nRead more: cnn.it/4m4Tmqz",
    "likes": 62,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T15:09:13",
    "text": "Black smoke rose from the chimney of the Sistine Chapel on Wednesday, meaning that cardinals did not elect a new pope on the first day of the conclave. \n\nRead more: cnn.it/4k0VMEA",
    "likes": 185,
    "reposts": 33
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T15:06:15",
    "text": "Families of October 7 hostages held in Gaza demand to know how many are still alive after President Trump said three more captives had died.",
    "likes": 62,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T14:48:43",
    "text": "Ford is hiking the sticker prices for the three US models it imports from Mexico by up to $2,000 each, just days after executives said they didn’t expect significant increases in industrywide car prices this year. \n\nRead more: cnn.it/44Yvi2k",
    "likes": 256,
    "reposts": 75
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T13:57:52",
    "text": "A 32-year-old Palestinian resident in New Jersey, was taken into custody by immigration officers on March 13 during a voluntary check-in with immigration officials in Newark.",
    "likes": 99,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T13:08:38",
    "text": "The country – made up of 29 atolls and five main islands in the North Pacific – is shining a light on the struggles it faces by turning to an unlikely source: Soccer.",
    "likes": 42,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T11:54:34",
    "text": "The doors of the Sistine Chapel are slammed shut as cardinals begin the process to choose a new pope.\n\nFollow live updates.",
    "likes": 115,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T11:15:45",
    "text": "Analysis: Voice of America is off the air for now, having been gutted by President ﻿Donald Trump, but it may soon return — partly as a vessel for one of his favorite MAGA propaganda outlets.",
    "likes": 89,
    "reposts": 45
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T10:41:23",
    "text": "To report a fuller picture of Abrego Garcia’s life not presented in court documents or descriptions from his lawyers, CNN spoke to more than a dozen people who know him.",
    "likes": 124,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T09:21:13",
    "text": "Former President Joe Biden criticized President Donald Trump for suggesting Ukraine may have to give up territory in exchange for peace, calling it a “modern-day appeasement”",
    "likes": 377,
    "reposts": 64
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T06:25:09",
    "text": "In the weeks since Kilmar Abrego Garcia’s mistaken deportation to El Salvador, the federal government and his family have presented divergent portraits of the man who has become the face of President Donald Trump’s crackdown against immigration.",
    "likes": 113,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T02:39:20",
    "text": "The time has come. Starting Wednesday, passengers nationwide must use a state-issued ID or license that is “REAL ID” compliant to travel within the US.",
    "likes": 115,
    "reposts": 46
  },
  {
    "username": "CNN",
    "created_at": "2025-05-07T02:01:21",
    "text": "The air traffic system meltdown at Newark Liberty International Airport last week “was the most dangerous situation you could have,” according to an air traffic controller on duty that day, as the fallout from the outage stretches into a second week.",
    "likes": 245,
    "reposts": 93
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T22:09:16",
    "text": "Trump’s top trade officials will meet with their Chinese counterparts this week to discuss a de-escalation of their increasingly damaging trade war.",
    "likes": 95,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T21:03:21",
    "text": "Motown singing legend Smokey Robinson has been accused of sexual assault by four women who used to work for him, according to a workplace harassment complaint filed at a Los Angeles courthouse.",
    "likes": 66,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T20:21:40",
    "text": "In an unassuming industrial park 30 miles outside Boston, engineers are building a futuristic machine to replicate the energy of the stars.",
    "likes": 111,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T19:39:44",
    "text": "Two top Trump officials will meet with Chinese representatives this week, signaling an openness to trade negotiations.",
    "likes": 77,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T19:05:16",
    "text": "WeightWatchers, the 62-year-old program that revolutionized dieting for millions of people around the world, has filed for bankruptcy. \n\nDetails: cnn.it/4k221rL",
    "likes": 1896,
    "reposts": 409
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T18:43:22",
    "text": "JUST IN: Pakistan's military tells CNN it shot down two Indian Air Force aircraft after India said it struck sites in Pakistan and Pakistan-administered Kashmir.\n\nFollow live updates: cnn.it/4jB7beC",
    "likes": 289,
    "reposts": 113
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T18:04:24",
    "text": "Inter Milan completes a stunning comeback, beating Barcelona in an all-time classic to earn a spot in the Champions League final. \n\nRead more: cnn.it/4jLo0DQ",
    "likes": 261,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T17:37:05",
    "text": "In the second such incident in less than a month, two airline planes clipped wings at a US airport, this time in San Francisco, according to the FAA.",
    "likes": 752,
    "reposts": 299
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T17:04:00",
    "text": "India said early Wednesday it had launched a military operation against Pakistan in a major escalation of tensions between the two neighbors. \n\nRead more: cnn.it/42MuwEn",
    "likes": 166,
    "reposts": 82
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T16:52:24",
    "text": "Mahendra Patel, who is facing attempted kidnapping and other charges after a mother accused him of trying to grab her 2-year-old son from her at a Georgia Walmart, has been granted a $10,000 bond after being held in a Cobb County jail for 45 days.",
    "likes": 62,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T16:16:35",
    "text": "Speaker Mike Johnson is running into some resistance from fellow House Republicans on a bill to codify President Donald Trump’s push to rename the Gulf of Mexico.",
    "likes": 217,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T15:57:26",
    "text": "The FDA has named Dr. Vinay Prasad, a hematologist oncologist, to lead its Center for Biologics Evaluation and Research, the division that oversees vaccines and biologic medicines.\n\nRead more: cnn.it/44qHk4l",
    "likes": 32,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T15:10:24",
    "text": "The fate of three former Memphis police officers charged in the beating of Tyre Nichols was in the hands of 12 people who do not live in the city as jury deliberations began.",
    "likes": 83,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T14:38:15",
    "text": "The Supreme Court said the Trump administration can begin immediately enforcing a ban on transgender service members in the military.\n\nRead more: cnn.it/4m9fdx6",
    "likes": 78,
    "reposts": 33
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T13:50:27",
    "text": "Ships now pulling into US harbors from China are the first to be subject to the massive tariffs that America is imposing on most Chinese imports. Many of them are half full.\n\nThat means, in a matter of weeks, consumers will face higher prices and shortages of certain items.",
    "likes": 346,
    "reposts": 132
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T13:19:20",
    "text": "Tesla sales were down sharply in April in the United Kingdom, the Netherlands, Denmark and Portugal, as well Sweden and France, according to monthly sales figures.\n\nJust like in the United States, Tesla CEO Elon Musk’s politics has inspired backlash and protests across Europe.",
    "likes": 429,
    "reposts": 79
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T12:57:22",
    "text": "Canadian PM Carney tells President Trump that his country \"won't be for sale, ever\" ahead of their critical meeting to discuss mounting trade tensions. \n\nFollow live updates.",
    "likes": 245,
    "reposts": 39
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T11:51:01",
    "text": "Key GOP senator says he won't support Ed Martin as top DC prosecutor, putting nomination in doubt. Trump has been lobbying for his controversial pick.",
    "likes": 134,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T11:11:30",
    "text": "Andre 3000 may have pulled off one of the most fashionable product reveals of all time. cnn.it/3GHDKsU",
    "likes": 119,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T10:25:54",
    "text": "Germany's Friedrich Merz wins a parliamentary vote to become chancellor at the second attempt, just hours after an unprecedented defeat",
    "likes": 132,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T10:01:25",
    "text": "The Trump administration is preparing to eliminate two key EPA divisions, including its consumer-facing Energy Star program, sources say.",
    "likes": 106,
    "reposts": 83
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T06:11:40",
    "text": "The Trump administration’s interest in Greenland appears to be part of what Washington sees as a broader competition for power in the Arctic, where Russia is a dominant force and China aspires to expand its footprint and capabilities.",
    "likes": 65,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T05:30:17",
    "text": "A Credit Suisse unit has pleaded guilty to US charges of helping ultra-wealthy Americans evade taxes and will pay a fine of more than $510 million. cnn.it/4d7RKrZ",
    "likes": 386,
    "reposts": 117
  },
  {
    "username": "CNN",
    "created_at": "2025-05-06T02:03:56",
    "text": "Air traffic controllers in Philadelphia Terminal Radar Approach Control had been guiding planes to Newark Liberty International Airport in New Jersey last week when communication went down.",
    "likes": 150,
    "reposts": 56
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T22:19:55",
    "text": "Two vehicles collided head-on and burst into flames on a two-lane highway in rural eastern Kansas, killing eight people, authorities say: cnn.it/3GBLBbd",
    "likes": 52,
    "reposts": 13
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T21:52:06",
    "text": "Former US Vice President Mike Pence says Russian President Vladimir Putin \"doesn't want peace.\" See more from his interview with @kaitlancollins.bsky.social: cnn.it/3YwvXnO",
    "likes": 947,
    "reposts": 166
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T20:27:46",
    "text": "A phone app that Mike Waltz apparently used to save his text messages has temporarily suspended its services as it investigates a cybersecurity incident, a spokesperson for the app’s parent company told CNN.",
    "likes": 287,
    "reposts": 76
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T18:58:14",
    "text": "The Trump administration unveiled new steps to target federal funding to Harvard University, announcing that it is cutting off all new federal research grants.",
    "likes": 65,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T17:08:33",
    "text": "Former Vice President Mike Pence rebuffs President Trump on tariffs, Russia and pardons for January 6 rioters in a new CNN interview.",
    "likes": 356,
    "reposts": 72
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T16:31:52",
    "text": "Secretary of Defense Pete Hegseth has ordered the Pentagon to cut the number of four-star generals and admirals by at least 20%.",
    "likes": 134,
    "reposts": 60
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T15:47:06",
    "text": "Brendan Carr, the top communications regulator, doesn’t view his investigation into CBS as “a threat” to the broadcaster.",
    "likes": 114,
    "reposts": 31
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T15:06:08",
    "text": "OpenAI will remain under the control of a non-profit, the startup at the heart of the generative AI boom said, months after it outlined plans to revamp its structure.",
    "likes": 50,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T14:56:58",
    "text": "Israel strikes Houthi targets in Yemen for the first time in months. The attacks come a day after a ballistic missile hit an airport in Tel Aviv.",
    "likes": 63,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T14:11:47",
    "text": "CNN's Kaitlan Collins speaks with former Vice President Mike Pence about President Donald Trump's second term in office, and whether Americans will buy the president's argument that children will have to make do with fewer toys. cnn.it/4jJAega",
    "likes": 91,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T13:25:11",
    "text": "Americans still don’t know how and when to wash their hands",
    "likes": 355,
    "reposts": 70
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T12:28:56",
    "text": "The European Union will spend €500 million ($567 million) over the next three years “to make Europe a magnet for researchers,” a top official announced in a veiled response to the Trump administration’s cuts to research funding and changes to science policy.",
    "likes": 309,
    "reposts": 68
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T11:49:10",
    "text": "A new study found that the immunotherapy treatment worked against some types of cancers, allowing patients to avoid surgery and other types of more invasive treatment to cure their disease.",
    "likes": 167,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T11:26:36",
    "text": "CNN's Elie Honig breaks down the jury selection process in the Sean \"Diddy\" Combs trial, weighing on what each side will be looking for as the proceeding gets underway. cnn.it/3GDVKUZ",
    "likes": 40,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T11:05:16",
    "text": "President Donald Trump, the dealmaker-in-chief, has said for weeks that at least one trade deal is imminent with one of the dozens of countries in active negotiations with the United States to avoid punishing tariffs. So where is it?",
    "likes": 254,
    "reposts": 65
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T10:43:03",
    "text": "President Donald Trump said in a social media post Sunday that he is directing the Bureau of Prisons to rebuild and reopen Alcatraz, the infamous former prison, as a place to “house America’s most ruthless and violent Offenders.”",
    "likes": 72,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T10:00:26",
    "text": "UN's top court dismisses Sudan's case alleging the United Arab Emirates was complicit in genocide by supporting paramilitary forces in Darfur region",
    "likes": 22,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T09:30:59",
    "text": "Maryland Gov. Wes Moore is part of a chorus of Democratic leaders putting forward a vision for how the party should take on Donald Trump as the president plows ahead with his second-term agenda.",
    "likes": 179,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T07:57:35",
    "text": "Those who have followed Berkshire Hathaway have long-anticipated that the day would come when legendary investor and CEO Warren Buffett called it quits.",
    "likes": 72,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-05T06:15:20",
    "text": "At least one Temple University student has been suspended after an antisemitic incident at a Philadelphia sports bar owned by Barstool Sports founder Dave Portnoy, the school said.",
    "likes": 53,
    "reposts": 10
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T22:04:20",
    "text": "President Donald Trump extended his trade war to the cinema.\n\nTrump, in an evening post on his social media platform Truth Social, said he has instructed the Commerce Department and US Trade Representative to place a 100% tariff on films that are produced outside the US and imported into America.",
    "likes": 241,
    "reposts": 90
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T21:06:33",
    "text": "One of Pope Francis’ “popemobiles” is being transformed into a mobile healthcare unit for children and sent to the Gaza Strip, the Vatican’s official media outlet said on Sunday. cnn.it/3GG2TnN",
    "likes": 1269,
    "reposts": 211
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T19:59:35",
    "text": "Bands in Mexico are self-censoring their ballads about the drug underworld out of fear of being blocked from touring the US, in a development that experts say raises troubling questions about free speech in America.",
    "likes": 157,
    "reposts": 40
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T19:05:22",
    "text": "President Vladimir Putin said in remarks published on Sunday that Russia had sufficient strength and resources to take the war in Ukraine to its logical conclusion, though he hoped that there would be no need to use nuclear weapons.",
    "likes": 172,
    "reposts": 83
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T18:03:17",
    "text": "At a time when some men are finding community in toxic parts of the “manosphere,” men’s circles offer another, more positive model of masculinity. cnn.it/42FMFUa",
    "likes": 160,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T17:10:30",
    "text": "Marvel’s “Thunderbolts” electrified the box office, beating expectations with $76 million in domestic sales this weekend.",
    "likes": 184,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T16:03:02",
    "text": "An attack by inmates at a Virginia prison injured five guards, according to state corrections officials who said most of the assailants were MS-13 gang members who entered the US illegally.",
    "likes": 75,
    "reposts": 23
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T14:58:19",
    "text": "French police have rescued the father of a cryptocurrency entrepreneur from his kidnappers, but found he'd had one of his fingers severed. It's the latest in a spate of abductions tied to cryptocurrency: cnn.it/4iJDoPC",
    "likes": 168,
    "reposts": 51
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T13:47:01",
    "text": "Gigi Hadid marks 30th birthday bash by going Instagram official with Bradley Cooper: cnn.it/3EVSPX9",
    "likes": 69,
    "reposts": 6
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T13:05:56",
    "text": "The Department of Education restarts collections of loans in default on Monday, putting millions of borrowers at risk of having their benefits and wages garnished. Here's what we know so far: cnn.it/430PfTy",
    "likes": 81,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T12:35:12",
    "text": "He’s been in jail for 43 days, accused of trying to abduct a kid at Walmart. His lawyer argues video shows he’s innocent: cnn.it/3Yxy9vk",
    "likes": 120,
    "reposts": 30
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T11:18:03",
    "text": "BREAKING: Brazilian police say they thwarted a bomb attack planned for Lady Gaga’s historic concert that drew an estimated 2 million people to Copacabana Beach in Rio de Janeiro on Saturday: cnn.it/3SkMpE0",
    "likes": 245,
    "reposts": 61
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T11:01:56",
    "text": "Lady Gaga back on the charts? Coupons and canned good displays at grocery stores? The return of knee-high Converse sneakers? If you believe social media, \"recession indicators\" are everywhere: cnn.it/3RJE3FQ",
    "likes": 58,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T10:08:05",
    "text": "Katie Ledecky breaks 800m freestyle world record almost a decade after last setting it: cnn.it/3Gym7vA",
    "likes": 449,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T09:39:14",
    "text": "\"We have 50 years\": The man on a mission to save Venice from the waves cnn.it/4k6hp6I",
    "likes": 171,
    "reposts": 37
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T08:24:51",
    "text": "President Donald Trump posted an AI-generated image of himself dressed as pope as the mourning of Pope Francis continues and just days before the conclave to elect his successor is set to begin, drawing rebukes from a group representing Catholic bishops in New York and among Italians: cnn.it/3Ytfm4c",
    "likes": 347,
    "reposts": 90
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T07:27:33",
    "text": "Since President Donald Trump took office, the IRS has churned through four acting leaders and spiraled into turmoil, while the president’s pick for full-time commissioner waits for a Senate confirmation hearing: cnn.it/4m1uBLJ",
    "likes": 136,
    "reposts": 50
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T06:31:11",
    "text": "Hawaii lawmakers passed first-of-its-kind legislation that will increase the state’s lodging tax to raise money for environmental protection and strengthening defenses against climate change-fueled natural disasters: cnn.it/3Yq5ubt",
    "likes": 490,
    "reposts": 61
  },
  {
    "username": "CNN",
    "created_at": "2025-05-04T00:08:17",
    "text": "Voice of America’s fate still in flux after appeals court pauses back-to-work orders: cnn.it/4jF83z5",
    "likes": 187,
    "reposts": 42
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T21:29:51",
    "text": "A small plane crashed into two homes in Simi Valley, California, leaving one person in the plane dead and damaging both homes, authorities said.",
    "likes": 104,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T20:56:55",
    "text": "A Guatemalan woman who had just given birth at an Arizona hospital was swiftly taken into ICE  custody before being released as she faces deportation proceedings.",
    "likes": 232,
    "reposts": 96
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T20:27:04",
    "text": "Bookstores are vital social capital too — third spaces where strangers mix.\n\nBut there is also an awareness among many booksellers today that books alone may not be enough of a draw for customers to take the time to visit. \n\nRead more: cnn.it/4lUt8H3",
    "likes": 137,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T19:21:19",
    "text": "Sovereignty crosses the finish line first in the 151st Kentucky Derby: cnn.it/43cEr61",
    "likes": 224,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T17:53:52",
    "text": "Doctors Without Borders, also known as Médecins Sans Frontières (MSF), condemned the early morning attack on its hospital in Old Fangak, Jonglei State, in the northeast of the country.\n\nMSF said helicopter gunships dropped a bomb on their pharmacy and fired on the town for 30 minutes.",
    "likes": 253,
    "reposts": 87
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T14:44:12",
    "text": "Warren Buffett says he will ask the Berkshire Hathaway board to replace him as CEO with his hand-picked successor, Greg Abel, at the end of the year. cnn.it/4iWe3Co",
    "likes": 274,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T13:42:19",
    "text": "The initiative to deliver aid comes as a total Israeli blockade of aid deliveries to the Palestinian enclave approaches its third month, and after US President Donald Trump told Israeli Prime Minister Benjamin Netanyahu late last month that “we’ve got to be good to Gaza.”",
    "likes": 85,
    "reposts": 29
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T12:42:25",
    "text": "Couples can work on restoring intimacy and connection by recognizing signs of relationship burnout and taking steps to address the problem, experts say.",
    "likes": 69,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T11:34:27",
    "text": "The insatiable hunger for chicken, mainly nuggets and tenders, has forced McDonald’s, Taco Bell and Wendy’s to adjust their offerings and invest more heavily in the category as consumers, well, eat mor chikin.",
    "likes": 74,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T09:59:25",
    "text": "\"Trade should not be a weapon\": Warren Buffett weighs in on tariffs at annual Berkshire Hathaway meeting cnn.it/4iI002T",
    "likes": 286,
    "reposts": 62
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T07:47:44",
    "text": "Astronomers have been trying to determine the cosmic origins of the heaviest elements, like gold, for decades. New research based on a signal uncovered in archival space mission data may point to a potential clue: cnn.it/4jNtEoT",
    "likes": 96,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T07:00:34",
    "text": "How Elon Musk's companies rely on government contracts and the ethical questions that follow | Analysis: cnn.it/3ShlwRg",
    "likes": 241,
    "reposts": 89
  },
  {
    "username": "CNN",
    "created_at": "2025-05-03T06:24:44",
    "text": "A new round of auto tariffs – this time on parts – coming into effect Saturday could upend the auto industry, even more than previous levies on imported cars: cnn.it/4cYqdZQ",
    "likes": 302,
    "reposts": 109
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T21:17:40",
    "text": "President Donald Trump appeared to dismiss growing concerns that his economic policies could cause a recession, telling NBC News that the economy would be “OK” in the long term even if a recession happens in the near future.",
    "likes": 178,
    "reposts": 52
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T20:36:34",
    "text": "Tim Friede, a man who injected himself with snake venom, helped create an antivenom that can protect mice from poisonous snakes. Researchers hope for human clinical trials one day. \n\nRead more: cnn.it/42Z110C",
    "likes": 143,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T19:29:15",
    "text": "The lawsuits mark the administration’s latest attack on climate action in the name of “energy dominance” and has raised fears about states’ ability to pursue action against polluters.",
    "likes": 136,
    "reposts": 55
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T19:01:54",
    "text": "A pickup truck and a tour van collided on a highway leading to Yellowstone National Park, leaving seven people dead and eight others injured, Idaho State Police said.",
    "likes": 83,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T17:49:14",
    "text": "A remarkable exchange played out on X as Marco Rubio accused the government of key ally Germany of “tyranny in disguise” for designating the far-right Alternative for Germany (AfD) as an extremist entity.",
    "likes": 467,
    "reposts": 146
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T16:55:37",
    "text": "President Donald Trump's administration has urged the Supreme Court to allow Elon Musk's Department of Government Efficiency to access Social Security Administration data on hundreds of millions of Americans.\n\nDetails: cnn.it/4m61w1Z",
    "likes": 205,
    "reposts": 78
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T16:28:46",
    "text": "US stocks rose Friday and the S&P 500 notched its longest winning streak since 2004 as China signaled openness to trade talks and investors digested a better-than-expected jobs report.\n\nRead more: cnn.it/44lddLK",
    "likes": 47,
    "reposts": 8
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T15:44:35",
    "text": "Household appliance maker SharkNinja is recalling roughly 1.8 million pressure cookers due to reports of burn injuries, according to a US Consumer Product Safety Commission notice. \n\nRead more: cnn.it/4lXNoHZ",
    "likes": 65,
    "reposts": 27
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T15:31:19",
    "text": "Tennessee state law enforcement released video showing a 2022 traffic stop involving Kilmar Abrego Garcia, one of the incidents the Trump administration officials have used to justify the removal of the Maryland man who the government has admitted was wrongly deported to El Salvador in March.",
    "likes": 99,
    "reposts": 32
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T15:20:38",
    "text": "CNN spoke to multiple cardinals and other church sources for this article. While some cardinals would prefer a safer option who focuses on unity, one who worked closely with Francis said such a choice would be the “kiss of death” for the church. cnn.it/44m2vVk",
    "likes": 59,
    "reposts": 15
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T14:24:48",
    "text": "An Illinois landlord has been sentenced to 53 years in prison in a hate-crime attack that left a 6-year-old Palestinian-American boy dead.",
    "likes": 272,
    "reposts": 47
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T14:11:18",
    "text": "San Antonio Spurs head coach Gregg Popovich – the NBA’s all-time winningest head coach – has made the decision to leave the team’s sideline after 29 seasons. cnn.it/3SiBD12",
    "likes": 257,
    "reposts": 36
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T13:48:57",
    "text": "On Saturday, the 283 registered voters who live here — almost all of them SpaceX employees — will decide whether to incorporate as a Type-C municipality and elect a small city. cnn.it/4jTR0ZA",
    "likes": 52,
    "reposts": 22
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T13:03:26",
    "text": "Britain’s Prince Harry says his father, King Charles, no longer speaks to him, and that he would “love reconciliation” with the royal family. cnn.it/4lTW95X",
    "likes": 122,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T12:29:53",
    "text": "As Harvard University students hunker down for spring semester finals, dozens of students rallied on campus on Tuesday urging the school’s leadership to hold firm in their fight with the Trump administration.",
    "likes": 321,
    "reposts": 54
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T11:48:41",
    "text": "Once seen as a producer of clumsy knock-offs, Chinese carmakers have catapulted to the forefront of the growing global EV industry.",
    "likes": 112,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T11:28:25",
    "text": "OpenAI has withdrawn an update that made ChatGPT “annoying” and “sycophantic,” after users shared screenshots and anecdotes of the chatbot showering them with over-the-top praise.",
    "likes": 68,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T10:43:55",
    "text": "In the room with a man from one of the most powerful and feared criminal networks in the world: cnn.it/4jXsqH8",
    "likes": 31,
    "reposts": 1
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T09:26:56",
    "text": "Prince Harry loses appeal against the British government's decision to downgrade his security arrangements while in the UK: cnn.it/44DVakb",
    "likes": 104,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T09:17:55",
    "text": "The US economy added a stronger-than-expected 177,000 jobs in April despite swirling recession fears: cnn.it/4iGLd8V",
    "likes": 45,
    "reposts": 11
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T08:36:37",
    "text": "Trump says Harvard University will be stripped of its tax-exempt status, the latest move in a fight over free speech, politics and federal funding",
    "likes": 211,
    "reposts": 91
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T08:02:30",
    "text": "Left in limbo: How federal workers still on the job are coping with chaos and deep uncertainty",
    "likes": 162,
    "reposts": 47
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T07:08:58",
    "text": "President Donald Trump announces that he wants to rename Veterans Day to “Victory Day for World War I”: cnn.it/3Z0Ti0W",
    "likes": 82,
    "reposts": 40
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T05:56:18",
    "text": "German spy agency classifies the far-right Alternative for Germany as an extremist entity that threatens democracy: cnn.it/4k2Tlle",
    "likes": 401,
    "reposts": 73
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T05:47:00",
    "text": "Diversity, equity and inclusion (DEI) has been losing with corporate America, with one big exception: the people who actually own the companies. cnn.it/44OgrYb",
    "likes": 1162,
    "reposts": 180
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T05:17:35",
    "text": "Tariffs could add $900 million to Apple’s costs this quarter, Apple CEO Tim Cook said, as he revealed the tech giant was shifting production of iPhones sold in the United States from China to India.",
    "likes": 128,
    "reposts": 34
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T04:50:52",
    "text": "JUST IN: Comedian and actor Russell Brand has arrived at a London court to face charges of rape and sexual assault against four women.",
    "likes": 106,
    "reposts": 20
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T02:14:10",
    "text": "President Donald Trump signed an executive order directing the Corporation for Public Broadcasting to end federal funding for America’s two biggest public broadcasters, which have faced a series of attacks from the White House and Republican lawmakers accusing them of biased reporting.",
    "likes": 157,
    "reposts": 103
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T01:47:59",
    "text": "House Republicans are starting to put some meat on the bones of their sweeping tax and spending cuts package, otherwise known as President Donald Trump’s “big, beautiful bill.”",
    "likes": 50,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T01:45:40",
    "text": "Robert F. Kennedy Jr., secretary of the US Department of Health and Human Services, is asking the CDC for an agencywide “scientific process” on treating measles and other conditions with medications as well as alternative therapies such as vitamins, HHS said in a statement.",
    "likes": 124,
    "reposts": 42
  },
  {
    "username": "CNN",
    "created_at": "2025-05-02T01:10:47",
    "text": "China says it is “currently assessing” proposals by the United States to begin trade talks, in a subtle tone shift that could open the door for negotiations.",
    "likes": 94,
    "reposts": 16
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T22:20:19",
    "text": "China says it is “currently assessing” proposals by the United States to begin trade talks: cnn.it/3YW7VTg",
    "likes": 124,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T20:55:41",
    "text": "Young Democrats are stepping up to challenge incumbents as party members feel current leaders rely on an outdated political playbook.",
    "likes": 604,
    "reposts": 82
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T20:48:57",
    "text": "President Donald Trump falsely claimed Tuesday that he warned during his 2024 campaign that his tariffs would require Americans to experience a “transition period.”",
    "likes": 365,
    "reposts": 94
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T20:43:04",
    "text": "Cases of whooping cough are climbing across the US this year, with about 6,600 already documented — nearly four times the number at the same point last year.",
    "likes": 144,
    "reposts": 73
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T20:26:59",
    "text": "Jill Sobule, singer of 1995 hit tracks \"I Kissed a Girl\" and \"Supermodel,\" has died at the age of 66.\n\nSobule died early Thursday morning in a house fire, according to a statement from her publicity firm. cnn.it/3EPxOgM",
    "likes": 141,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T20:16:05",
    "text": "As two other crosstown rivals played a thrilling lacrosse game that went into overtime one night last week, some members of the Westhill High School boys’ varsity lacrosse team were in the stands hatching a plan.",
    "likes": 33,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T19:56:32",
    "text": "Scores of people took to the streets Thursday for May Day – or International Workers' Day – in response to the Trump administration’s controversial moves against immigrants and federal workers over its first 100 days. cnn.it/4lU8xCG",
    "likes": 469,
    "reposts": 107
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T19:24:56",
    "text": "The US Department of Health and Human Services said it aims to accomplish within 4 years a scientific feat that hasn’t been achieved for the past 45: the development of a universal flu vaccine that could protect against multiple virus strains with pandemic potential, including H5N1 avian influenza.",
    "likes": 107,
    "reposts": 21
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T19:07:37",
    "text": "They'd always loved being close to the mountains, but Jennie Vercouteren, from Minnesota, and her husband Ward never imagined that they'd end up living in the French Pyrenees.",
    "likes": 57,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T19:00:32",
    "text": "The Los Angeles Lakers are left with more questions than answers after their shocking first round exit at the hands of the Minnesota Timberwolves.\n\nDespite reports that the Lakers “expect” superstar forward LeBron James back next season, questions still remain about the team going forward.",
    "likes": 49,
    "reposts": 4
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T18:12:18",
    "text": "From peach blossom fields to oxygen supplies on trains: What CNN found on visiting tightly guarded Tibet cnn.it/4lXASYW",
    "likes": 60,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T17:59:49",
    "text": "Harvard University’s release this week of a long-awaited, 300-page report addressing antisemitism on campus is the latest milestone in an issue that has been incredibly painful for the campus community – and incredibly powerful for its biggest critic: the Trump administration.",
    "likes": 57,
    "reposts": 9
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T17:51:21",
    "text": "Driverless trucks are officially running their first regular long-haul routes, making roundtrips between Dallas and Houston. cnn.it/4iICfaW",
    "likes": 254,
    "reposts": 105
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T17:14:16",
    "text": "President Donald Trump’s administration urged the Supreme Court to unwind deportation protections for hundreds of thousands of Venezuelans that have been temporarily left in place by a lower federal court.",
    "likes": 64,
    "reposts": 35
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T16:59:31",
    "text": "JUST IN: Eleven Syracuse high school lacrosse players face misdemeanor charge of unlawful imprisonment over alleged hazing scandal",
    "likes": 69,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T16:37:53",
    "text": "The driver of a car that barreled through a building used for a popular after-school camp in central Illinois, killing three children and a teenager, was not under the influence of drugs or alcohol and may have had a medical emergency, police say.",
    "likes": 41,
    "reposts": 5
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T16:29:05",
    "text": "Elon Musk, along with three top DOGE team members, sat down with about a dozen reporters in the West Wing’s Roosevelt Room to reflect on his time in the Trump administration.",
    "likes": 68,
    "reposts": 17
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T15:48:04",
    "text": "Intelligence suggests Putin's immediate war goals for Ukraine may have shifted, fueling optimism Moscow may agree to a peace deal.",
    "likes": 76,
    "reposts": 14
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T15:25:28",
    "text": "The public health practice of adding fluoride to drinking water is facing heavy scrutiny from the Trump administration, and toothpaste companies are being pulled into the fray now, too.",
    "likes": 77,
    "reposts": 25
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T14:51:41",
    "text": "President Trump nominates Mike Waltz as UN ambassador and announces Secretary of State Marco Rubio will serve as interim national security adviser cnn.it/4d0TQK3",
    "likes": 91,
    "reposts": 28
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T14:43:44",
    "text": "As Wall Street executives and traders white knuckle their way through the most acutely volatile market period since the pandemic, desperate to avoid the economic blast radius of President Donald Trump’s sweeping new trade war, Peter Navarro’s name is never far from the topic of conversation.",
    "likes": 50,
    "reposts": 7
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T14:32:33",
    "text": "Detainees created an SOS message at the Bluebonnet Detention Center in Texas.\n\nThe detention center houses detainees including migrants accused of being gang members and facing deportation under the 1798 Alien Enemies Act before the Supreme Court issued a temporary block in April.",
    "likes": 287,
    "reposts": 114
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T14:22:09",
    "text": "The ability of federal judges to hold the Trump administration in contempt for defying their orders could be undermined by legislation approved by a House Republican-led committee late Wednesday in a bill that may be impossible for Senate Democrats to filibuster.",
    "likes": 78,
    "reposts": 38
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T14:18:16",
    "text": "The Trump admin. this week continued digging in on its claim that symbols tattooed on the fingers of Kilmar Abrego Garcia are proof that the man they wrongly deported to El Salvador is a member of MS-13.\n\nBut gang experts disagree, saying the tattoos alone are not proof of membership in the gang.",
    "likes": 123,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T13:15:42",
    "text": "Pete Buttigieg is putting the podcast microphones aside and heading out on the road.",
    "likes": 323,
    "reposts": 46
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T12:42:38",
    "text": "In a first-of-its-kind ruling, a Trump-appointed judge says the president's use of the Alien Enemies Act to speed deportations is unlawful.",
    "likes": 510,
    "reposts": 132
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T12:31:10",
    "text": "When it comes to karma, most people believe the universe is their own personal cheerleader — but an exacting judge for everyone else, according to a new study published May 1 by the American Psychological Association in the journal Psychology of Religion and Spirituality. cnn.it/4jALUBR",
    "likes": 82,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T11:52:59",
    "text": "\"Litigants and judges have portrayed many of Trump’s actions in nearly apocalyptic terms,\" writes Ronald Brownstein. cnn.it/3EY7UHA",
    "likes": 100,
    "reposts": 26
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T11:21:16",
    "text": "National security adviser Mike Waltz is expected to depart from the Trump administration in the coming days, two sources familiar with the matter told CNN. cnn.it/3Ysm3U5",
    "likes": 171,
    "reposts": 24
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T10:55:00",
    "text": "Robert De Niro is expressing his love and support for his daughter Airyn De Niro, after she recently shared publicly for the first time that she is transgender. cnn.it/3EY1msu",
    "likes": 30315,
    "reposts": 5379
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T09:24:21",
    "text": "The US Department of Health and Human Services released a 400-page review of treatment for gender dysphoria in children, but did not disclose who authored or reviewed the report.",
    "likes": 69,
    "reposts": 19
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T07:29:19",
    "text": "Protests under the “50501” movement – short for 50 protests, 50 states, 1 movement – in response to the Trump administration’s flurry of moves over its first 100 days are set to take place across the country for May Day.",
    "likes": 550,
    "reposts": 167
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T06:44:10",
    "text": "How the economy may frustrate Trump’s drive to expand presidential power | Analysis by Ronald Brownstein",
    "likes": 95,
    "reposts": 12
  },
  {
    "username": "CNN",
    "created_at": "2025-05-01T01:49:27",
    "text": "JUST IN: Kamala Harris accuses President Trump of abandoning American ideals in her first major speech since leaving office.",
    "likes": 1208,
    "reposts": 210
  }
]