[
  {
    "username": "NPR",
    "created_at": "2025-05-31T22:26:57",
    "text": "\"I just didn't think it would take this long,\" one veteran head of diversity, who's been job-hunting since last summer, tells NPR.",
    "likes": 705,
    "reposts": 171
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T21:38:49",
    "text": "Your state DMV probably won't text you about unpaid fees — but scammers will.",
    "likes": 666,
    "reposts": 156
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T19:46:20",
    "text": "The extreme sport of ultrarunning is known for seemingly impossible feats. But Stephanie Case's recent performance — six months after giving birth — is making waves far beyond the running community.",
    "likes": 718,
    "reposts": 88
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T19:17:59",
    "text": "Would-be homebuyers are finding lots of reasons to wait.",
    "likes": 419,
    "reposts": 79
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T18:38:16",
    "text": "To maintain old friends, focus less on what they're doing (or not doing) for the relationship and focus on your own efforts, says Nina Badzin, host of a friendship podcast.",
    "likes": 334,
    "reposts": 35
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T18:21:22",
    "text": "Far-Flung Postcards is a weekly series in which NPR's international correspondents share snapshots of moments from their lives and work around the world.",
    "likes": 304,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T17:07:00",
    "text": "Investors are worried about the ongoing trade war — and rethinking the safety and soundness of U.S. government debt.",
    "likes": 516,
    "reposts": 121
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T15:53:20",
    "text": "Four super-rich tech leaders gather for a poker weekend in a mountain mansion while AI technology leads to global chaos in the new HBO film from Succession creator Jesse Armstrong.",
    "likes": 449,
    "reposts": 38
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T15:30:03",
    "text": "The Republican senator offered a glib response to constituent questions at a town hall regarding cuts to Medicaid under the Trump-endorsed One Big Beautiful Bill Act.",
    "likes": 630,
    "reposts": 160
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T14:10:06",
    "text": "Videos show armed agents in tactical gear, a crowd of locals and what appear to be smoke devices deployed.",
    "likes": 635,
    "reposts": 234
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T13:41:35",
    "text": "'Memory cafes' are small social gatherings for individuals with dementia — and their caregivers, too. As public health funding shrinks, memory cafes are cheap to run and can offer measurable benefits.",
    "likes": 717,
    "reposts": 130
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T13:26:05",
    "text": "After All Things Considered producer Mia Venkat became a fan of Survivor, she and her friend group play their own version every year.",
    "likes": 154,
    "reposts": 14
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T13:08:06",
    "text": "More than a thousand people who worked to keep American agriculture free of pests and disease have left the federal workforce in President Trump's massive government downsizing.",
    "likes": 660,
    "reposts": 295
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T12:39:44",
    "text": "While the militant group says it will release 10 living and 18 deceased hostages still held in Gaza, there appear to be other details that need to be worked out before a ceasefire is declared.",
    "likes": 167,
    "reposts": 37
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T12:29:41",
    "text": "Existing evidence on the safety and efficacy of getting a COVID vaccine in pregnancy all points the same way: the shot is important for maternal and fetal health.",
    "likes": 827,
    "reposts": 258
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T11:46:54",
    "text": "Raising two kids while living with an autonomic nervous system disorder taught Jessica Slice to embrace interdependence. Her story is a reminder to parents of the power of asking for help.",
    "likes": 353,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T11:27:56",
    "text": "The White House said it's reached deals with nine law firms to provide about $1 billion in pro bono services. But the details of those agreements remain murky.",
    "likes": 368,
    "reposts": 99
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T11:08:59",
    "text": "At an international forum in Singapore, Defense Secretary Pete Hegseth said the U.S. is refocusing its strength and policies on deterring China, and coaxed China's neighbors and U.S. allies to help.",
    "likes": 147,
    "reposts": 25
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T10:36:23",
    "text": "President Trump has promised to attack drug gangs and called for the death penalty for street dealers. But he has also pardoned more than 20 people serving time for serious drug crimes, some involving violence.",
    "likes": 1111,
    "reposts": 417
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T10:05:39",
    "text": "Current and former Meta employees fear the new automation push comes at the cost of allowing AI to make tricky determinations about how Meta's apps could lead to real world harm.",
    "likes": 317,
    "reposts": 106
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T10:02:40",
    "text": "The coming months will bring a 28 Days Later sequel and a new John Wick movie starring Ana de Armas. Midsommar's Ari Aster has a new Western thriller, and Pixar goes intergalactic.",
    "likes": 143,
    "reposts": 7
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T08:01:46",
    "text": "Hungarian Prime Minister Viktor Orbán has been called \"Trump before there was a Trump.\" Here's why his reshaping of Hungary's political institutions inspires U.S. conservatives.",
    "likes": 322,
    "reposts": 98
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T06:53:27",
    "text": "The home improvement chain broke from many other retailers, who say they cannot afford to absorb new tariffs. President Trump recently attacked Walmart for warning of price hikes.",
    "likes": 438,
    "reposts": 92
  },
  {
    "username": "NPR",
    "created_at": "2025-05-31T04:49:41",
    "text": "Valerie ran off while she was on a camping trip with her owners back in 2023 on a remote island in Australia. They had lost hope until locals spotted her more than a year later, surviving in the wild.",
    "likes": 1113,
    "reposts": 142
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T21:56:02",
    "text": "Joe Walsh is the first Alzheimer's patient to be treated with an experimental nasal spray designed to reduce inflammation in the brain.",
    "likes": 1087,
    "reposts": 223
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T21:06:59",
    "text": "Following his HBO series Succession, Jesse Armstrong's latest project, Mountainhead, is a film about four tech billionaires whose mountain retreat is disrupted by a global catastrophe.",
    "likes": 320,
    "reposts": 24
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T20:42:34",
    "text": "RFK Jr. announced this week that the federal government is removing the recommendation that kids and pregnant women get routine COVID-19 vaccines. But CDC advice is more nuanced.",
    "likes": 2304,
    "reposts": 548
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T19:48:30",
    "text": "Court rulings against President Trump's tariffs could spell relief for many American importers — if the decisions hold. For now, the uncertainty remains.",
    "likes": 347,
    "reposts": 56
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T19:24:02",
    "text": "Last summer a federal judge ruled that Google had monopolized the search market. Now the Justice Department and the tech giant had one last chance to argue over what the penalties should be.",
    "likes": 253,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T19:16:03",
    "text": "Food aid is moldering in warehouses in Jordan, the main hub for humanitarian aid to Gaza. Other foods and medicines are loaded on trucks that have waited for months at Israeli border crossings.",
    "likes": 688,
    "reposts": 374
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T18:50:08",
    "text": "Before fighting broke out over two years ago, Khartoum had nearly 100 public and private medical facilities. Today, not a single one remains operational.",
    "likes": 301,
    "reposts": 87
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T18:27:52",
    "text": "JUST IN: Trump made the announcement as he celebrated a multi-billion dollar deal between the iconic American steelmaker U.S. Steel and the Japanese company Nippon Steel.",
    "likes": 206,
    "reposts": 58
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T18:11:15",
    "text": "The extreme sport of ultrarunning is known for seemingly impossible feats. But Stephanie Case's recent performance — six months after giving birth — is making waves far beyond the running community.",
    "likes": 443,
    "reposts": 43
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T16:20:29",
    "text": "BREAKING NEWS: PBS and Lakeland PBS in rural Minnesota are suing President Trump over his executive order demanding that the Corporation for Public Broadcasting kill all funding for the public television network.",
    "likes": 1648,
    "reposts": 249
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T16:17:52",
    "text": "JUST IN: The move to grant a stay in the case means that the Cubans, Haitian, Nicaraguans and Venezuelans who were granted temporary parole under the program known as CHNV would lose their temporary legal status to be in the U.S.",
    "likes": 212,
    "reposts": 85
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T16:01:51",
    "text": "President Trump nominated Paul Ingrassia to lead the Office of Special Counsel, a government agency that enforces ethics law and protects whistleblowers, despite Ingrassia's links to extremists.",
    "likes": 419,
    "reposts": 192
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T15:41:33",
    "text": "UPDATE: Elon Musk is leaving the Department of Government Efficiency effort. His 130 day tenure was marked by legal setbacks, overstated savings claims and little evidence DOGE made things more efficient.",
    "likes": 523,
    "reposts": 85
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T15:25:16",
    "text": "The pop star's early catalog was acquired in 2019 and sold again in 2020, igniting a years-long saga in which Swift set out to re-record new versions of the albums to compete with the originals.",
    "likes": 652,
    "reposts": 40
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T15:07:03",
    "text": "The Manitoba wildfires have forced 17,000 people to flee the province. Plumes of heavy smoke are expected to drift into the United States over Friday and Saturday, affecting millions of Americans.",
    "likes": 376,
    "reposts": 110
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T14:32:33",
    "text": "President Trump travels to Pittsburgh Friday to celebrate a deal between U.S. Steel and the Japanese company Nippon Steel — a deal he helped broker after campaigning that he would block it.",
    "likes": 241,
    "reposts": 76
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T14:25:04",
    "text": "Adams sued over an allegation in a 2016 documentary that he sanctioned the 2006 killing of a British spy in Ireland. A jury in Dublin's High Court awarded Adams damages of 100,000 euros ($113,000).",
    "likes": 143,
    "reposts": 20
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T14:04:52",
    "text": "KXT's Jackson Wisdorf joins Stephen Thompson to discuss their favorite records out this week — and shed a few tears in the process.",
    "likes": 51,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T13:31:35",
    "text": "Benicio Del Toro plays a globe-trotting tycoon trying to convince his estranged daughter (Mia Threapleton) to be his heir. The film is darker, angrier and more violent than Anderson's usual fare.",
    "likes": 325,
    "reposts": 28
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T13:14:45",
    "text": "France to ban smoking at beaches, parks and outside schools from July 1st to protect children.",
    "likes": 529,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T13:02:10",
    "text": "Following his HBO series Succession, Jesse Armstrong's latest project, Mountainhead, is a film about four tech billionaires whose mountain retreat is disrupted by a global catastrophe.",
    "likes": 198,
    "reposts": 15
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T12:40:02",
    "text": "The U.S. says it will revoke visas for Chinese students who study in \"critical fields\" or have links to China's Communist Party. The move could harm U.S. innovation and science research capacity.",
    "likes": 281,
    "reposts": 67
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T12:16:51",
    "text": "More than a thousand people who worked to keep American agriculture free of pests and disease have left the federal workforce in President Trump's massive government downsizing.",
    "likes": 447,
    "reposts": 187
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T11:59:41",
    "text": "Harrison Ruffin Tyler was just three generations from the White House, since his father and grandfather both fathered children in their 70s. The chemical engineer helped preserve his family's legacy.",
    "likes": 180,
    "reposts": 39
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T11:34:06",
    "text": "Stay on top of your monthly payments and avoid costly fees and interest charges with these smart credit card strategies.",
    "likes": 75,
    "reposts": 9
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T11:13:27",
    "text": "The National Association of the Deaf says the White House's failure to provide ASL interpreters during press briefings leaves some deaf and hard of hearing people without information.",
    "likes": 1469,
    "reposts": 368
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T10:52:37",
    "text": "JUST IN: The Supreme Court allows Trump administration to end humanitarian status for some migrants.",
    "likes": 215,
    "reposts": 94
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T10:34:28",
    "text": "Julie Leon died of hyperthermia in Seattle on June 28, 2021 — the hottest day in the city's history. A lawsuit claims she was a victim of oil companies' \"misrepresentations\" about climate change.",
    "likes": 321,
    "reposts": 61
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T10:15:00",
    "text": "You no longer need to be a software engineer to build software — you can \"vibe code\" it by prompting chatbots to build apps and websites. Could that put programmers out of a job?",
    "likes": 180,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T10:03:17",
    "text": "If you weren't playing along at home during Thursday night's final, take our mini-Bee quiz, which uses words from the real thing.",
    "likes": 90,
    "reposts": 8
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T09:47:51",
    "text": "This week, vaccines took a hit from the Trump administration, some reality TV stars got pardoned, and there was a media frenzy around a certain French interaction. Were you paying attention?",
    "likes": 135,
    "reposts": 18
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T09:32:12",
    "text": "Joe Walsh is the first Alzheimer's patient to be treated with an experimental nasal spray designed to reduce inflammation in the brain.",
    "likes": 527,
    "reposts": 109
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T09:21:53",
    "text": "On Friday, Brand pleaded not guilty to five counts of rape and assault that date back more than 25 years. He says the charges are politically motivated. His trial is set for 2026.",
    "likes": 116,
    "reposts": 18
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T09:09:08",
    "text": "Kerik, an Army veteran, was hailed as a hero after the 9/11 attack and eventually nominated to head the U.S. Department of Homeland Security, before a dramatic fall from grace that ended with him behind bars.",
    "likes": 124,
    "reposts": 11
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T08:57:46",
    "text": "Elon Musk is leaving the Department of Government Efficiency effort. His 130 day tenure was marked by legal setbacks, overstated savings claims and little evidence DOGE made things more efficient.",
    "likes": 465,
    "reposts": 75
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T08:46:27",
    "text": "The board alleges that CEO Arthur T. Demoulas has been planning a work stoppage at the Massachusetts-based retailer. It also says he has \"resisted an appropriate succession plan for Market Basket.\"",
    "likes": 103,
    "reposts": 13
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T08:31:28",
    "text": "UP FIRST: President Trump is heading to Pittsburgh today to celebrate U.S. Steel and Nippon Steel's partnership. And, what's next for DOGE after Elon Musk's exit.",
    "likes": 76,
    "reposts": 7
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T08:27:03",
    "text": "Did you file to claim Social Security benefits in the last few months -- earlier than you had planned?\n\nIf so, I'd love to hear from you, for a story for @npr.org. Please drop me a line at lwamsley@npr.org with a bit about your situation, and a phone number where I can reach you. Thanks!",
    "likes": 99,
    "reposts": 42
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T08:20:02",
    "text": "The decision makes it easier to win approval for highways, bridges, pipelines, wind farms, and other infrastructure projects.",
    "likes": 137,
    "reposts": 52
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T08:08:47",
    "text": "The Birch Glacier above the village of Blatten collapsed and caused a landslide that has buried most of the village. Authorities had evacuated residents earlier this month, but one person is missing.",
    "likes": 246,
    "reposts": 66
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T07:54:05",
    "text": "The Justice Department and Google have one final chance to convince a federal judge how the tech giant should change its practices so it can no longer monopolize the search market.",
    "likes": 152,
    "reposts": 33
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T07:35:45",
    "text": "As Pride Month approaches, a group of drag artists and their allies are releasing guidelines to help performers navigate a landscape of online harassment and physical violence.",
    "likes": 491,
    "reposts": 139
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T07:21:30",
    "text": "Valerie ran off while she was on a camping trip with her owners back in 2023 on a remote island in Australia. They had lost hope until locals spotted her more than a year later, surviving in the wild.",
    "likes": 861,
    "reposts": 91
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T07:03:35",
    "text": "More than a thousand people who worked to keep American agriculture free of pests and disease have left the federal workforce in President Trump's massive government downsizing.",
    "likes": 470,
    "reposts": 184
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T06:53:14",
    "text": "Court rulings against President Trump's tariffs could spell relief for many American importers — if the decisions hold. For now, the uncertainty remains.",
    "likes": 253,
    "reposts": 39
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T06:39:44",
    "text": "One of the judges stepped down over criticism surrounding her participation in a documentary about the case. Seven health professionals are accused of negligence in the death of the soccer legend.",
    "likes": 95,
    "reposts": 12
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T06:23:15",
    "text": "Canada has seen a surge of American doctors seeking to move north in the months since President Donald Trump returned to the White House.",
    "likes": 896,
    "reposts": 246
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T06:11:50",
    "text": "HHS Secretary Robert F. Kennedy Jr.'s \"Make America Healthy Again\" report cited hundreds of studies, but a closer look by the news organization NOTUS found that some of those studies did not exist.",
    "likes": 1013,
    "reposts": 318
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T05:54:02",
    "text": "These colorful snakes aren't just works of art. Erected for the World Health Assembly, they're meant to draw attention to an extremely neglected health issue: snakebite.",
    "likes": 167,
    "reposts": 17
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T05:22:32",
    "text": "Ramy Youssef stays busy, creating shows like Ramy and #1 Happy Family USA, and starring in Poor Things and Mountainhead. He spoke with Rachel Martin about mortality and his gripe with Santa Claus.",
    "likes": 80,
    "reposts": 9
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T01:42:12",
    "text": "The coming months will bring a 28 Days Later sequel and a new John Wick movie starring Ana de Armas. Midsommar's Ari Aster has a new Western thriller, and Pixar goes intergalactic.",
    "likes": 203,
    "reposts": 15
  },
  {
    "username": "NPR",
    "created_at": "2025-05-30T00:14:24",
    "text": "Conservative Political Action Conference chairman Matt Schlapp tells NPR's Leila Fadel in the Hungarian capital Budapest that the group is expanding to cities around the globe.",
    "likes": 174,
    "reposts": 42
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T22:12:50",
    "text": "These creative questions are fun to answer and can help reveal people's personalities. Conflict resolution facilitator Priya Parker shares her favorites and explains how to come up with your own.",
    "likes": 377,
    "reposts": 61
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T21:11:41",
    "text": "As the Trump administration slashes the federal workforce, experts say cuts to the USDA, FDA and CDC have left the food supply vulnerable to outbreaks of foodborne illness.",
    "likes": 768,
    "reposts": 294
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T20:32:58",
    "text": "Previous winners say the spelling bee has become much more competitive and credit television with making it a cultural phenomenon each year.",
    "likes": 252,
    "reposts": 27
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T19:22:20",
    "text": "The decision makes it easier to win approval for highways, bridges, pipelines, wind farms, and other infrastructure projects.",
    "likes": 304,
    "reposts": 70
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T18:59:41",
    "text": "Conservative Political Action Conference chairman Matt Schlapp tells NPR's Leila Fadel in the Hungarian capital Budapest that the group is expanding to cities around the globe.",
    "likes": 145,
    "reposts": 32
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T17:59:17",
    "text": "The National Association of the Deaf says the White House's failure to provide ASL interpreters during press briefings leaves some deaf and hard of hearing people without information.",
    "likes": 4119,
    "reposts": 1232
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T17:35:59",
    "text": "The board alleges that CEO Arthur T. Demoulas has been planning a work stoppage at the Massachusetts-based retailer. It also says he has \"resisted an appropriate succession plan for Market Basket.\"",
    "likes": 142,
    "reposts": 20
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T17:10:49",
    "text": "These colorful snakes aren't just works of art. Erected for the World Health Assembly, they're meant to draw attention to an extremely neglected health issue: snakebite.",
    "likes": 274,
    "reposts": 31
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T16:40:51",
    "text": "The U.S. Court of Appeals for the Federal District granted the Trump administration's request to temporarily put on hold the New York-based Court of International Trade judgment that struck down President Trump's tariffs.",
    "likes": 287,
    "reposts": 62
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T16:14:05",
    "text": "In 2021, Wallen was caught on video uttering a racial slur. Since then he's become the most commercially successful musician in country and popular music. How? By remaining committed to ambivalence.",
    "likes": 157,
    "reposts": 21
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T15:43:06",
    "text": "The superbly alert and flexible drummer formed a swirling current in modern jazz for more than 60 years. He was 82.",
    "likes": 534,
    "reposts": 140
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T15:26:01",
    "text": "Silverman's father and stepmother are buried under one tombstone that reads: \"Janice and Donald, who loved to laugh.\" The loss was a starting point for Silverman's \"cathartic\" Netflix comedy special.",
    "likes": 326,
    "reposts": 21
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T15:06:09",
    "text": "The Kenyan author championed local African languages and was imprisoned for his work. His name was often mentioned in discussions about the Nobel Prize in Literature.",
    "likes": 443,
    "reposts": 96
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T14:33:54",
    "text": "The Birch Glacier above the village of Blatten collapsed and caused a landslide that has buried most of the village. Authorities had evacuated residents earlier this month, but one person is missing.",
    "likes": 379,
    "reposts": 95
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T14:17:46",
    "text": "As Pride Month approaches, a group of drag artists and their allies are releasing guidelines to help performers navigate a landscape of online harassment and physical violence.",
    "likes": 664,
    "reposts": 207
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T14:02:07",
    "text": "Ramy Youssef has a gripe with Santa Claus. On this week’s Wild Card with Rachel Martin, Youssef talks about growing up believing in magic.\n\n Watch the full interview here: https://n.pr/4jtgk81",
    "likes": 47,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T13:39:00",
    "text": "Harrison Ruffin Tyler was just three generations from the White House, since his father and grandfather both fathered children in their 70s. The chemical engineer helped preserve his family's legacy.",
    "likes": 283,
    "reposts": 54
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T13:23:28",
    "text": "The preliminary injunction would prevent the federal government from revoking Harvard's ability to enroll international students.",
    "likes": 616,
    "reposts": 102
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T13:11:41",
    "text": "More than 300 writers from the UK and Ireland have signed a letter calling for immediate aid and a ceasefire in Gaza.",
    "likes": 728,
    "reposts": 136
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T12:50:44",
    "text": "Community and culture are two guiding forces in Ruby Ibarra's music. The Filipina American rapper — and 2025 Tiny Desk Contest winner — is joined by rock legend June Millington and an all-Filipino band.",
    "likes": 217,
    "reposts": 25
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T12:20:03",
    "text": "When President Trump talks about his foreign policy, he often frames it as a business deal. He says much less about conventional diplomacy, like ending the wars in Ukraine and Gaza.",
    "likes": 218,
    "reposts": 35
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T11:56:21",
    "text": "The coming months will bring a 28 Days Later sequel and a new John Wick movie starring Ana de Armas. Midsommar's Ari Aster has a new Western thriller, and Pixar goes intergalactic.",
    "likes": 134,
    "reposts": 13
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T11:10:45",
    "text": "The Department of Health and Human Services is ending a $766 million contract with the vaccine company Modern to develop an mRNA vaccine for flu strains with pandemic potential, including bird flu.",
    "likes": 518,
    "reposts": 241
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T10:25:39",
    "text": "A Peruvian farmer has lost a decade-long legal climate case against Germany energy giant RWE. Saúl Luciano Lliuya claimed the company's emissions had contributed to glacial melt threatening his Andean hometown.",
    "likes": 262,
    "reposts": 52
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T09:52:25",
    "text": "The goal of the changes, which head to the Senate next week, is to save money and send a signal that Republicans are tough on immigration.",
    "likes": 136,
    "reposts": 24
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T09:35:50",
    "text": "These creative questions are fun to answer and can help reveal people's personalities. Conflict resolution facilitator Priya Parker shares her favorites and explains how to come up with your own.",
    "likes": 198,
    "reposts": 29
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T09:24:27",
    "text": "A small team of researchers responsible for keeping clinicians up to date on contraception research has been cut. Doctors say they rely on the team's guidance when advising women about contraception.",
    "likes": 408,
    "reposts": 171
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T09:13:33",
    "text": "The 17-person team of statisticians and scientists at the National Survey on Drug Use and Health are all out of jobs. Researchers around the country use the data to understand behavioral health.",
    "likes": 541,
    "reposts": 239
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T08:57:21",
    "text": "But in a mixed ruling, federal Judge Michael Farbiarz declined, for now, to order Khalil released from immigration detention.",
    "likes": 237,
    "reposts": 45
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T08:41:50",
    "text": "Canada has seen a surge of American doctors seeking to move north in the months since President Donald Trump returned to the White House.",
    "likes": 1049,
    "reposts": 309
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T08:20:20",
    "text": "If the suspect in the recent D.C. case planned to kill people because of their Jewish faith, this would represent a major anomaly in lethal, antisemitic violence.",
    "likes": 154,
    "reposts": 16
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T08:04:09",
    "text": "Ramy Youssef stays busy, creating shows like Ramy and #1 Happy Family USA, and starring in Poor Things and Mountainhead. He spoke with Rachel Martin about mortality and his gripe with Santa Claus.",
    "likes": 113,
    "reposts": 9
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T07:48:45",
    "text": "UP FIRST: The stakes are high in the case of a federal court blocking many of President Trump's tariffs this term. And, why Hungary and its leader are inspiring American conservatives.",
    "likes": 363,
    "reposts": 58
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T07:33:16",
    "text": "Hungarian Prime Minister Viktor Orbán has been called \"Trump before there was a Trump.\" Here's why his reshaping of Hungary's political institutions inspires U.S. conservatives.",
    "likes": 284,
    "reposts": 81
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T07:22:40",
    "text": "Portugal's anti-immigration Chega party notched another political gain for Europe's far right on Wednesday after it was assigned the second-most seats in parliament.",
    "likes": 107,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T07:12:19",
    "text": "The announcement to revoke visas most drastic move yet to curtail the numbers of international students studying in the U.S.",
    "likes": 263,
    "reposts": 87
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T07:00:11",
    "text": "The ruling from a three-judge panel at the New York-based Court of International Trade came after several lawsuits arguing that Trump has exceeded his authority.",
    "likes": 841,
    "reposts": 137
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T06:37:37",
    "text": "As the Trump administration slashes the federal workforce, experts say cuts to the USDA, FDA and CDC have left the food supply vulnerable to outbreaks of foodborne illness.",
    "likes": 658,
    "reposts": 272
  },
  {
    "username": "NPR",
    "created_at": "2025-05-29T06:25:31",
    "text": "Financial markets welcomed a U.S. court ruling that blocks President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law.",
    "likes": 744,
    "reposts": 103
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T18:27:51",
    "text": "If the suspect in the recent D.C. case planned to kill people because of their Jewish faith, this would represent a major anomaly in lethal, antisemitic violence in the U.S.\n\n\"[It] has typically been the violent far right that has conducted attacks against synagogues,\" an expert says.",
    "likes": 237,
    "reposts": 41
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T18:03:48",
    "text": "British prosecutors have approved 21 charges against self styled misogynist influencers, brothers Andrew and Tristan Tate, including rape, assault, and human trafficking.",
    "likes": 1645,
    "reposts": 239
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T17:39:46",
    "text": "A Peruvian farmer has lost a landmark climate case against German energy giant RWE. Saul Luciano Lliuya had argued the company should help fund flood defenses near his Andean home, citing its role in global warming.",
    "likes": 291,
    "reposts": 62
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T17:21:42",
    "text": "As Trump targets elite schools, Harvard's president has a warning for universities: \"We need to be firm in our commitments to what we stand for. And what we stand for … is education, pursuit of the truth, helping to educate people for better futures.\"\n\nSee the full interview: https://n.pr/4dCUrSF",
    "likes": 871,
    "reposts": 117
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T17:04:42",
    "text": "Harvard's president tells NPR he finds Trump's recent measures \"perplexing.\"\n\n\"Why cut off research funding? Sure, it hurts Harvard, but it hurts the country,\" he said, adding that those dollars are awarded to efforts deemed \"high-priority work\" by the government. https://n.pr/43hPDhX",
    "likes": 1078,
    "reposts": 210
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T15:27:57",
    "text": "The goal of the changes, which head to the Senate next week, is to save money and send a signal that Republicans are tough on immigration.",
    "likes": 154,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T15:00:15",
    "text": "A small team of researchers responsible for keeping clinicians up to date on contraception research has been cut. Doctors say they rely on the team's guidance when advising women about contraception.",
    "likes": 429,
    "reposts": 150
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T14:37:16",
    "text": "Developing countries owe billions to China, which threatens to undermine poverty reduction efforts and fuel instability, according to a new report from Australia's Lowy Institute.",
    "likes": 294,
    "reposts": 80
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T14:14:02",
    "text": "Far-Flung Postcards is a weekly series in which NPR's international correspondents share snapshots of moments from their lives and work around the world.",
    "likes": 223,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T13:33:57",
    "text": "NEW: Two tribal nations are asking the full 8th Circuit to review a ruling that struck down a tool to protect minority voters under the federal Voting Rights Act in Arkansas, Iowa, Minnesota, Missouri, Nebraska, North Dakota and South Dakota",
    "likes": 303,
    "reposts": 87
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T13:24:30",
    "text": "When President Trump talks about his foreign policy, he often frames it as a business deal. He says much less about conventional diplomacy, like ending the wars in Ukraine and Gaza.",
    "likes": 225,
    "reposts": 42
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T12:36:11",
    "text": "This week, the album at No. 1 on the charts is one everyone saw coming: With the biggest streaming numbers of 2025 and strong sales to boot, Morgan Wallen's I'm the Problem is the chart-topper it had always seemed destined to become.",
    "likes": 64,
    "reposts": 3
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T12:18:26",
    "text": "Speaking on Wednesday in the Knesset, Israel's parliament, Netanyahu said that Sinwar was killed in an Israeli airstrike, but did not provide specifics.",
    "likes": 111,
    "reposts": 28
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T12:04:22",
    "text": "In his forthcoming book, 'The Party's Interests Come First,' American University professor Joseph Torigian writes about Xi Jinping's father, Xi Zhongxun, a noted Chinese politician himself.",
    "likes": 107,
    "reposts": 11
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T11:47:09",
    "text": "A judge has denied a request to dismiss a lawsuit alleging Elon Musk and DOGE are wielding unconstitutional power within the government. Separately, Musk also criticized a Trump-backed spending bill.",
    "likes": 1023,
    "reposts": 211
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T11:23:54",
    "text": "Mariam Mohammed says her younger son died when she could not get treatment for him at a U.S.-funded clinic that had temporarily closed. Researchers say that are many thousands of cases like his.",
    "likes": 791,
    "reposts": 314
  },
  {
    "username": "NPR",
    "created_at": "2025-05-28T11:07:49",
    "text": "Todd and Julie Chrisley, who rose to fame in a reality show highlighting their lavish lifestyle, had been serving yearslong prison sentences after 2022 convictions on bank and tax fraud offenses.",
    "likes": 277,
    "reposts": 71
  },
  {
    "username": "NPR",
    "created_at": "2025-05-27T10:58:32",
    "text": "A letter from the U.S. General Services Administration, which is dated Tuesday, tells agencies to submit a list of contracts they have terminated with the university by June 6.",
    "likes": 554,
    "reposts": 209
  },
  {
    "username": "NPR",
    "created_at": "2025-05-27T08:13:26",
    "text": "BREAKING: NPR and three Colorado public radio stations are suing the Trump administration over the president's executive order seeking to ban the use of federal money for NPR and PBS.",
    "likes": 5171,
    "reposts": 1150
  },
  {
    "username": "NPR",
    "created_at": "2025-05-27T06:27:38",
    "text": "Cutting off research funding for Harvard University might hurt the school, its president Alan Garber told NPR, but it also potentially sets back important work that benefits the public.",
    "likes": 1910,
    "reposts": 424
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T12:19:24",
    "text": "Charles Rangel, 23-term congressman from Harlem and 'Lion of Lenox Avenue,' dies at 94 https://gothamist.com/news/charlie-rangel ",
    "likes": 279,
    "reposts": 44
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T14:36:04",
    "text": "The king's visit is being seen in Canada as an opportunity for the nation to bolster its sovereignty amid threats by President Trump to turn the United States' northern neighbor into the 51st state.",
    "likes": 1222,
    "reposts": 172
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T13:02:42",
    "text": "Trump's remarks were a rare rebuke of the Russian president and followed a storm of drone and missile attacks on Ukrainian cities on Sunday evening.",
    "likes": 445,
    "reposts": 66
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T12:26:18",
    "text": "This novel stands apart from other tales of mothers stretched too thin. Jessica Stanley weaves family frustrations with British politics and global events because our life and our times are connected.",
    "likes": 216,
    "reposts": 17
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T11:49:00",
    "text": "Memorial Day, observed on the last Monday in May, is a day to honor and mourn fallen military service members. NPR readers share stories of the loved ones they've lost.\nFrom @suzannenuyen.bsky.social",
    "likes": 4072,
    "reposts": 876
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T11:24:31",
    "text": "From @rhersher.bsky.social \n\nA performance of the masterpiece will be transmitted into space on Saturday. The waltz has been associated with space travel since its inclusion in the film 2001: A Space Odyssey.",
    "likes": 1612,
    "reposts": 319
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T11:12:41",
    "text": "Science is an economic driver in Hamilton, Mont., thanks to Rocky Mountain Laboratories, a federal research lab. Now, layoffs and funding cuts are having an impact in this town far from Washington.",
    "likes": 11045,
    "reposts": 3348
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T10:46:50",
    "text": "Under the Biden administration, the Consumer Financial Protection Bureau finalized a rule barring medical debt from appearing on credit reports. Now, the agency is siding with the credit industry groups suing to have the rule vacated.",
    "likes": 1186,
    "reposts": 595
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T10:36:11",
    "text": "President Trump has ordered a Veterans Affairs campus in West Los Angeles to house 6,000 homeless vets by 2028, but details are elusive.",
    "likes": 276,
    "reposts": 65
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T10:31:05",
    "text": "It's Memorial Day. To honor the fallen military service members this year, the Up First newsletter asked readers to share stories of their loved ones.",
    "likes": 2848,
    "reposts": 641
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T10:23:18",
    "text": "Food apps can help you figure out what's in your food and whether it's nutritious. Just scan the barcode on the packet with your phone. But different apps can give very different results. Here's why.",
    "likes": 302,
    "reposts": 61
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T10:19:43",
    "text": "HBO's hit zombie drama spent much of its second season maneuvering Ellie and Abby together. Critic @edeggans.bsky.social says it has a pacing issue that many streaming shows share.",
    "likes": 208,
    "reposts": 11
  },
  {
    "username": "NPR",
    "created_at": "2025-05-26T10:13:11",
    "text": "The 28-year-old rocketed past Andretti Global's Marcus Ericsson in the final laps of the contest and held onto the top position until the end.",
    "likes": 280,
    "reposts": 19
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T18:13:54",
    "text": "The bishop of Rome is one of many titles held by the pope. Duties related to the title are usually delegated to an auxiliary or assistant bishop, known as a vicar.",
    "likes": 1764,
    "reposts": 200
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T17:52:45",
    "text": "Senate Bill 10 now goes back to the Senate for concurrence before advancing to Gov. Greg Abbott, who is expected to sign it into law. via @houstonpublicmedia.bsky.social",
    "likes": 975,
    "reposts": 343
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T16:54:02",
    "text": "The Texas House on Sunday passed Senate Bill 10, a measure requiring the display of the Ten Commandments in every public-school classroom in the state.",
    "likes": 119,
    "reposts": 54
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T16:20:51",
    "text": "What do you get if you add poems that are \"Shel Silverstein meets Rumi for kids\" with pictures of yetis and primordial slime? Words with Wings and Magic Things, a book of illustrated poems for kids.",
    "likes": 610,
    "reposts": 96
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T12:45:44",
    "text": "Paula Bomer's dizzying book is a fascinating look at an absurdly stupid young man in the early 1990s who manages to sustain himself despite having no evidence of a soul.",
    "likes": 196,
    "reposts": 22
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T12:23:33",
    "text": "NPR visits a hospital in eastern Ukraine's Donetsk region, in a town where many residents have fled but some young couples are holding on and hoping to raise their children one day in peace.",
    "likes": 706,
    "reposts": 153
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T12:02:46",
    "text": "It's a working-class staple. And it could be priced out of the market by government efforts to make bakeries change from wood-fired ovens to other fuels to curb air pollution.",
    "likes": 224,
    "reposts": 31
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T11:44:36",
    "text": "Five years after George Floyd's death, NPR's Michel Martin took a trip to Minneapolis and spoke to the city's mayor Jacob Frey, Minnesota attorney general Keith Ellison and national civil rights attorney Ben Crump to reflect on how the city and nation have changed.",
    "likes": 1953,
    "reposts": 443
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T11:37:10",
    "text": "The relationship between Combs and his ex-girlfriend, Cassie Ventura, has been the focus of the prosecution's case so far, but the charges he faces are bigger and broader.\nBy @anastasiat.bsky.social",
    "likes": 281,
    "reposts": 40
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T11:33:19",
    "text": "In a post on Truth Social, Trump said the home countries of some of Harvard's international students are \"not at all friendly to the United States\" and \"pay NOTHING toward their student's education.\"",
    "likes": 400,
    "reposts": 73
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T11:19:29",
    "text": "A section of California's scenic Pacific Coast Highway that has been closed since January's deadly Palisades Fire reopens in time for holiday weekend traffic, to mixed emotions and high hopes for Malibu businesses.",
    "likes": 734,
    "reposts": 92
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T11:17:01",
    "text": "Five years after George Floyd's death sparked worldwide protests over police brutality and racism, NPR's Michel Martin reflects on Morning Edition's return to Minneapolis to examine what has changed.",
    "likes": 551,
    "reposts": 121
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T10:29:04",
    "text": "The Pentagon restrictions on media covering the military follow a series of moves by the Trump administration to curtail press access. The changes overhaul historic access for the press.",
    "likes": 742,
    "reposts": 298
  },
  {
    "username": "NPR",
    "created_at": "2025-05-25T10:27:58",
    "text": "The singer canceled his summer tour dates and revealed he has a brain condition called normal pressure hydrocephalus. It's treatable but tricky to diagnose, doctors say.",
    "likes": 1365,
    "reposts": 188
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T18:15:19",
    "text": "The dissident filmmaker's thriller is a stinging critique of oppression in his home country.",
    "likes": 1212,
    "reposts": 176
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T14:06:57",
    "text": "Your state DMV probably won't text you about unpaid fees — but scammers will.",
    "likes": 3742,
    "reposts": 1042
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T13:09:00",
    "text": "The car you drive years in the future might run off a battery being invented in a lab today. Companies in China and the United States are racing to perfect and scale up next-generation technologies.",
    "likes": 595,
    "reposts": 111
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T13:01:55",
    "text": "Character actor George Wendt was known to a generation as Norm, the beleaguered, lovable everyman on the sit-com \"Cheers.\" He died this week at the age of 76.",
    "likes": 1457,
    "reposts": 137
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T12:37:07",
    "text": "In 2005, two Chicago titans made a generational classic and then sprinted in opposite directions, each daring the rest of hip-hop to follow them.",
    "likes": 243,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T12:25:11",
    "text": "From @lindaholmes.bsky.social \n\nThe long-running franchise taps into a common fear: You're going to die eventually, and there's nothing you can do about it. Final Destination Bloodlines is the sixth installment.",
    "likes": 175,
    "reposts": 7
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T12:03:23",
    "text": "What you eat during the day can affect how well you sleep at night. Sleep researchers explain the impact of diet, caffeine and alcohol on sleep health, and share a list of sleep-supporting foods.",
    "likes": 369,
    "reposts": 65
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T11:58:41",
    "text": "The latest criticism from the Trump administration of Harvard University highlighted the number of international students entering the United States each year for higher education.",
    "likes": 219,
    "reposts": 34
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T11:49:18",
    "text": "Cerro San Cristobal in the heart of Chile's capital offers stunning views of wildflowers, pine forests and the soaring Andes.\n\nRead more from @brianmannadk.bsky.social",
    "likes": 292,
    "reposts": 27
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T11:28:33",
    "text": "Memorial Day, observed on the last Monday in May, is a day to honor and mourn fallen military service members. NPR readers share stories of the loved ones they've lost.",
    "likes": 1605,
    "reposts": 432
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T11:20:51",
    "text": "Trump's misleading video of a 'burial site' for white South African farmers reopened 'new wounds,' victim's son tells NPR.",
    "likes": 860,
    "reposts": 262
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T10:56:31",
    "text": "The sometimes uncomfortable sensations we feel in our teeth may be an evolutionary holdover from the scaly exteriors of ancient armored fish.",
    "likes": 489,
    "reposts": 64
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T10:49:12",
    "text": "The agency is taking steps to remove prescription fluoride products that children swallow. But researchers who study fluoride say it's not harmful and some kids need the treatments.",
    "likes": 3357,
    "reposts": 925
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T10:27:21",
    "text": "Hundreds of public safety grants cut, worth $500 million, funded initiatives like drug treatment and gun violence prevention programs.",
    "likes": 11414,
    "reposts": 4959
  },
  {
    "username": "NPR",
    "created_at": "2025-05-24T10:17:21",
    "text": "Khalil's lawyers are trying to convince an immigration judge that if he's deported, Israel could target him over his advocacy for Palestinian rights.",
    "likes": 543,
    "reposts": 136
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T20:23:27",
    "text": "JUST IN: The NSC has traditionally played a pivotal role in advising the president for his biggest diplomatic and security decisions. But in Trump's second term, it has seen its influence shrink.",
    "likes": 559,
    "reposts": 194
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T19:50:40",
    "text": "A new study details the evolutionary change of Anna's Hummingbirds, finding their beaks have grown longer and more tapered to get the most from common feeders.",
    "likes": 5420,
    "reposts": 1114
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T18:35:00",
    "text": "By @gbrumfiel.bsky.social \n\nA series of executive orders aims to promote new kinds of nuclear reactors while restructuring the body in charge of nuclear safety.",
    "likes": 246,
    "reposts": 67
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T17:17:39",
    "text": "Five years after George Floyd was murdered by a Minneapolis police officer, the future of the intersection where it happened is uncertain. Today, a memorial is set up in the partially blocked street. But some want to move on. \nBy @meganders.bsky.social",
    "likes": 270,
    "reposts": 59
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T16:58:43",
    "text": "Remains of the \"Scattered Man John Doe\" began washing ashore in New Jersey in 1995 and went unidentified for the next three decades. Students at Ramapo College set about to solve the mystery.",
    "likes": 365,
    "reposts": 53
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T16:37:48",
    "text": "From @jeffbradynews.bsky.social \nGrilling usually involves burning fossil fuel. But some manufacturers are offering electric grills and citing climate change and convenience as reasons to switch.",
    "likes": 432,
    "reposts": 66
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T16:10:22",
    "text": "The Justice Department says it has reached an agreement in principle with Boeing to drop criminal charges over two fatal crashes of 737 Max jets, despite objections from some victims' family members.",
    "likes": 914,
    "reposts": 366
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T16:03:06",
    "text": "UPDATE: The high-profile trial in Paris finds 8 of the so-called 'Grandpa Robbers' guilty of robbing Kim Kardashian at gunpoint in 2016. Most were in their 60s when the jewelry heist took place.",
    "likes": 202,
    "reposts": 23
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T15:28:01",
    "text": "Loving Day, the landmark case that overturned U.S. state laws against interracial marriage, is on June 12. NPR wants to hear from people who celebrate this day.",
    "likes": 2487,
    "reposts": 535
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T15:19:27",
    "text": "From @hansilowang.bsky.social \n\nDOGE's push to cut some federal surveys conducted by the Census Bureau may be duplicating a White House agency's oversight work and weaken U.S. data infrastructure, experts warn.",
    "likes": 262,
    "reposts": 73
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T15:01:14",
    "text": "My latest @npr.org story: A new push by the Trump administration’s DOGE team to cut some federal surveys conducted by the Census Bureau may be duplicating a White House agency’s oversight work and weaken U.S. data infrastructure, experts warn",
    "likes": 171,
    "reposts": 60
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T15:03:48",
    "text": "The U.S. has officially accepted a luxury jetliner from Qatar as a gift, and slated it to become a new Air Force One. Experts say that overhaul could take years and cost hundreds of millions.",
    "likes": 6173,
    "reposts": 2299
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T13:57:34",
    "text": "NPR took a walk through Minneapolis with its former police chief Medaria Arradondo. He says \"the worst thing we can do\" is dismiss the 2020 protests and outrage over police brutality as an anomaly.",
    "likes": 539,
    "reposts": 93
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T13:49:16",
    "text": "In her order, U.S. District Judge Susan Illston said the president may not initiate large-scale executive branch reorganization without approval from Congress.",
    "likes": 1836,
    "reposts": 470
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T13:47:31",
    "text": "DOGE attempted to assign a team to the Government Accountability Office, an influential congressional watchdog agency. It refused. But experts say DOGE could have learned much from GAO.",
    "likes": 373,
    "reposts": 83
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T13:38:31",
    "text": "This comes in response to a lawsuit Harvard filed on Friday morning, challenging the Trump administration's abrupt move to revoke the school's ability to enroll foreign students.",
    "likes": 933,
    "reposts": 170
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T13:32:04",
    "text": "Shira Perlmutter's termination came shortly after the Copyright Office published a long-anticipated report on artificial intelligence.",
    "likes": 1333,
    "reposts": 355
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T13:28:25",
    "text": "The White House budget office rejected the conclusion of a nonpartisan congressional watchdog that said the Trump administration is breaking the law by not spending funds as directed by Congress.",
    "likes": 1194,
    "reposts": 422
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T10:57:27",
    "text": "Ukraine and Russia have begun the exchange of 1,000 prisoners of war, the largest such swap since the beginning of Russia's full-scale invasion of Ukraine in February 2022.",
    "likes": 524,
    "reposts": 96
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T10:55:58",
    "text": "AAA predicts a record-breaking 45.1 million Americans will travel between Thursday and Monday, mostly by car and plane. Here's what to know if you're one of them.",
    "likes": 233,
    "reposts": 43
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T09:39:16",
    "text": "Trump said on social media that he had recommended 50% tariffs on European Union products starting June 1 — and warned Apple's CEO to move manufacturing of iPhones to the United States.",
    "likes": 297,
    "reposts": 60
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T06:15:27",
    "text": "Summer grilling usually starts with filling a propane tank or buying a bag of charcoal briquettes. But some people are ditching these fossil fuels for a more climate-friendly electric grill. My story for @npr.org: www.npr.org/2025/05/23/n...",
    "likes": 202,
    "reposts": 28
  },
  {
    "username": "NPR",
    "created_at": "2025-05-23T06:36:28",
    "text": "NPR asked researchers, advocates, tax experts, a parent and a public school leader for their thoughts on this first-of-its-kind national voucher plan. Here's what they said.",
    "likes": 354,
    "reposts": 126
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T18:52:04",
    "text": "What should be done with the place George Floyd was murdered? Should it become a permanent memorial, open back up as a regular street ? Or something else ? We asked the people we met this week in and we'll tell you what they said tomorrow on Morning Edition",
    "likes": 173,
    "reposts": 9
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T19:20:58",
    "text": "Trump's plans to gut VOA get boost from appeals court \n\nMy story for NPR:\n\nwww.npr.org/2025/05/22/n...",
    "likes": 153,
    "reposts": 63
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T18:24:12",
    "text": "And don’t miss this review from my colleague @edeggans.bsky.social www.npr.org/2025/05/21/n...",
    "likes": 134,
    "reposts": 12
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T18:23:06",
    "text": "Today on All Things Considered, my conversation with Matt Wolf, the director and producer of “Pee-wee as Himself” about the complexity of Paul Reubens and the allure of Pee-wee.\n\nwww.npr.org/2025/05/22/n...",
    "likes": 154,
    "reposts": 18
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T20:05:31",
    "text": "New USDA guidance told states they must turn over data to the agency, through their third-party payment processors, \"including but not limited to\" names, birth dates, SSN and addresses of all applicants and recipients of SNAP benefits going back 5+ years.",
    "likes": 181,
    "reposts": 75
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T19:51:57",
    "text": "NEW @npr.org: A lawsuit filed Thursday says the USDA's demand for sensitive data about millions of SNAP recipients violates federal privacy laws. \n\nMeanwhile, some states are preparing to comply with the unprecedented request.\n\nWith @jjoffeblock.bsky.social",
    "likes": 199,
    "reposts": 71
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T19:31:01",
    "text": "The suit claims that efforts to get sensitive information about food aid recipients from states violates federal privacy laws.",
    "likes": 3100,
    "reposts": 968
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T19:00:30",
    "text": "A federal appeals court said it would not intervene — at least for now — to thwart the Trump administration's plans for the near-total dismantlement of Voice of America.\nBy @davidfolkenflik.bsky.social",
    "likes": 293,
    "reposts": 132
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T18:31:27",
    "text": "The husband is from India. The wife is from Pakistan. Their son is Indian and daughters are Pakistani. India blames Pakistan for an April militant attack in Kashmir and ordered Pakistanis to leave.",
    "likes": 193,
    "reposts": 33
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T18:16:38",
    "text": "UPDATE: Federal authorities are also investigating the Washington, D.C. shootings as a hate crime and an act of terrorism.",
    "likes": 155,
    "reposts": 30
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T18:11:54",
    "text": "The Chagos Islands are home to Diego Garcia, one of the world's most secretive places and home to an important U.S. military base.",
    "likes": 161,
    "reposts": 38
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T18:01:17",
    "text": "The judge says the administration \"unquestionably\" violated his earlier order, which stated migrants cannot be deported to a country other than their own without having adequate notice and a chance to object.",
    "likes": 2712,
    "reposts": 790
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T17:41:55",
    "text": "Jean Paul Al Arab and his 6-month-old led police on a brief foot chase during a University at Buffalo ceremony. The school said the grad violated rules about who can participate in the commencement.",
    "likes": 314,
    "reposts": 65
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T17:33:39",
    "text": "Advisers to the Food and Drug Administration met Thursday to help decide which variant of the virus that causes COVID should be targeted by updated versions of the vaccines.",
    "likes": 245,
    "reposts": 54
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T17:17:11",
    "text": "The U.S. Supreme Court has granted, for now, the Trump administration's emergency request to let him fire the heads of two independent agencies — the National Labor Relations Board and the Merit Systems Protection Board.",
    "likes": 220,
    "reposts": 86
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T16:53:47",
    "text": "The $6.5 billion deal brings together the maker of ChatGPT and one of the world's most famous product designers in a venture to create new AI-enabled devices.",
    "likes": 94,
    "reposts": 18
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T16:38:56",
    "text": "UPDATE: The Senate parliamentarian advised lawmakers that they couldn't use the Congressional Review Act to revoke California's right to set vehicle standards. But they did it anyway. Expect a legal fight.",
    "likes": 7736,
    "reposts": 2347
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T16:34:47",
    "text": "An NPR listener writes: \"We live in a nice neighborhood that has homeowner association rules, and our neighbor is violating them.\" Social etiquette experts weigh in.",
    "likes": 86,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T16:05:49",
    "text": "The Health Secretary's report blames environmental toxins, ultraprocessed foods and more for the poor state of kids' health in the U.S.",
    "likes": 500,
    "reposts": 113
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T16:02:20",
    "text": "Investors are worried about the ongoing trade war — and rethinking the safety and soundness of U.S. government debt.\n\nBy @mariaaspan.bsky.social",
    "likes": 941,
    "reposts": 298
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T15:58:43",
    "text": "Comedian Mike Birbiglia says he absorbed a lot of lessons from his parents – whether he realized it or not as a kid. From his mom's ability to talk to everyone, to his dad's drive and ambition.",
    "likes": 103,
    "reposts": 2
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T15:44:11",
    "text": "By @alejandrabee.bsky.social \n\nThe House and Senate both voted to loosen regulations on air pollutants like dioxin and mercury, which are associated with higher cancer risk.",
    "likes": 9566,
    "reposts": 4986
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T15:34:23",
    "text": "Forecasters expect 13 to 19 storms to form in the Atlantic between June 1 and the end of November. At least 6 of those are forecast to be full-blown hurricanes.\nBy @rhersher.bsky.social",
    "likes": 695,
    "reposts": 267
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T15:15:23",
    "text": "JUST IN: International students make up more than a quarter of Harvard University's student body. Harvard says the government's actions, which could cut off a major revenue stream, are \"unlawful.\"",
    "likes": 1593,
    "reposts": 517
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T15:09:34",
    "text": "The musician Scott Mescudi, who records as Kid Cudi, told the court that after Combs discovered his relationship with Cassie Ventura, his house was broken into and his car was set on fire.",
    "likes": 337,
    "reposts": 68
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T14:56:16",
    "text": "President Trump is hosting an exclusive dinner tonight for the largest investors in the $TRUMP meme coin, putting the murky world of cryptocurrencies on a collision course with White House ethics.",
    "likes": 469,
    "reposts": 148
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T14:41:39",
    "text": "In 2025, fandom is complicated. Music is at nearly everyone's fingertips. Concert ticket prices are through the roof. Some fans take devotion to new extremes. What do we owe to the artists we love?\nBy @annkpowers.bsky.social",
    "likes": 136,
    "reposts": 18
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T14:36:30",
    "text": "An air traffic controller who works the airspace around Newark, N.J. speaks out about what it was like to lose radar and communication systems during a shift, and how the situation got to be so bad.",
    "likes": 1581,
    "reposts": 571
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T14:20:13",
    "text": "Two staff members of the Israeli Embassy in Washington, D.C. were killed in a shooting after attending an event a Jewish museum. A suspect shouted \"free Palestine\" before being taken into custody.",
    "likes": 111,
    "reposts": 19
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T14:14:23",
    "text": "Scientists have found a way to sample DNA out of the air on a large scale — making it possible to one day track the health and well being of all kinds of species around the world.",
    "likes": 389,
    "reposts": 71
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T14:10:30",
    "text": "Jon Hegwood was a teen parent when he told his high school principal, Billy Barnett, that he planned to drop out of school. But Barnett convinced Hegwood to earn his diploma.",
    "likes": 246,
    "reposts": 22
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T14:08:14",
    "text": "It's a pattern in President Trump's chaotic tariff policy: he first suggests a high number, only to later ratchet it down. Business schools call it the 'anchor effect.'",
    "likes": 267,
    "reposts": 78
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T13:57:59",
    "text": "As attendees departed an event held by a Jewish advocacy organization in D.C. on Wednesday night, a shooter opened fire, killing two. Later, he chanted \"free Palestine,\" D.C. police officials said.",
    "likes": 99,
    "reposts": 21
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T13:53:48",
    "text": "In a cost-cutting move, the Treasury Department will soon stop minting new pennies.  The one-cent coins will still be legal tender. There are more than 100 billion pennies in circulation but many are gathering dust in change jars and forgotten pockets.",
    "likes": 502,
    "reposts": 109
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T13:41:20",
    "text": "Recent critiques of judges from the Trump administration have prompted fears the Marshals could be caught in the middle of a power struggle and forced to yank security for judges.\nBy @carriejohnson.bsky.social",
    "likes": 320,
    "reposts": 90
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T13:28:44",
    "text": "For community groups to allege violations of environmental rules, a state law says groups have to use federally-approved testing equipment, and it sets restrictions for analyzing and sharing the data.",
    "likes": 813,
    "reposts": 301
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T13:22:52",
    "text": "The Senate parliamentarian advised lawmakers that they couldn't use the Congressional Review Act to revoke California's right to set vehicle standards. But they did it anyway. Expect a legal fight.",
    "likes": 6518,
    "reposts": 2112
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T11:46:15",
    "text": "BREAKING NEWS: A federal judge has blocked the Trump administration from carrying out Trump's executive order calling for the closure of the Education Department.",
    "likes": 3031,
    "reposts": 636
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T10:42:04",
    "text": "BREAKING NEWS: The Supreme Court justices deadlock 4-4, effectively blocking the creation of the nation's first religious charter school in Oklahoma.",
    "likes": 2206,
    "reposts": 364
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T09:44:23",
    "text": "More Texas parents are opting to vaccinate their babies early against measles, nearly a 4.5-fold increase so far this year compared to 2019, according to the Texas Department of State Health Services.",
    "likes": 679,
    "reposts": 130
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T09:59:48",
    "text": "Are you shopping for a home right now? Or were you planning to buy a home -- but are now putting it off? Did you just buy?\n\nI'm working on a story for @npr.org, and I'd love to hear from you.\n\nDrop me a line with your situation and a good phone number to reach you. I'm at lwamsley@npr.org. Thanks!",
    "likes": 89,
    "reposts": 35
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T08:59:18",
    "text": "South Africa's President Cyril Ramaphosa keeps his cool after a carefully choreographed Oval Office ambush by Trump.",
    "likes": 1500,
    "reposts": 352
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T07:25:11",
    "text": "At the center of the sweeping bill is trillions in tax cuts, which Republicans aim to partially offset through changes to safety net programs like Medicaid and SNAP.",
    "likes": 934,
    "reposts": 393
  },
  {
    "username": "NPR",
    "created_at": "2025-05-22T06:40:38",
    "text": "A federal program provides extra help to make sure students experiencing homelessness get an education. Amid massive cuts to the federal government, the program's future is uncertain.",
    "likes": 976,
    "reposts": 314
  },
  {
    "username": "NPR",
    "created_at": "2025-05-21T11:14:52",
    "text": "The decision reverses course on the use of consent decrees to ensure accountability of law enforcement agencies. It comes days before the anniversary of George Floyd's murder by a police officer.",
    "likes": 624,
    "reposts": 232
  },
  {
    "username": "NPR",
    "created_at": "2025-05-21T09:53:04",
    "text": "From Target to Walmart, retailers are fighting two battles at once: a financial battle to keep costs low in the face of new tariffs, and a political one to avoid the president's wrath.",
    "likes": 5442,
    "reposts": 1268
  },
  {
    "username": "NPR",
    "created_at": "2025-05-21T07:52:42",
    "text": "Five of the 10 men who escaped from a New Orleans jail through a hole behind a toilet on Friday are still missing. Authorities believe they had help from the inside and made an arrest on Tuesday.",
    "likes": 588,
    "reposts": 127
  },
  {
    "username": "NPR",
    "created_at": "2025-05-21T07:24:16",
    "text": "Some of the CDC's main channels for communicating urgent health information to the public have gone silent.",
    "likes": 18698,
    "reposts": 8654
  },
  {
    "username": "NPR",
    "created_at": "2025-05-21T06:15:46",
    "text": "AI-generated summer reading list gets published in major newspapers \n\nwww.npr.org/2025/05/20/n...\n\n(Note: I would love to be a real-in-the-flesh book reviewer)\n\n#books #booksky",
    "likes": 268,
    "reposts": 62
  },
  {
    "username": "NPR",
    "created_at": "2025-05-21T06:30:48",
    "text": "A Delaware animal shelter is working to find new homes for 8,000 surviving chicks that were left abandoned in a U.S. Postal Service truck for three days. Another 4,000 of the animals died.",
    "likes": 3271,
    "reposts": 1118
  },
  {
    "username": "NPR",
    "created_at": "2025-05-20T13:49:07",
    "text": "The billionaire executive was Trump's biggest donor in 2024. Now, however, he is planning to cut back his spending on politics, he said on Tuesday.",
    "likes": 392,
    "reposts": 75
  },
  {
    "username": "NPR",
    "created_at": "2025-05-20T11:50:31",
    "text": "Democrats have denounced the charges as politically motivated and an effort by the Trump administration to intimidate members of Congress and chill oversight.",
    "likes": 777,
    "reposts": 165
  },
  {
    "username": "NPR",
    "created_at": "2025-05-20T10:52:42",
    "text": "Secretary of State Marco Rubio is defending major cuts in the foreign affairs budget as he testifies on Tuesday before the Senate committee where he used to serve.",
    "likes": 1218,
    "reposts": 387
  },
  {
    "username": "NPR",
    "created_at": "2025-05-20T07:39:44",
    "text": "UP FIRST: Many Kentucky residents are bracing for storms as they recover from deadly weather over the weekend. And, the latest on negotiations between Israel and Hamas.",
    "likes": 213,
    "reposts": 25
  },
  {
    "username": "NPR",
    "created_at": "2025-05-20T06:18:21",
    "text": "Another round of dangerous weather is forecast to reach areas in the Southeast on Tuesday, as recovery efforts continued following a deadly bout of severe weather that affected multiple states.",
    "likes": 1340,
    "reposts": 425
  },
  {
    "username": "NPR",
    "created_at": "2025-05-20T06:05:22",
    "text": "A major medical group now recommends pain-blocking treatments for IUD insertion and other procedures amid a growing recognition that women's pain should be treated.",
    "likes": 2998,
    "reposts": 652
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T20:48:40",
    "text": "President Trump was gracious on Sunday when former President Joe Biden announced his cancer diagnosis. But on Monday, Trump quickly pivoted to allege, without evidence, that there had been a cover-up.",
    "likes": 777,
    "reposts": 143
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T18:53:20",
    "text": "Young, male capuchin monkeys have started kidnapping the babies of nearby howler monkeys. Why? Maybe boredom.",
    "likes": 353,
    "reposts": 60
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T18:31:08",
    "text": "The luxury jet needs a security overhaul. That usually takes a few years, meaning it might not be ready until Trump is out of office. Shortcuts could create national security risks.",
    "likes": 583,
    "reposts": 131
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T18:18:27",
    "text": "The pandemic helped supercharge a niche craft into a fine arts movement. Now the scene is more detailed and thoughtful than ever before.",
    "likes": 375,
    "reposts": 52
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T18:00:58",
    "text": "Watchdog group American Oversight takes Trump administration to court over the alleged withholding of information related to Harvard University's tax-exempt status.",
    "likes": 705,
    "reposts": 156
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T17:53:25",
    "text": "The MAHA movement loves the idea of getting rid of synthetic dyes in foods. But manufacturers face challenges that could drive prices higher.",
    "likes": 306,
    "reposts": 47
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T17:48:57",
    "text": "If you're trying to build muscle, getting enough protein is a must. But does it matter if that protein comes from meat or plants? A new study overturns assumptions.",
    "likes": 1249,
    "reposts": 257
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T17:28:40",
    "text": "UPDATE:  Authorities say the prime suspect in the bombing was also the sole fatality of the attack. Reproductive health care advocacy groups warned about threats faced by medical providers.",
    "likes": 355,
    "reposts": 66
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T16:59:03",
    "text": "In the wake of President Trump's decision to withdraw from the World Health Organization, the agency is holding its first major meeting. How will that affect WHO — and the United States?",
    "likes": 423,
    "reposts": 136
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T16:40:51",
    "text": "By @idislikestephen.bsky.social \n\nFor a show that's never been shy about celebrating itself, Saturday Night Live was bound to lean hard into its 50th season. But the results were as mixed as ever.",
    "likes": 168,
    "reposts": 12
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T16:26:37",
    "text": "Ocean Vuong's sweeping new novel centers on a depressed 19-year-old college dropout who becomes the caregiver to a widow with dementia.",
    "likes": 211,
    "reposts": 27
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T16:08:19",
    "text": "The children's series has found a new streaming home — Netflix, PBS stations and PBS KIDS will air new episodes on the same day. And Netflix will also run 90 hours from the Sesame Street library.",
    "likes": 17411,
    "reposts": 3338
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T15:57:59",
    "text": "U.S. District Judge Beryl Howell ruled the USIP president and board members were unlawfully fired by President Trump and should be reinstated.",
    "likes": 1679,
    "reposts": 342
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T15:51:37",
    "text": "Escola gives the former first lady a wild second act in the Tony-nominated play Oh, Mary! \"This play is about a woman with a dream that no one around her understands,\" Escola says.",
    "likes": 233,
    "reposts": 20
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T15:40:58",
    "text": "Authorities say they believe their prime suspect in the bombing was also the sole fatality of the attack.",
    "likes": 291,
    "reposts": 52
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T15:17:02",
    "text": "Millions of people in central and eastern Oklahoma, as well as far northwest Arkansas, are in the path of numerous severe thunderstorms expected on Monday.",
    "likes": 401,
    "reposts": 106
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T14:59:22",
    "text": "The meeting appeared part of an effort to reset relations with the Vatican after Pope Francis repeatedly criticized President Trump's migration policy. Vance also gave Pope Leo a Chicago Bears jersey.",
    "likes": 182,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T14:51:15",
    "text": "The National Bonsai and Penjing Museum marks the 400th anniversary of the Yamaki Pine, an ancient tree that survived the 1945 bombing of Hiroshima and has since become a symbol of peace.",
    "likes": 1171,
    "reposts": 166
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T14:27:11",
    "text": "Whether you get your forecast from an app on your phone, a website or a meteorologist on TV, most of the underlying information comes from the federal government.\nBy @rhersher.bsky.social",
    "likes": 6521,
    "reposts": 2052
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T14:25:38",
    "text": "UPDATE: President Trump is working the phones on Monday, holding calls with the leaders of Russia, Ukraine and other European countries as he continues efforts to negotiate an end to the war in Ukraine.",
    "likes": 134,
    "reposts": 21
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T14:19:41",
    "text": "Schools in Maine are in the middle of a political and legal battle between the Trump administration and Gov. Janet Mills. Key programs for the most vulnerable students are at stake.\nBy @jonakimehta.bsky.social",
    "likes": 285,
    "reposts": 75
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T14:07:27",
    "text": "CBS News President Wendy McMahon says she's resigning because \"the company and I do not agree on the path forward.\" CBS' parent company is trying to settle a lawsuit with President Trump.\nBy @davidfolkenflik.bsky.social",
    "likes": 723,
    "reposts": 170
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T13:57:24",
    "text": "Current and former officials say the current effort amounts to the dismantling of the civil rights division and its traditional mission.",
    "likes": 647,
    "reposts": 225
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T13:43:51",
    "text": "JUST IN: The move could potentially lead to the deportations of some 350,000 Venezuelans while litigation continues in the lower courts.",
    "likes": 211,
    "reposts": 92
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T13:39:32",
    "text": "Crypto exchange giant Coinbase is set to join the S&P 500 on Monday. It's the latest stunning development as Trump completely revamps the approach to crypto in the U.S.",
    "likes": 110,
    "reposts": 42
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T13:30:47",
    "text": "With a war in Ukraine and the U.S. rethinking alliances, Britain and the European Union may need each other more than they thought. Here's what happened at Monday's summit — and what didn't.",
    "likes": 234,
    "reposts": 41
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T13:23:21",
    "text": "The delightfully unhinged musical of the cult classic film gets the Tiny Desk treatment.",
    "likes": 254,
    "reposts": 32
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T13:14:38",
    "text": "Hindu temples offer prayers for a path to the U.S. But some in India were stunned by the way the U.S. deported Indians despite Prime Minister Narendra Modi's friendship with President Trump.\nFrom @diaahadid.bsky.social and Omkar Khandekar",
    "likes": 159,
    "reposts": 38
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T13:06:23",
    "text": "Almost all of the wheat grown in the Pacific Northwest is for export, and even before President Trump's trade war, farmers were dealing with rock bottom prices and slagging global demand.",
    "likes": 655,
    "reposts": 208
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T12:55:47",
    "text": "What you eat during the day can affect how well you sleep at night. Sleep researchers explain the impact of diet, caffeine and alcohol on sleep health, and share a list of sleep-supporting foods.",
    "likes": 209,
    "reposts": 47
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T12:46:57",
    "text": "Prostate cancer is one of the most common types of cancer in the U.S., and often treatable. One urologist says Biden has good options ahead — largely thanks to recent advances in research.",
    "likes": 566,
    "reposts": 87
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T12:39:29",
    "text": "The link between tornadoes and climate change isn't as clear as it is for other extreme weather events, though scientists say the clues are there.",
    "likes": 348,
    "reposts": 90
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T12:22:42",
    "text": "President Trump is working the phones on Monday, holding phone calls with the leaders of Russia, Ukraine and European countries as he continues efforts to negotiate an end to the war in Ukraine.",
    "likes": 105,
    "reposts": 8
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T09:42:32",
    "text": "It's the latest big company to back away from its diversity pledges to keep the U.S. government happy.",
    "likes": 4935,
    "reposts": 2518
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T07:20:03",
    "text": "Current and former officials say the current effort amounts to the dismantling of the civil rights division and its traditional mission.",
    "likes": 929,
    "reposts": 350
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T07:08:02",
    "text": "Israel blocked all supplies into Gaza for nearly three months, the longest blockade it has ever imposed on Gaza. But Israel is relenting amid international pressure to allow food into the territory.",
    "likes": 732,
    "reposts": 194
  },
  {
    "username": "NPR",
    "created_at": "2025-05-19T06:09:41",
    "text": "Crypto exchange giant Coinbase is set to join the S&P 500 on Monday. It's the latest stunning development as Trump completely revamps the approach to crypto in the U.S.",
    "likes": 264,
    "reposts": 82
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T19:52:05",
    "text": "Tentative deal ends NJ Transit strike with full service to resume Tuesday, union says https://gothamist.com/news/tentative-deal-ends-nj-transit-strike-train-service-to-resume-for-monday-commute-union-says ",
    "likes": 222,
    "reposts": 19
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T16:38:46",
    "text": "BREAKING NEWS: Biden has been diagnosed with prostate cancer, which has metastasized to the bone, according to a statement from his personal office.",
    "likes": 2089,
    "reposts": 396
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T16:02:26",
    "text": "UPDATE: Investigators have identified Guy Edward Bartkus, 25, as the primary person of interest in the explosion that injured four others.",
    "likes": 3704,
    "reposts": 832
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T15:48:38",
    "text": "Officials said the ship was not assisted by a tugboat as it lost power and drifted before the fatal collision. via @gothamist.com",
    "likes": 857,
    "reposts": 182
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T14:20:55",
    "text": "UPDATE: One person was killed and four were injured in the weekend blast, said Akil Davis, assistant director in charge of the FBI's Los Angeles Field Office.",
    "likes": 659,
    "reposts": 158
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T12:58:54",
    "text": "When they became parents, Dragons Love Tacos illustrator Daniel Salmieri and artist Sophia Haas noticed that they were ... noticing more. So they wrote \"Next to Me,\" their first kids' book together.",
    "likes": 372,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T12:07:15",
    "text": "One person was killed and four were injured in the weekend blast, said Akil Davis, assistant director in charge of the FBI's Los Angeles Field Office.",
    "likes": 1921,
    "reposts": 529
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T11:36:15",
    "text": "The season finale, with host Scarlett Johansson and musical guest Bad Bunny, didn't give any answers about rumored cast departures. By @edeggans.bsky.social",
    "likes": 1210,
    "reposts": 180
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T11:08:59",
    "text": "After expanding state Medicaid programs to cover people in the country without legal status, Democrats are considering changes that would reduce immigrant access.",
    "likes": 243,
    "reposts": 63
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T11:02:19",
    "text": "Bangladesh suffers from extreme air pollution, but a new study shows the brick industry can make small changes to have a big effect on the country's smog problem.",
    "likes": 707,
    "reposts": 131
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T10:42:43",
    "text": "Some religious colleges and universities are cutting programs. Others are seeking mergers to reduce costs and expand offerings.",
    "likes": 380,
    "reposts": 69
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T10:41:46",
    "text": "\"Wasted Love,\" sung by the classically trained countertenor JJ, beat out 25 other songs for the top prize at the international competition held this year in Basel, Switzerland.",
    "likes": 389,
    "reposts": 35
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T10:37:17",
    "text": "UPDATE: More than 5,000 homes were impacted, and 38 people were injured after an EF3 tornado tore across St. Louis. via @stlpublicradio.bsky.social",
    "likes": 5727,
    "reposts": 1680
  },
  {
    "username": "NPR",
    "created_at": "2025-05-18T10:15:03",
    "text": "UPDATE: The ship, which was on a world tour, is used as a training vessel by the Mexican Navy. via @gothamist.com",
    "likes": 1624,
    "reposts": 339
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T17:02:56",
    "text": "Over 20 people have died since severe storms and tornadoes hit Kentucky and Missouri overnight. Meteorologists are beginning to survey the damage.",
    "likes": 4129,
    "reposts": 1174
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T16:51:56",
    "text": "Fossils of the underwater predator shed new light on biodiversity from the Cambrian period.",
    "likes": 1707,
    "reposts": 290
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T14:42:39",
    "text": "\"Wind is unlike many other hazards because you really can't see it,\" says AAA's Bill Van Tassel.",
    "likes": 412,
    "reposts": 94
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T14:16:14",
    "text": "via @weku.bsky.social \nThe National Weather Service Forecast Office in Jackson, Kentucky, was fully staffed overnight as tornadoes descended on London and Somerset, despite staffing shortages.",
    "likes": 954,
    "reposts": 205
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T13:24:25",
    "text": "UPDATE: Powerful storms and tornadoes tore through several Midwestern and Southern states overnight Friday, leaving carnage and flattened buildings in their wake.",
    "likes": 3154,
    "reposts": 888
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T13:18:27",
    "text": "NJ Transit and the union representing locomotive engineers are returning to the table Saturday, transit officials said. via \n@gothamist.com",
    "likes": 610,
    "reposts": 116
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T12:15:58",
    "text": "Far-Flung Postcards is a weekly series in which NPR's international correspondents share snapshots capturing moments from their lives and work in places around the world.",
    "likes": 339,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T11:36:32",
    "text": "Budget reconciliation may not be catchy, but it's been a vital tool for many presidents, including Ronald Reagan, whose first federal budget was a watershed in the history of federal fiscal policy.",
    "likes": 1246,
    "reposts": 301
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T11:16:25",
    "text": "President Trump and his allies have long made false claims of widespread noncitizen voting. Now, as the GOP pursues new restrictions, experts worry isolated arrests will be used to push the new rules.",
    "likes": 612,
    "reposts": 182
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T11:02:48",
    "text": "Hollywood's plummeting film and TV production levels have studio executives and grassroots groups pushing for better incentives to keep business in California.\nBy @radioactive22.bsky.social",
    "likes": 388,
    "reposts": 83
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T10:41:59",
    "text": "Powerful storms and tornadoes tore through several Midwestern and Southern states overnight Friday, leaving carnage and flattened buildings in their wake.",
    "likes": 1861,
    "reposts": 579
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T10:41:27",
    "text": "Massachusetts Judge Shelley Joseph was accused of helping an undocumented immigrant evade authorities more than seven years ago. Her case is still unresolved.",
    "likes": 804,
    "reposts": 226
  },
  {
    "username": "NPR",
    "created_at": "2025-05-17T10:16:42",
    "text": "NPR has identified nearly 40 small, independent entities – both inside and outside the federal government's control – that a team of young DOGE staffers has tried to access in recent weeks.",
    "likes": 2006,
    "reposts": 974
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T17:45:30",
    "text": "Boeing agreed last year to plead guilty to defrauding regulators after the crashes of two 737 Max jets, in 2018 and 2019, that killed 346 people. But a federal judge rejected that proposed plea deal.",
    "likes": 1828,
    "reposts": 795
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T17:33:22",
    "text": "Facing allegations of sexual misconduct, Karim Khan has temporarily stepped aside as a U.N. investigation enters its final stage, the International Criminal Court announced Friday.",
    "likes": 538,
    "reposts": 151
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T17:17:45",
    "text": "The Supreme Court said its order is meant to preserve its jurisdiction over the case while letting lower courts decide how much notice should be given to people the government wants to remove under the Alien Enemies Act. It is not addressing whether Trump's invocation of the act was legal.",
    "likes": 553,
    "reposts": 112
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T16:31:05",
    "text": "The Trump administration this week eliminated funding for Harvard research projects across a host of areas, from the origins of breast cancer and the impact of nutrition on fertility to antibiotic resistance.",
    "likes": 304,
    "reposts": 179
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T15:55:19",
    "text": "Government forces retook the capital city from rebel troops in April. Now comes the task of rebuilding what was once a bustling metropolis on the Nile.",
    "likes": 157,
    "reposts": 22
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T15:39:55",
    "text": "An attempt by DOGE to assign a team to the independent Government Accountability Office was rejected Friday. The GAO is part of the legislative branch and not subject to DOGE's request.",
    "likes": 2664,
    "reposts": 638
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T15:39:03",
    "text": "Flamingos look silly when they eat, but new research suggests they're actually being smart.\nBy @gbrumfiel.bsky.social",
    "likes": 217,
    "reposts": 34
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T15:31:03",
    "text": "Cycling is especially good for people with long-running knee problems or health issues. I've been able to do everything I've wanted to, but a clamor of what-ifs were often in the back of my mind.",
    "likes": 348,
    "reposts": 59
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T15:06:37",
    "text": "\"Mutual abuse\" is a term you may have heard in celebrity abuse trials - here's how to make sense of it.",
    "likes": 87,
    "reposts": 13
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T14:48:31",
    "text": "Accompanied by a 16-piece band, Carín León's commanding presence shows why he's one of the best in the Mexican Regional scene.",
    "likes": 161,
    "reposts": 24
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T14:48:23",
    "text": "President Trump was greeted like royalty during his four-day trip to the Middle East, his first major foreign trip of this second term, where it was all about business deals and not moral leadership, writes correspondent Domenico Montanaro.",
    "likes": 184,
    "reposts": 55
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T14:24:57",
    "text": "Federal judges are looking back to the 18th century to define what constitutes an invasion, weighing a key legal argument for the Trump administration's use of a wartime deportation authority.",
    "likes": 279,
    "reposts": 69
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T14:11:58",
    "text": "The former FBI director posted — then deleted — a picture of seashells forming \"8647.\" Trump and his allies view it as a call for his assassination, but Comey says he was unaware of that meaning.",
    "likes": 510,
    "reposts": 109
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T14:08:03",
    "text": "Cathy Harris and Gwynne Wilcox, Democratic board members of independent agencies, argue President Trump lacked the authority to fire them, citing federal law and Supreme Court precedent.",
    "likes": 1271,
    "reposts": 269
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T13:52:46",
    "text": "By @mariaaspan.bsky.social \n\nThe health care giant's shares are down more than 50% in the last month. That's hurting the powerful U.S. stock-market index.",
    "likes": 399,
    "reposts": 72
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T13:48:03",
    "text": "It can be intimidating to enter a new queer space, especially if you're starting to explore your gender and sexuality. Organizers share advice on how to find a support network with confidence.",
    "likes": 408,
    "reposts": 78
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T13:38:04",
    "text": "New financial pressures on clinics that provide abortion are forcing some to close their doors, even in states that protect the right to abortion.",
    "likes": 559,
    "reposts": 200
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T13:34:07",
    "text": "The Apple TV+ show takes what might be the oldest sci-fi premise there is — what does it mean to be human? — and mines it for comedy gold.\nBy @ghweldon.bsky.social",
    "likes": 358,
    "reposts": 48
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T13:26:48",
    "text": "Criticism of \"activist\" judges predates the term and has come from both ends of the political spectrum. Democratic and Republican presidents alike have accused the courts of exceeding their constitutional role.",
    "likes": 137,
    "reposts": 23
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T13:20:11",
    "text": "Motown legend Smokey Robinson is being criminally investigated by the Los Angeles County Sheriff's Department following allegations accusing him of a series of sexual assaults.",
    "likes": 122,
    "reposts": 28
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T13:05:56",
    "text": "An attorney asked Ventura a series of questions about Ventura admittedly feeling jealous during her relationship with Combs and Ventura begrudgingly planning parts of their sex life.",
    "likes": 66,
    "reposts": 7
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T12:54:34",
    "text": "Aminé conjures the summer. Rico Nasty goes \"rap-rock.\" Tune-Yards samples a toddler.",
    "likes": 67,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T11:09:03",
    "text": "Hadi Matar got the maximum sentence for attempted murder. He was found guilty in February for repeatedly stabbing author Salman Rushdie during a 2022 lecture and wounding another person on stage.",
    "likes": 3786,
    "reposts": 631
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T10:00:06",
    "text": "NJ Transit rail service shuts down as workers go on historic strike https://gothamist.com/news/nj-transit-rail-service-shuts-down-as-workers-go-on-historic-strike ",
    "likes": 268,
    "reposts": 83
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T10:00:25",
    "text": "A Mayan artifact is set to return to Mexico after being held by a Chicago family for nearly 40 years, the National Museum of Mexican Art announced Friday.",
    "likes": 320,
    "reposts": 69
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T10:03:07",
    "text": "The Trump administration has so far frozen about $11 billion in research funding. University leaders say no other source can fill the void.",
    "likes": 884,
    "reposts": 393
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T09:34:20",
    "text": "Will a new-look Indiana Fever contend in Caitlin Clark's second year? Will A'ja Wilson win a record 4th MVP? And the biggest question of all: Can the league as a whole build on last season's success?",
    "likes": 216,
    "reposts": 51
  },
  {
    "username": "NPR",
    "created_at": "2025-05-16T06:20:37",
    "text": "An attorney asked Ventura a series of questions about Ventura admittedly feeling jealous during her relationship with Combs and Ventura begrudgingly planning parts of their sex life.",
    "likes": 127,
    "reposts": 13
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T19:55:27",
    "text": "Ben Pickman of The Athletic says the 2025 WNBA season brings superstar debuts, rising rivalries and major questions about pay for athletes.",
    "likes": 222,
    "reposts": 32
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T19:16:00",
    "text": "The Broadway composer of \"Annie\" and \"Bye Bye Birdie\" died Thursday at 96.",
    "likes": 1669,
    "reposts": 291
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T17:57:15",
    "text": "The grand final of this year's Eurovision Song Contest takes place on Saturday, May 17, in Basel, Switzerland. It's an annual celebration of melody, rhythm, fabulousness and glitter. By @ghweldon.bsky.social",
    "likes": 205,
    "reposts": 44
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T17:44:54",
    "text": "Pianist Hiromi picks a track from 10 different bands she's led or joined, tracing the bold ideas and unexpected turns that have shaped her ever-evolving sound.",
    "likes": 258,
    "reposts": 33
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T17:33:40",
    "text": "Together, the two retailers will have to wade the choppy waters of new tariffs on imports, including footwear. And they'll face the growing competition from shoe brands selling directly to shoppers.",
    "likes": 343,
    "reposts": 72
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T17:08:21",
    "text": "The outage in Colorado comes amid increasing scrutiny on the nation's main aviation agency following outages at Newark Liberty International Airport just a few weeks ago.",
    "likes": 2690,
    "reposts": 980
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T17:03:34",
    "text": "If approved, the move would be the first time Guard troops at the national level have been asked to assist in the removal of migrants in the U.S. without legal status.",
    "likes": 6077,
    "reposts": 3008
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T16:39:42",
    "text": "Co-directors Zach Lipovsky and Adam Stein say they hope audiences will be cringing – and laughing – as they watch Final Destination Bloodlines, the sixth installment in the beloved horror franchise.",
    "likes": 109,
    "reposts": 6
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T16:23:43",
    "text": "While it's common for U.S. presidents to visit churches, only a few have made official visits to mosques.",
    "likes": 165,
    "reposts": 30
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T16:19:35",
    "text": "Federal rules to reduce the levels of \"forever chemicals\" in drinking water are getting delayed.",
    "likes": 925,
    "reposts": 394
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T16:05:43",
    "text": "In 1993, Adam Duritz and his band Counting Crows took roots-rock to new heights with their debut August and Everything After. More than 30 years later, they offer a new album, cut from the same cloth.",
    "likes": 284,
    "reposts": 30
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T16:02:59",
    "text": "The latest issue of \"The Strand Magazine\" contains rare stories by the iconic midcentury writers Ian Fleming and Graham Greene.",
    "likes": 139,
    "reposts": 23
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T15:42:19",
    "text": "Max will become HBO Max again this summer, Warner Bros. Discovery said this week — two years after the name change that hasn't stuck. Here's what to know about the rebrand (and some others of note).",
    "likes": 321,
    "reposts": 32
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T15:33:14",
    "text": "People ran around San Francisco on Tuesday looking for a chest filled with gold and local artifacts after seeing an anonymous post on Reddit with cryptic clues.",
    "likes": 329,
    "reposts": 44
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T15:28:11",
    "text": "Since abortion became almost entirely illegal in Texas in 2021, the state has seen a significant rise in the number of women who die in pregnancy or after giving birth. A new bill aims to change that.",
    "likes": 3931,
    "reposts": 1380
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T15:04:00",
    "text": "A researcher monitoring Axial Seamount, 300 miles off the coast of Oregon, says the eruption is expected to happen before the year is over.",
    "likes": 386,
    "reposts": 104
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T14:53:46",
    "text": "Jonathan Groff was destined for the stage. On this week's Wild Card with Rachel Martin Jonathan tells Rachel about how he takes criticism and learning to play piano for his new musical \"Just in Time.\"",
    "likes": 113,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T14:34:58",
    "text": "The all-female Korean Haenyeo divers show genetic adaptations to cold water diving involving their blood pressure and cold tolerance. \"It's like a superpower,\" says one of the researchers.",
    "likes": 1220,
    "reposts": 211
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T14:13:50",
    "text": "A pair of U.K. scholars discovered the mislabeled document in Harvard Law School's digital archives. The university bought it for just $27.50 in 1946.  It turned out to be an authentic copy dating to 1300.",
    "likes": 8242,
    "reposts": 1572
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T14:01:22",
    "text": "From headaches and fatigue to hair loss and sleep troubles, the symptoms marking the transition to menopause can overlap with other conditions. Here's what to know and how to get help.",
    "likes": 213,
    "reposts": 44
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T13:59:54",
    "text": "New York Times columnist Thomas Friedman says President Trump \"made a very good move\" in meeting with Syria's interim president and announcing he would lift sanctions on Israel's neighbor.",
    "likes": 64,
    "reposts": 10
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T13:35:24",
    "text": "After her dreams of becoming a doctor were denied, one California woman is working to make the profession more accessible to those with disabilities.",
    "likes": 704,
    "reposts": 157
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T13:22:53",
    "text": "As the Supreme Court takes up birthright citizenship, a new poll finds that less than a third of Americans want it to end. But other parts of the White House's immigration crackdown are more popular.",
    "likes": 520,
    "reposts": 119
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T13:19:57",
    "text": "For the first time, doctors have created a customized treatment using the revolutionary gene-editing technique known as CRISPR to treat a baby with a rare, life-threatening genetic disorder.",
    "likes": 3360,
    "reposts": 681
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T13:10:29",
    "text": "The arguments focused on a separate question: can federal district court judges rule against the administration on a nationwide basis.\nBy @ninatotenberg.bsky.social",
    "likes": 477,
    "reposts": 151
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T13:07:19",
    "text": "Customers are encouraged to stop using several eye irritation products, including gels and artificial tears.",
    "likes": 155,
    "reposts": 81
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T12:59:31",
    "text": "Ukrainian President Volodymyr Zelenskyy is in Turkey for direct talks with Russia. But the Kremlin sent a lower-level delegation that doesn't include President Vladimir Putin.",
    "likes": 306,
    "reposts": 53
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T12:46:06",
    "text": "President Trump is visiting Qatar and the U.A.E. after inking big weapons and tech deals in Saudi Arabia. So far, his trip hasn't seemed to push forward chances for a ceasefire in Gaza.",
    "likes": 214,
    "reposts": 53
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T12:35:27",
    "text": "One of Trump's executive orders moves to end birthright citizenship, a right enshrined in the Constitution. Here's what you need to know about the legal principle and its possible future.",
    "likes": 319,
    "reposts": 107
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T06:56:16",
    "text": "UP FIRST: The Supreme Court will hear historic arguments over birthright citizenship today. And, House Republicans are working to advance Trump's \"big beautiful bill,\" but there is division over policies.",
    "likes": 604,
    "reposts": 167
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T06:33:57",
    "text": "Public broadcasting officials from across the country plan to descend on Capitol Hill today in hopes of convincing lawmakers to preserve their federal funding despite pressure from President Trump and his allies.",
    "likes": 2176,
    "reposts": 483
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T21:47:18",
    "text": "NEW: Missouri GOP legislators approved a ballot item that would ask voters to ban most abortions — again.",
    "likes": 126,
    "reposts": 45
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T06:01:04",
    "text": "In towns along the northern border, residents lament this new strain imposed on their long cross-border friendship.",
    "likes": 242,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-15T06:03:20",
    "text": "It was the second night of heavy bombing, after airstrikes Wednesday on northern and southern Gaza killed dozens of people, including almost two dozen children.",
    "likes": 753,
    "reposts": 380
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T17:07:39",
    "text": "Republicans want to use the federal tax code to create a national school voucher, even in states where voters have fought such efforts.",
    "likes": 428,
    "reposts": 149
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T15:22:52",
    "text": "If you’re one of the thousands who gave this month – THANK YOU! \n\nWe love reading your comments about the role public media plays in your life, and are proud to be here for you. \n\nIf you haven’t had a chance to donate, please give what you can now: n.pr/3EYClNR",
    "likes": 5041,
    "reposts": 948
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T13:17:20",
    "text": "Fabian Schmidt, a legal resident and green card holder who was detained at Logan, is now free after two months in an ICE detention facility. He speaks to GBH News in his first interview after his release: bit.ly/43dt8cH",
    "likes": 381,
    "reposts": 124
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T13:24:13",
    "text": "2034 might be a ways off, but #SLC Winter Games organizers want to learn what venue communities hope for and let them know what to expect.",
    "likes": 19,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T13:47:09",
    "text": "NPR's Juana Summers talks to Antoine Renard, of the U.N. World Food Programme, about the increasing risk of famine in Gaza as Israel's aid blockade continues.",
    "likes": 410,
    "reposts": 187
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T13:33:21",
    "text": "Ryan Routh is accused of the 2024 assassination attempt of Donald Trump as the then-presidential candidate was golfing at his course in West Palm Beach, Fla. Routh has pleaded not guilty.",
    "likes": 240,
    "reposts": 43
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T10:54:15",
    "text": "Poland is preparing to repel a Russian invasion, including a plan to train every adult male in the country to be ready for war. We go to Poland to see what the preparations look like.",
    "likes": 1715,
    "reposts": 565
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T09:30:35",
    "text": "Gulf states are keen to invest in Syria, which has important mineral and oil reserves, but had been prevented from doing so by U.S. sanctions. President Trump has now pledged to lift the restrictions.",
    "likes": 246,
    "reposts": 64
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T06:51:52",
    "text": "Pope Leo XIV and Ukraine's President Zelenskyy spoke by phone recently, according to the Vatican.",
    "likes": 2337,
    "reposts": 356
  },
  {
    "username": "NPR",
    "created_at": "2025-05-14T06:03:40",
    "text": "NPR has identified three Trump administration officials with close ties to antisemitic extremists, including a prominent Holocaust denier.",
    "likes": 5560,
    "reposts": 2390
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T16:09:34",
    "text": "José Mujica, the charismatic former guerrilla fighter who later went on to lead Uruguay and became known as \"the world's poorest president\" for his austere lifestyle, has died at 89.",
    "likes": 5561,
    "reposts": 1011
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T14:44:32",
    "text": "Cassie took the stand on Tuesday morning as the star witness in the first full day of testimony in the federal trial against hip-hop mogul Sean Combs.",
    "likes": 437,
    "reposts": 76
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T11:55:07",
    "text": "UnitedHealth, one of the world's largest companies, is having a publicly awful year: The killing of a top executive, a massive data breach, and mounting costs in its key Medicare business. \n\nToday, that all caught up w/ now-former CEO Andrew Witty, I report for @npr.org: www.npr.org/2025/05/13/n...",
    "likes": 542,
    "reposts": 125
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T11:52:02",
    "text": "The health care conglomerate is facing mounting financial problems – and ongoing consumer anger over high costs and denied claims.",
    "likes": 6963,
    "reposts": 1822
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T09:28:25",
    "text": "Consumer prices in April were up 2.3% from a year ago, the smallest annual increase in more than four years.  Grocery prices fell 0.4%, thanks to a large drop in the price of eggs.",
    "likes": 458,
    "reposts": 98
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T08:48:51",
    "text": "A new study estimates that 19 million children in the U.S. have a parent with a substance use disorder and that alcohol is the most commonly used substance by the parents.",
    "likes": 2712,
    "reposts": 724
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T07:40:47",
    "text": "While Big Pharma seems ready to weather the tariff storm, independent pharmacists and makers of generic drugs — which account for 90% of U.S. prescriptions — see trouble ahead for patients.",
    "likes": 664,
    "reposts": 248
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T07:05:41",
    "text": "A French court on Tuesday found Gérard Depardieu guilty of sexually assaulting two women on a film set, sentencing the French film icon to an 18-month suspended prison term.",
    "likes": 560,
    "reposts": 90
  },
  {
    "username": "NPR",
    "created_at": "2025-05-13T06:22:28",
    "text": "As many federal governments slow — or reverse — climate action, Austria's capital, Vienna, wants to show how cities can take the lead.",
    "likes": 3645,
    "reposts": 820
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T21:04:44",
    "text": "It has been over 20 years since NBC had rights to broadcast NBA games. Its last run was during the 90s, which coincided with Michael Jordan's reign over basketball.",
    "likes": 594,
    "reposts": 72
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T19:32:58",
    "text": "Inside boxes found in the basement were documents \"intended to consolidate and propagate Adolf Hitler's ideology in Argentina,\" the court said. Supreme Court president Horacio Rosatti has ordered a review.",
    "likes": 725,
    "reposts": 213
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T19:18:48",
    "text": "DOGE staffers tried to assign a team to the independent Corporation for Public Broadcasting after President Trump's purported firing of three board members last month.",
    "likes": 715,
    "reposts": 275
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T18:00:24",
    "text": "The lottery recently banned online couriers, but some state legislators are considering more regulation.",
    "likes": 137,
    "reposts": 20
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T17:39:51",
    "text": "The new Apple TV+ show starring Alexander Skarsgård features a mix of special effects-laden action, deadpan humor and social commentary. It deserves a big audience. \n\nBy @edeggans.bsky.social",
    "likes": 1164,
    "reposts": 208
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T17:31:45",
    "text": "The ceasefire has halted what some analysts say was the most serious fighting between the two countries since a 1971 war. But India's recent suspension of a key water-sharing treaty remains in place.",
    "likes": 282,
    "reposts": 45
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T16:57:47",
    "text": "Todd Blanche, a former personal lawyer for President Trump, is now acting Librarian of Congress. According to his public profile, Blanche has no experience working in libraries or archives.",
    "likes": 1060,
    "reposts": 399
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T16:42:53",
    "text": "Women's rights advocates say the case is about whether France's justice system is truly ready to reckon with sexual violence.",
    "likes": 310,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T16:23:09",
    "text": "Taking a page from President Trump's playbook, British Prime Minister Keir Starmer announced visa restrictions, using language his critics said was dangerous.",
    "likes": 224,
    "reposts": 64
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T16:07:34",
    "text": "From @carriejohnson.bsky.social \n\nMore than 30,000 people have already voted in the election for the president of the D.C. Bar Association, more than triple the previous record set in 1990.",
    "likes": 3877,
    "reposts": 1020
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:57:21",
    "text": "There's an invitation in these songs, largely pulled from her 2024 release Lives Outgrown, to bear witness to Gibbons' own tragedy and transformation.",
    "likes": 143,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:48:11",
    "text": "Government incentives for climate-friendly upgrades are confusing to navigate, and it can be hard to find businesses that sell them. So a new industry is emerging to help: the decarbonization coach.\nBy @jeffbradynews.bsky.social",
    "likes": 228,
    "reposts": 44
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:38:58",
    "text": "A Biden-era rule eases the path for workers to be sponsored for U.S. permanent residency, an attractive option for those in horse-racing looking for a competitive edge.\nFrom @ximenabustillo.bsky.social",
    "likes": 148,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:29:04",
    "text": "Two studies of wild chimps point to the evolutionary roots of human language. The studies found that chimp communication often relies on rhythmic structures and call combinations.",
    "likes": 438,
    "reposts": 73
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:20:40",
    "text": "President Trump is looking to use the IRS to achieve some of his political goals. Some experts see parallels with Nixon's efforts to interfere with the agency.",
    "likes": 473,
    "reposts": 155
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:14:52",
    "text": "The church said it's terminating a decades-long partnership with the federal government to help refugees arriving in the U.S., citing moral opposition to resettling white Afrikaners from South Africa.",
    "likes": 36758,
    "reposts": 9308
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:10:33",
    "text": "Experts tell NPR the gift violates the Foreign Emoluments Clause and raises questions about what Qatar might expect from Trump in return. It's not clear whether critics in Congress can stop it from happening.",
    "likes": 1207,
    "reposts": 294
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T15:02:29",
    "text": "When it comes to rice and pasta, dieticians recommend eating brown or whole grain because they're more nutritious. But you can create a super nutrient in white rice and white pasta. Here's the trick.",
    "likes": 330,
    "reposts": 78
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T14:50:20",
    "text": "All Things Considered wants to highlight volunteers who are going above and beyond. Want to nominate someone, a group or share how volunteerism has made a difference in your life? Let us know.",
    "likes": 127,
    "reposts": 34
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T14:42:47",
    "text": "The refugees were admitted to the U.S. after an executive order from President Trump, and under an expedited and unconventional process for the U.S. refugee resettlement program.",
    "likes": 252,
    "reposts": 77
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T14:34:38",
    "text": "A Republican overhaul would reduce borrowers' repayments options from several plans to just two.",
    "likes": 155,
    "reposts": 60
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T14:26:18",
    "text": "By @aishaharris.bsky.social \n\nCelebrity guests on The Jennifer Hudson Show — Michelle Obama, Usher, Sheryl Lee Ralph, Tina Knowles to name a few",
    "likes": 182,
    "reposts": 14
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T14:13:19",
    "text": "Olivia and Liam are the most popular baby names now, but Social Security Administration data shows oak-based names are gaining popularity, particularly in conservative parts of the country.",
    "likes": 139,
    "reposts": 10
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T14:00:23",
    "text": "After a brief delay, the jurors and alternates for the mogul's trial for racketeering conspiracy and prostitution have been set. The trial is expected to last eight weeks.",
    "likes": 149,
    "reposts": 20
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:53:19",
    "text": "The first group of white Afrikaner South Africans granted refugee status by Trump administration arrive in U.S. while most other refugee admissions are still suspended.",
    "likes": 212,
    "reposts": 74
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:47:35",
    "text": "In a time of aggressive immigration enforcement, some international musicians are deciding that going through the complicated process of getting a U.S. artist visa may not be worth the financial and safety risks.",
    "likes": 2551,
    "reposts": 604
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:40:47",
    "text": "President Trump wants to lower drug prices in the U.S. by tying them to the prices paid in other developed countries. The pharmaceutical industry has long opposed the approach.",
    "likes": 257,
    "reposts": 44
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:38:06",
    "text": "Check your receipt. Grow your own veggies. Ask about senior discounts. NPR readers share their top tips on cutting costs at the grocery store.",
    "likes": 300,
    "reposts": 69
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:35:53",
    "text": "Have you lost a loved one in service to the U.S.? Share your story with NPR for Memorial Day.",
    "likes": 115,
    "reposts": 28
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:21:15",
    "text": "As the Department of Veterans Affairs tries to meet President Trump's goal of cutting 15% of staff, vets are concerned there won't be enough doctors and nurses.",
    "likes": 782,
    "reposts": 223
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:15:26",
    "text": "Prosecutors are scheduled to begin their arguments today against the rap mogul, who is accused of racketeering and sex trafficking. Here is an overview of Combs' career and the charges he faces.\nBy @anastasiat.bsky.social",
    "likes": 124,
    "reposts": 17
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T13:08:24",
    "text": "Some of the microplastics we ingest may come from the kitchen tools we use to prepare what we eat. If you want to reduce your reliance on plastic, here are some ideas.",
    "likes": 314,
    "reposts": 94
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T12:58:33",
    "text": "Large language models like ChatGPT and DeepSeek are increasingly being looked at for their potential to help make decisions in high-stakes situations.",
    "likes": 162,
    "reposts": 39
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T12:45:47",
    "text": "The New World screwworm is endemic in parts of Latin America and the Caribbean — and its northward spread into Mexico has alarmed U.S. officials. It can kill a full-grown cow in one to two weeks.",
    "likes": 559,
    "reposts": 223
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T12:42:35",
    "text": "At services on Sunday, some Catholics took particular pride in the election of the first American pontiff, who has familial ties to multiple places across the country.",
    "likes": 212,
    "reposts": 21
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T12:39:51",
    "text": "Kosmos 482 rocketed into space in 1972 on a quest to reach Venus, but its journey was scuttled by an apparent engine malfunction.",
    "likes": 219,
    "reposts": 30
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T12:39:24",
    "text": "The offer, which comes on the eve of Trump's visit to the Middle East, raises major ethical and legal questions.",
    "likes": 389,
    "reposts": 87
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T08:10:53",
    "text": "Do you need a climate or decarbonization coach? Enough people are having trouble making climate-friendly purchases that companies, nonprofits and agencies are stepping in to help. Here's my @npr.org story: www.npr.org/2025/05/07/n...",
    "likes": 101,
    "reposts": 29
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T12:15:53",
    "text": "JUST IN: Edan Alexander, an Israeli soldier raised in New Jersey, is believed to be the last living U.S. citizen captured by Hamas on Oct. 7, 2023. Four other Americans' bodies are still held in Gaza.",
    "likes": 211,
    "reposts": 39
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T11:57:03",
    "text": "You count on the NPR Network. THANK YOU to our supporters who are showing we can count on you too. \n\nIf you haven’t given yet, it’s time to join the movement to defend public media. \n\nDonate now: n.pr/3EYClNR",
    "likes": 8736,
    "reposts": 2057
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T10:04:35",
    "text": "The first group of white Afrikaner South Africans granted refugee status by Trump administration enroute to U.S. as most other refugee admissions still suspended.",
    "likes": 433,
    "reposts": 175
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T07:32:19",
    "text": "The remarks come just one day after calling for a ceasefire and access to humanitarian aid in Gaza and an end to the war in Ukraine.",
    "likes": 1904,
    "reposts": 309
  },
  {
    "username": "NPR",
    "created_at": "2025-05-12T06:16:35",
    "text": "American levies on Chinese goods will drop from at least 145% to 30% for an initial period of 90 days, while Chinese levies are set to fall from at least 125% to 10% on American goods.",
    "likes": 2089,
    "reposts": 471
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T13:55:26",
    "text": "The proposed solution would only provide food and aid to around 60 percent of Gaza's civilians initially, according to a copy of the proposal reviewed by NPR.",
    "likes": 437,
    "reposts": 139
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T12:28:13",
    "text": "Putting together a go bag doesn't have to be daunting or expensive. Here's how to create a functional kit that doesn't require much money, time or effort.",
    "likes": 1107,
    "reposts": 308
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T11:41:29",
    "text": "NPR received nearly 500 submissions from around the country and beyond from people who shared favorite memories of their mothers — whether she's still present for them to hug or lives on in their hearts.",
    "likes": 601,
    "reposts": 89
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T11:39:43",
    "text": "When she was a kid growing up in Kenya, Esther Ngumbi was mad at her mom for being so tough on her. Now she's grateful — but she wanted to know, did her mother realize how her kids felt at the time?",
    "likes": 256,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T11:09:02",
    "text": "High-end accommodations for pooches are thriving in one of the world's most unequal countries. They have their defenders and their critics. Who's barking up the right tree?",
    "likes": 173,
    "reposts": 20
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T10:49:30",
    "text": "Upset by tariffs and President Trump's insistence on making them the 51st state, Canadians are boycotting the U.S. Without them, the Rubber Duck Museum can't stay afloat. So, it's moving to Canada.",
    "likes": 1101,
    "reposts": 224
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T10:32:37",
    "text": "In 1978, Congress gave federal workers the right to organize and bargain collectively, finding it in the public interest. Now Trump wants to end those labor rights for most of the federal workforce.",
    "likes": 1150,
    "reposts": 422
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T10:22:26",
    "text": "The National Oceanic and Atmospheric Administration says an \"atmospheric river\" event is set to hit Florida and other parts of the Southeast. The weather event typically occurs in the West.",
    "likes": 2466,
    "reposts": 708
  },
  {
    "username": "NPR",
    "created_at": "2025-05-11T10:20:48",
    "text": "The Vietnam veteran and former businessman got his diploma from South Carolina State University on Friday. He signed up for classes after hearing about the police killing of protesting students in 1968.\nFrom @jenniferludden.bsky.social",
    "likes": 872,
    "reposts": 108
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T18:22:23",
    "text": "We now have a dedicated series page for everything U.S. vs China: www.npr.org/series/g-s1-... It helps our audience keep track of the twists and turns in one of the world's most consequential diplomatic relations.",
    "likes": 192,
    "reposts": 52
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T16:29:43",
    "text": "The blame game began only hours after President Trump announced Saturday that the U.S. had mediated an immediate ceasefire.",
    "likes": 427,
    "reposts": 79
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T14:16:37",
    "text": "Women can use a wand to collect a vaginal sample, then mail it to a lab that will screen for cervical cancer. The device will be available by prescription through a telehealth service.\nBy @jenniferludden.bsky.social",
    "likes": 6796,
    "reposts": 1555
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T14:05:41",
    "text": "The meetings between top U.S. and Chinese officials in Geneva represent the first potential efforts to end a trade war that has frazzled financial markets.",
    "likes": 195,
    "reposts": 29
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T02:00:16",
    "text": "Scoop: Elizabeth Holmes is advising her partner on the launch of a new biotech startup. It's name? Blood flower\n\nnpr.org/2025/05/10/n...",
    "likes": 245,
    "reposts": 43
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T12:37:08",
    "text": "It can be tough to navigate relationships when our friends start having kids. This guide can help both parents and child-free folks figure out how to stay connected in a new life stage.",
    "likes": 309,
    "reposts": 35
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T12:15:24",
    "text": "Chinese consumers have less and less confidence to splurge, which spells trouble for government efforts to jump-start consumer spending to offset deflation and mitigate the trade war with the U.S.",
    "likes": 346,
    "reposts": 54
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T11:45:00",
    "text": "UPDATE: India and Pakistan on Saturday agreed to a ceasefire following U.S.-led talks to end the most serious military confrontation between the nuclear-armed rivals in decades.",
    "likes": 280,
    "reposts": 37
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T11:40:59",
    "text": "The late artist Ruth Asawa regularly drew the bouquets people gave her. Years later, some of the sketches made it back to those who gave flowers.",
    "likes": 694,
    "reposts": 98
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T11:29:53",
    "text": "Jeanine Pirro is the latest Fox News personality to join the Trump administration. She will serve as the interim U.S. attorney in Washington, D.C., replacing Ed Martin whose confirmation ran into problems in the Senate.\nBy @davidfolkenflik.bsky.social",
    "likes": 218,
    "reposts": 42
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T11:18:12",
    "text": "President Trump is yet to broker an end to the war in Gaza. So the first big trip of his second term will focus on big investments instead.",
    "likes": 330,
    "reposts": 92
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T11:12:31",
    "text": "U.K. Prime Minister says Europe and the U.S. are \"calling out\" Putin, by proposing a 30-day unconditional ceasefire starting Monday.",
    "likes": 593,
    "reposts": 103
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T10:54:53",
    "text": "In 1989, Trump took out full-page newspaper ads demanding the death penalty \"for roving bands of wild criminals.\" The Detroit Opera decided to program this work long before the presidential election.",
    "likes": 1032,
    "reposts": 251
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T10:51:15",
    "text": "As the Department of Veterans Affairs tries to meet President Trump's goal of cutting 15% of staff, vets are concerned there won't be enough doctors and nurses.",
    "likes": 709,
    "reposts": 213
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T10:41:33",
    "text": "Since North Carolina passed a \"bathroom\" law in 2016, the number of bills has grown and Republicans have used the issue in campaigns. Democrats are still working out how to respond.",
    "likes": 223,
    "reposts": 30
  },
  {
    "username": "NPR",
    "created_at": "2025-05-10T10:11:45",
    "text": "The incarcerated former Silicon Valley star is advising her partner on a new health tech startup. Holmes was convicted of defrauding investors in her blood-testing company Theranos.\nBy @bobbyallyn.bsky.social",
    "likes": 1215,
    "reposts": 369
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T16:59:25",
    "text": "One privacy advocate called the unprecedented data demands \"absolutely alarming\" and \"reckless.\"\n\nOthers warn the data could be used to enable deportation and mass surveillance efforts –– and would do little to address improper SNAP payments.",
    "likes": 336,
    "reposts": 101
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T16:12:54",
    "text": "The emails obtained by NPR also show the nationwide directive regarding the Supplemental Nutrition Assistance Program, or SNAP, follows a request by federal auditors for information that included citizenship data but not other data typically used to verify financial eligibility for the program.",
    "likes": 246,
    "reposts": 71
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T16:03:34",
    "text": "USDA’s demand for sensitive data from states about more than 40 million food stamp recipients comes as DOGE is amassing government data for immigration enforcement purposes.",
    "likes": 233,
    "reposts": 78
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T15:57:57",
    "text": "@npr.org EXCLUSIVE: \n\nThe Department of Agriculture is demanding states hand over personal data of food assistance recipients — including Social Security numbers, addresses and, in at least one state, citizenship status, according to emails shared with NPR.",
    "likes": 935,
    "reposts": 676
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T18:07:00",
    "text": "The likelihood that the newly elected pope has consumed a Chicago style hot dog is not zero. And that means something.",
    "likes": 1846,
    "reposts": 170
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T17:53:39",
    "text": "As the Trump administration moves to quickly expand immigration detention space, a series of standoffs have emerged between city officials and the private prison companies.",
    "likes": 736,
    "reposts": 180
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T17:33:41",
    "text": "Michael Gonzales, the ambassador to Zambia, announced at an emotional press conference that the U.S. would cut $50 million in aid due to theft of medications.",
    "likes": 6172,
    "reposts": 1866
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T16:45:03",
    "text": "President Trump fired Carla Hayden, the Librarian of Congress, via email late Thursday night, the latest in a string of actions the president has taken to shape American cultural institutions.",
    "likes": 794,
    "reposts": 240
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T16:05:11",
    "text": "A federal judge in San Francisco appeared ready to temporarily block the Trump administration's sweeping overhaul of the federal government.",
    "likes": 1361,
    "reposts": 198
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T16:00:51",
    "text": "The Department of Agriculture is demanding sensitive data from states about more than 40 million food stamp recipients, as DOGE is amassing data for immigration enforcement.",
    "likes": 384,
    "reposts": 216
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T15:54:50",
    "text": "Trump's administration said they want tariffs to boost U.S. manufacturing, and most Americans want more factory jobs here. But what makes us nostalgic for factory work?",
    "likes": 228,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T15:36:55",
    "text": "Janinna Sesa worked alongside Pope Leo XIV in Chiclayo, Peru from 2015 until 2023. She spoke with NPR about his leadership in times of crisis.",
    "likes": 425,
    "reposts": 61
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T15:30:00",
    "text": "The Soviet spacecraft Kosmos-482 was launched in 1972 on a mission to Venus. But due to a rocket malfunction, it's been hurtling back towards Earth in an elliptical orbit for the past 53 years.",
    "likes": 679,
    "reposts": 193
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T15:25:16",
    "text": "For close watchers of the Catholic Church, the election of a U.S. pope seemed impossible. The \"Trump effect\" on the U.S. and global order changed that, papal expert Massimo Faggioli told NPR.",
    "likes": 310,
    "reposts": 49
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T14:39:41",
    "text": "The Democratic members of an independent agency dedicated to protecting Americans from dangerous products and issuing recalls and safety warnings were fired by President Trump via an overnight email.",
    "likes": 1380,
    "reposts": 649
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T14:35:54",
    "text": "The CDC updated the numbers of measles cases in the country on Friday.  Here's what they say and what it means for public health in the U.S.",
    "likes": 2166,
    "reposts": 909
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T14:18:33",
    "text": "Rümeysa Öztürk was ordered released by a federal judge in the latest setback for the Trump administration's effort to deport noncitizen activists it accuses of antisemitism.",
    "likes": 1992,
    "reposts": 399
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T14:11:15",
    "text": "It can be hard to pick a good karaoke song. You want it to be something you know well enough to pull off onstage, but also something you actually like. Here's how to narrow down your options.",
    "likes": 104,
    "reposts": 7
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T13:58:27",
    "text": "Vice President Vance said the fighting between India and Pakistan was \"fundamentally none of our business.\" Experts say the U.S. used to work hard to de-escalate crises between the nuclear states. \n\nBy @diaahadid.bsky.social and Omkar Khandekar",
    "likes": 386,
    "reposts": 80
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T13:48:23",
    "text": "The head of the Federal Emergency Management Agency, Cameron Hamilton, has been replaced. The shake up comes weeks before the start of the Atlantic hurricane season.\nBy @lsommer.bsky.social and @rhersher.bsky.social",
    "likes": 1797,
    "reposts": 599
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T13:35:16",
    "text": "Dion Nissenbaum, one of the executive producers of the revealing new documentary \"Who Killed Shireen?\" speaks to Morning Edition about an investigation into the killing of journalist Shireen Abu Akleh.",
    "likes": 226,
    "reposts": 38
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T13:23:28",
    "text": "Pope Leo is seen as a centrist who shares his predecessor's progressive views on certain social issues. Here's what we know so far.",
    "likes": 530,
    "reposts": 67
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T13:18:07",
    "text": "Katherine Wells, the public health director in Lubbock, Texas, describes her fight to stop the largest measles outbreak since 2000, despite a chaotic reorganization of federal health agencies.",
    "likes": 335,
    "reposts": 100
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T13:07:54",
    "text": "Paleontologist Ken Lacovara never expected to find critical fossil data in a New Jersey suburb—let alone info about the asteroid that killed the dinosaurs. His dig site is now a fossil park and museum.",
    "likes": 1305,
    "reposts": 270
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:51:56",
    "text": "JUST IN: NPR has learned that rules must now be vetted by the White House and that the administration is drafting an executive order that could loosen radiation limits. \nBy @gbrumfiel.bsky.social",
    "likes": 497,
    "reposts": 251
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:39:28",
    "text": "After decades of philanthropy following the success of Microsoft, Bill Gates is winding down his namesake charity. What's he going to do next?",
    "likes": 327,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:31:44",
    "text": "During his homily, delivered in Italian, Leo XIV said that Christians must serve a world that is often hostile to their beliefs.\nBy @burke13.bsky.social",
    "likes": 415,
    "reposts": 54
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:31:32",
    "text": "Pope Leo XIV is the first Augustinian friar ever to be selected to lead the Catholic Church. The Villanova graduate was raised in Chicago, where he was known as Robert Prevost.",
    "likes": 235,
    "reposts": 28
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:20:34",
    "text": "Casey Means, President Trump's new pick for U.S. surgeon general faces questions about her medical qualifications. And despite RFK Jr's support, some in the MAHA movement are lobbying against her.",
    "likes": 386,
    "reposts": 75
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:17:03",
    "text": "3. Full disclosure: USPS is a financial supporter of NPR.",
    "likes": 101,
    "reposts": 11
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T10:47:10",
    "text": "2. Here’s my article on incoming USPS Postmaster General David Steiner:\nwww.npr.org/2025/05/09/n...",
    "likes": 87,
    "reposts": 40
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T10:37:03",
    "text": "BREAKING: The next postmaster general to lead the U.S. Postal Service is David Steiner, a board member of USPS competitor FedEx and former Waste Management CEO, the chair USPS Board of Governors, Amber McReynolds, said. Steiner is set to start in July",
    "likes": 187,
    "reposts": 86
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:13:43",
    "text": "GOP lawmakers in swing districts insist they will not vote for any proposal that strips benefits, placing them at odds with more conservative lawmakers looking to secure deep cuts in spending.",
    "likes": 563,
    "reposts": 112
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:05:59",
    "text": "A federal court says Alabama can't use a congressional map it found unconstitutional. The ruling comes in a voting rights case that resulted in the state getting a second Black member of Congress.",
    "likes": 15832,
    "reposts": 3462
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T12:01:42",
    "text": "President Trump has repeatedly described the U.S.-Canada border as an \"artificially drawn line.\" But experts say just because it was man-made doesn't mean it's not legitimate.",
    "likes": 359,
    "reposts": 54
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:56:06",
    "text": "Trade negotiators from the U.S. and China are starting talks this weekend in Switzerland. These are the first high-level trade talks between the two countries since President Trump returned to the White House.",
    "likes": 119,
    "reposts": 15
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:50:21",
    "text": "Souter was appointed to the Supreme Court by President George H. W. Bush in 1990. He retired in 2009.",
    "likes": 243,
    "reposts": 29
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:39:50",
    "text": "Prosecutors say that as news of the crime spread, the two men exchanged messages relishing the outrage and sadness they caused. The tree in northern England was believed to be about 200 years old.",
    "likes": 1412,
    "reposts": 280
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:34:44",
    "text": "Thunderbolts* is unapologetically formulaic. And yet, Florence Pugh is terrific; the action is coherent; and the character dynamics strike the right balance of earnest sincerity and glib humor.",
    "likes": 374,
    "reposts": 22
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:28:36",
    "text": "Katie Gavin is the kind of performer whose dynamism knows no bounds. Whether she's performing with her pop band MUNA or solo, Gavin is a captivating presence.",
    "likes": 164,
    "reposts": 10
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:26:23",
    "text": "Craig Thompson, author of the award-winning graphic memoir Blankets, returns with its spiritual successor. It's a look at his childhood growing up on ginseng farms, and the intricate balance of the global ginseng trade.",
    "likes": 138,
    "reposts": 19
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:18:02",
    "text": "The 94-year-old investor is retiring as Berkshire Hathaway's CEO. He's built both a fortune and a reputation as \"the nicest billionaire\" — at a time when many other billionaires are widely criticized.",
    "likes": 255,
    "reposts": 37
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:10:39",
    "text": "NPR Music's @idislikestephen.bsky.social welcomes WXPN's John Morrison to discuss billy woods, Thom Yorke, PinkPantheress and more.",
    "likes": 63,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T11:09:42",
    "text": "Three months ago, President Trump signed an executive order telling white Afrikaans South Africans they could apply for refugee status in the U.S. The first group has been swiftly processed and is set to arrive on U.S. soil Monday.",
    "likes": 259,
    "reposts": 131
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T10:54:28",
    "text": "The U.S. Postal Service's governing board has named David Steiner, a board member of USPS competitor FedEx, to be the next postmaster general following the controversial term of Louis DeJoy.",
    "likes": 1185,
    "reposts": 554
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T09:59:53",
    "text": "During his first homily as pope, delivered in Italian, Leo said that Christians must serve a world that is often hostile to their beliefs.",
    "likes": 4802,
    "reposts": 737
  },
  {
    "username": "NPR",
    "created_at": "2025-05-09T09:59:10",
    "text": "Former Justice David Souter, who appointed to the Supreme Court by President George H. W. Bush in 1990, has died, the court announced.",
    "likes": 550,
    "reposts": 103
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T20:25:36",
    "text": "UPDATE: President Trump named Fox News personality Jeanine Pirro as the interim top prosecutor in Washington, D.C., to replace Ed Martin.",
    "likes": 447,
    "reposts": 108
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T19:12:44",
    "text": "Army veteran Harry Miller was stationed in Germany when the Nazis surrendered. Upon hearing the news, he recalls that American troops went to sleep or shook hands. \"And some just couldn't believe it.\"",
    "likes": 1066,
    "reposts": 174
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T18:32:47",
    "text": "The presidents of the National Education Association and American Federation of Teachers say the political climate has added to age-old money problems for teachers, such as underfunded schools.",
    "likes": 1356,
    "reposts": 385
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T18:01:58",
    "text": "Pope Leo XIV was born and raised in Chicago. He is of French, Italian and Spanish descent. He spent years working as a missionary in Peru.",
    "likes": 6405,
    "reposts": 956
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T17:58:05",
    "text": "The escalation began after India accused Pakistan of being behind an attack where gunmen killed 26 people, mostly tourists, in India-administered Kashmir on April 22. Pakistan denies it.",
    "likes": 168,
    "reposts": 39
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T17:17:15",
    "text": "The National Institutes of Health will partner with the Centers for Medicare and Medicaid to create a database of Americans with autism, using insurance claims, medical records and smartwatch data.",
    "likes": 7806,
    "reposts": 3694
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T17:09:59",
    "text": "Cardinal Robert Prevost made his first speech as Pope Leo XIV on the balcony of St. Peter's Basilica, shortly after being elected pontiff. This is a transcript of the speech, translated from its original Italian.",
    "likes": 1901,
    "reposts": 326
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T17:03:35",
    "text": "Hundreds of thousands of Velella velella, more commonly known as by-the-wind-sailors, are drifting onto the coastline. Beachcombers say they look like \"blue diamonds strewn across the beach.\"",
    "likes": 606,
    "reposts": 113
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T16:32:40",
    "text": "The Trump administration's actions toward some news outlets \"paint a really alarming picture of deteriorating media freedom in the U.S.,\" says Katherine Jacobsen of the Committee to Protect Journalists. By @obedmanuel.bsky.social and @michelmartinnpr.bsky.social",
    "likes": 863,
    "reposts": 246
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T16:28:58",
    "text": "The transportation secretary announced a far-reaching plan to drastically overhaul the current technology used by thousands of controllers responsible for guiding planes in and out of airports.",
    "likes": 153,
    "reposts": 39
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T16:04:38",
    "text": "When do compromises turn into full-blown capitulation? Daniel Kehlmann's new novel draws on the true story of German film director G.W. Pabst.",
    "likes": 243,
    "reposts": 42
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:48:45",
    "text": "When Amanda Hess learned her unborn child had a genetic condition, she turned to the internet — but didn't find reassurance. \"My relationship with technology became so much more intense,\" she says.",
    "likes": 89,
    "reposts": 7
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:46:29",
    "text": "really going to have an impact on their academic success,” she says. “There’s a lot of ripple effects that come from that.”\n\nMore stories to come from Skowhegan, Maine and Mill Stream Elementary very soon!",
    "likes": 46,
    "reposts": 5
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:46:29",
    "text": "so that has really helped for my home life and my school life.\" Mental health services are especially hard to come by in rural, low-income parts of the country. Chigali worries what will be lost without the funds. “Not being able to check in when [students]  are having an off day, it's just...",
    "likes": 49,
    "reposts": 3
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:46:29",
    "text": "out by 2027, but now $1 billion will be cut by December. This means Chigali and her colleagues will have to reduce how many students they can see, even though they already have long waitlists. 5th grader Ryleigh says, “Miss Jordan taught me how to talk through it instead of getting physical...",
    "likes": 41,
    "reposts": 4
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:46:29",
    "text": "to the Bipartisan Safer Communities Act, which sent federal money to schools for mental health services. For the last three years, it has paid for the salaries of three licensed counselors like Jordan Chigali,or Miss Jordan, as the students call her. The district had a plan for the money to run...",
    "likes": 40,
    "reposts": 6
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:46:29",
    "text": "Last week, our team was in rural Maine, talking to counselors and students at Mill Stream Elementary about the value of mental health services in schools. Then, last Wednesday night, as we were on the road home the Trump administration announced cuts...\nwww.npr.org/2025/05/07/n...",
    "likes": 98,
    "reposts": 22
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:39:28",
    "text": "13 states got the greenlight to add work requirements during the first Trump Administration, but courts halted those plans. Now that Trump is back in the White House, some states are trying again.",
    "likes": 220,
    "reposts": 59
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:17:04",
    "text": "President Trump will replace his controversial pick, Ed Martin, for the role of top prosecutor in Washington, D.C. following bipartisan Senate opposition.",
    "likes": 341,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T15:09:06",
    "text": "Patients seeking mental health care are more likely to be on Medicaid than patients in more profitable areas of care, such as cancer or cardiac treatment.",
    "likes": 572,
    "reposts": 182
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T14:53:32",
    "text": "The autopsy notes two bullet wounds even though there were three shooters, and a forensic expert says the misfires likely caused \"excruciating conscious pain and suffering.\"",
    "likes": 502,
    "reposts": 151
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T14:47:07",
    "text": "Casey Johnston spent years running and restricting calories. When she started weightlifting, she rebuilt muscle mass — and her relationship with her body.",
    "likes": 346,
    "reposts": 32
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T14:36:30",
    "text": "Wanda Sykes says getting back on the road helps remind her that she's still funny. On this week's Wild Card, Sykes talks about her conversations with God and why she loves bowling alleys.",
    "likes": 347,
    "reposts": 40
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T14:20:36",
    "text": "Thursday marks 80 years since Victory in Europe Day, when the Allies accepted Nazi Germany's unconditional surrender. The day will be marked with memorials and moments of silence across Europe.",
    "likes": 798,
    "reposts": 142
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T14:12:45",
    "text": "There's new tariffs on almost everything that is imported. Some of that increased cost is being eaten by exporters in other countries, but a lot of the higher prices are being picked up by Americans, who are seeing it in their receipts.\nBy @emilyzfeng.bsky.social",
    "likes": 475,
    "reposts": 126
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T14:07:52",
    "text": "Mother's Day is this weekend. If you haven't figured out what to give to the mothers in your life, we've got you covered.",
    "likes": 100,
    "reposts": 8
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T13:40:49",
    "text": " Efforts to mediate the India-Pakistan conflict are not going to work \"unless the U.S. steps in with full sincerity,\" Praveen Donthi, a senior analyst with the International Crisis Group, told NPR.",
    "likes": 277,
    "reposts": 51
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T13:19:22",
    "text": "JUST IN: The Catholic Church has elected Cardinal Robert Prevost as pope. The new pope will address the crowd soon. Watch here:",
    "likes": 861,
    "reposts": 137
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T13:09:37",
    "text": "The Centers for Disease Control and Prevention has laid off thousands of workers since January. Current and former CDC staff are grappling with uncertainty about both their futures and public health.",
    "likes": 3609,
    "reposts": 1384
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T13:00:06",
    "text": "President Trump has proposed slashing federal scientific funding. Economists say the long-term consequences could be dire.\nBy @gbrumfiel.bsky.social",
    "likes": 546,
    "reposts": 193
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T12:57:02",
    "text": "Soaps, lotions and shampoos were found to have formaldehyde and formaldehyde-releasing preservatives.",
    "likes": 698,
    "reposts": 283
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T12:55:05",
    "text": "Most Americans balk at the idea of charging women who get abortions with homicide, but post-Roe, militant anti-abortion activists are finding state lawmakers are increasingly open to it.\nBy @oyousef.bsky.social",
    "likes": 1397,
    "reposts": 568
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T12:16:00",
    "text": "BREAKING NEWS: White smoke streams from a chimney atop the Sistine Chapel, signaling to the world that a new pope has been selected.",
    "likes": 5408,
    "reposts": 821
  },
  {
    "username": "NPR",
    "created_at": "2025-05-08T10:39:01",
    "text": "Have you or someone you know used a flat-fee real estate agent to buy or sell a home?\n\nIf so, I'd love to hear how it went! For a story for NPR.\n\nDrop me a line at lwamsley@npr.org. Thanks!",
    "likes": 103,
    "reposts": 32
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T15:34:56",
    "text": "BREAKING NEWS: A jury finds three former Memphis police officers not guilty of all charges in the death of Tyre Nichols, including the most serious charge of second degree murder.",
    "likes": 602,
    "reposts": 241
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T15:06:19",
    "text": "JUST IN: Black smoke streamed from the chimney of the Sistine Chapel, signaling that the more than 130 cardinal electors have not come to a two-thirds agreement about who the next pope should be.",
    "likes": 2336,
    "reposts": 276
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T15:06:05",
    "text": "Black smoke streams from the chimney of the Sistine Chapel, signaling that the 133 cardinal electors have not come to a two-thirds agreement about who the next pope should be.",
    "likes": 288,
    "reposts": 30
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T14:34:27",
    "text": "Pakistan says India's strikes on Wednesday is \"an act of war.\" India's military described its operation as targeting \"terrorist infrastructure.\"",
    "likes": 419,
    "reposts": 93
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T14:16:14",
    "text": "The Federal Reserve held interest rates steady Wednesday as President Trump's tariffs threaten to raise prices and drag down economic growth.",
    "likes": 501,
    "reposts": 87
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T13:19:39",
    "text": "A U.S. official has confirmed to NPR that the Trump administration is planning to deport migrants to Libya, another step in a crackdown on illegal immigration.",
    "likes": 593,
    "reposts": 281
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T12:30:37",
    "text": "Rümeysa Öztürk has been detained at a federal facility in Louisiana after being arrested on the street in Sommerville, Massachusetts on March 25 by six plainclothes agents of Immigration and Customs Enforcement.",
    "likes": 3675,
    "reposts": 940
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T10:40:11",
    "text": "As more than a billion Catholics around the world await the election of a new pope, all eyes are on the Sistine Chapel, where 133 cardinals are beginning the secretive process known as a conclave.",
    "likes": 1429,
    "reposts": 222
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T10:19:47",
    "text": "President Trump has issued an executive order seeking to block all federal funding to NPR. This is the latest in a series of threats to media organizations across the country.\n\nWhatever changes this action brings, NPR’s commitment to reporting the news – without fear or favor – will never change.",
    "likes": 4026,
    "reposts": 1177
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T07:08:02",
    "text": "Pope Francis worked to make the Catholic Church more open to the LGBTQ community. NPR's Scott Detrow speaks with the Rev. James Martin about what direction the new pontiff could take the church.",
    "likes": 3808,
    "reposts": 667
  },
  {
    "username": "NPR",
    "created_at": "2025-05-07T06:31:06",
    "text": "Senior presidential adviser Kari Lake says Voice of America will rely on coverage from the far-right OAN network. OAN has offered unwavering support of President Trump.",
    "likes": 883,
    "reposts": 425
  },
  {
    "username": "NPR",
    "created_at": "2025-05-06T17:28:11",
    "text": "India has launched strikes in several parts of Pakistan and Pakistan-controlled territory, in a dramatic escalation of tensions between the two nuclear-armed rivals.",
    "likes": 4112,
    "reposts": 1510
  },
  {
    "username": "NPR",
    "created_at": "2025-05-06T09:39:38",
    "text": "Only about 25,000 teachers — out of nearly 400,000 in Texas — currently receive  raises under the merit-based Teacher Incentive Allotment program. \n\nThe program also excludes essential school support staff who contribute to children’s instruction and learning.",
    "likes": 316,
    "reposts": 94
  },
  {
    "username": "NPR",
    "created_at": "2025-05-06T10:07:33",
    "text": "The U.S. Justice Department is appealing decisions made by two federal judges in Vermont. It also wants to consolidate the students' cases, saying they present similar legal questions.",
    "likes": 244,
    "reposts": 72
  },
  {
    "username": "NPR",
    "created_at": "2025-05-06T10:08:18",
    "text": "The suspension of the Truth and Reconciliation Commission raises questions about future efforts to investigate the country's foreign adoption program.",
    "likes": 736,
    "reposts": 196
  },
  {
    "username": "NPR",
    "created_at": "2025-05-06T06:46:09",
    "text": "Most Americans frequently use federal science information. But few are concerned that cuts to federal science spending could affect their access to such information, a new poll finds.",
    "likes": 12065,
    "reposts": 3713
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T20:00:07",
    "text": "President Trump issued an executive order Monday banning federal funding for any research abroad that involves a field of scientific study known as \"gain-of-function\" research. Here's what it means.",
    "likes": 671,
    "reposts": 263
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T19:47:51",
    "text": "Monday is the Met Gala, known as fashion's grandest event, where celebrities from various realms come together at New York's Metropolitan Museum of Art to celebrate fashion and each other.",
    "likes": 478,
    "reposts": 104
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T19:27:34",
    "text": "a Department spokesperson said that Harvard has “spent years ignoring completely, a total coordinated effort to drive Jewish life underground.” Harvard didn't immediately respond to NPR's request for comment.",
    "likes": 204,
    "reposts": 89
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T19:27:34",
    "text": "The Trump admin is pulling future research funding for Harvard in its ongoing battle with the university over what the administration alleges is unchecked antisemitism on Harvard's campus. In a call with reporters before the letter was released, \nx.com/EDSecMcMahon...",
    "likes": 288,
    "reposts": 120
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T18:49:37",
    "text": "Production in Hollywood has been suffering. But it's unclear how a 100% tariff on movies produced outside the United States would work – or who it would help.\nBy @radioactive22.bsky.social",
    "likes": 648,
    "reposts": 193
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T17:41:39",
    "text": "Square root days happen only a few times in a century, and the man who brought the day fame is celebrating his sixth one.",
    "likes": 575,
    "reposts": 138
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T17:11:00",
    "text": "BREAKING NEWS: In a rare rebuke, more than a dozen former workers of the powerful data-mining and surveillance company say the firm's work with the Trump administration violates the company's founding principles. \nExclusive from @bobbyallyn.bsky.social",
    "likes": 3498,
    "reposts": 1105
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T17:02:21",
    "text": "The 2025 Pulitzer Prizes were announced Monday afternoon. Percival Everett won the award for fiction for his novel James, a powerful re-imagination of Huckleberry Finn.",
    "likes": 4974,
    "reposts": 851
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T16:56:36",
    "text": "The annual Eta Aquarid meteor shower is set to peak early on May 6 and will be viewable in the dark predawn skies.",
    "likes": 244,
    "reposts": 49
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T16:33:07",
    "text": "After weeks of confusion, the Trump administration confirmed that it terminated visa records for thousands of international students because of past brushes with law enforcement, many of them minor.",
    "likes": 431,
    "reposts": 127
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T16:14:18",
    "text": "You and millions of other people rely on the NPR Network for trustworthy journalism. \n\nNPR’s editorial integrity and independence are non-negotiable. It’s a promise we make to you – a promise we will fight to keep. Now, we need your support. \n\nDonate today: n.pr/3EYClNR",
    "likes": 19632,
    "reposts": 6120
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T16:03:32",
    "text": "Microsoft has announced that the pioneering online video calling service that's been around for more than two decades will go offline on Monday.",
    "likes": 458,
    "reposts": 86
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T15:41:28",
    "text": "NPR TV critic @edeggans.bsky.social picks his favorite performances of 2025 thus far, including Noah Wyle in The Pitt, Catherine O'Hara in The Last of Us and The Studio, and Carrie Coon in The White Lotus.",
    "likes": 249,
    "reposts": 17
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T15:29:58",
    "text": "Snook, who played Shiv Roy on Succession, was just nominated for a Tony for playing all the characters in The Picture of Dorian Gray on Broadway. \"I don't know what comes after this,\" she says.",
    "likes": 377,
    "reposts": 27
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T14:54:46",
    "text": "Nearly 1,000 women from around the country flew to New York City to audition for the dance troupe on its 100th anniversary. What's helped it last so long?\nBy @jennifervanasco.bsky.social",
    "likes": 328,
    "reposts": 38
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T14:42:02",
    "text": "It may not be a household name, but Palantir is now one of the world's most valuable companies. Its \"spy tech\" is set to gain more government and military work in the Trump administration.",
    "likes": 293,
    "reposts": 118
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T14:37:35",
    "text": "A study from the American Journal of Psychiatry suggests that psychotherapy is becoming more accessible to people. The study looks at trends in mental health treatment from 2018 to 2021.",
    "likes": 320,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T14:28:37",
    "text": "The Broadway revival of the beloved musical leans into its minimalist approach, featuring special arrangements just for the Tiny Desk performed by Nicole Scherzinger and Tom Francis.",
    "likes": 128,
    "reposts": 14
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T14:15:48",
    "text": "For decades the NIH has led a public health campaign credited with saving thousands of babies from dying in their sleep. The administration's cuts come as sleep-related infant deaths have been rising.",
    "likes": 1163,
    "reposts": 464
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T14:01:02",
    "text": "The 24 Hours of Lemons is an endurance race with a twist: The cars cost less than $500,  and costumes are unlimited. A recent race saw a Toyota Yaris painted like a snail, and a team dressed as bees.",
    "likes": 859,
    "reposts": 115
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T13:53:34",
    "text": "Marco Rubio serving as both Secretary of State and national security adviser could be \"ultimately disadvantageous\" to President Trump, says former adviser John Bolton.",
    "likes": 311,
    "reposts": 45
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T13:45:34",
    "text": "Expect to see a focus on menswear: jackets, trousers, suits, hats, and maybe a cane or two.",
    "likes": 155,
    "reposts": 17
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T13:31:07",
    "text": "Kosmos 482 has been orbiting the Earth for decades. It's still unknown if the craft will fall to Earth intact or burn up upon atmospheric reentry.",
    "likes": 283,
    "reposts": 46
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T13:18:01",
    "text": "In Chad, they're a key force in addressing the country's high rate of maternal mortality. But U.S. aid cuts have affected their salaries.",
    "likes": 255,
    "reposts": 70
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T13:12:42",
    "text": "Ryan Coogler's period thriller knows \"the devil's music\" isn't the opposite of the holy word, but its twin.",
    "likes": 554,
    "reposts": 62
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T13:02:34",
    "text": "Emmitsburg is home to the National Fire Academy, effectively the war college for U.S. firefighters. The Trump administration's decision to halt classes has some townspeople pondering their votes.",
    "likes": 697,
    "reposts": 191
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T12:59:09",
    "text": "The trial for the rap mogul, who faces criminal charges for sex trafficking, racketeering conspiracy and transporting to engage in prostitution, is underway. Opening statements are slated for May 12.",
    "likes": 253,
    "reposts": 40
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T12:42:44",
    "text": "Claims that possible signs of life were found on a planet called K2-18b made a big splash. But recently, other researchers and a new analysis have cast doubt on the findings.",
    "likes": 208,
    "reposts": 43
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T12:38:42",
    "text": "The Education Department says millions of borrowers in default will have a chance to make a payment or sign up for a repayment plan. But on May 5, those who don't will be referred for collection.",
    "likes": 166,
    "reposts": 69
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T11:48:52",
    "text": "The prison on a forbidding island off San Francisco was operated at a prohibitive cost. Now, President Trump says it's time to substantially enlarge and rebuild Alcatraz as a federal penitentiary.",
    "likes": 457,
    "reposts": 115
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T09:13:37",
    "text": "New York City has joined a coalition of eight local governments around the country suing the Trump Administration over what the cities say are unlawful strings attached to federal housing dollars.",
    "likes": 423,
    "reposts": 80
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T09:53:38",
    "text": "The United Nations and major groups currently running aid operations in Gaza, briefed by Israel on the plans, said they would not cooperate with the plans.",
    "likes": 649,
    "reposts": 242
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T07:05:30",
    "text": "COMMENTARY: Like Project 2025, \"Project Esther\" is also a creation of the Heritage Foundation. “It's an exercise in cynicism by an administration eager to prey on people’s worst fears,” writes Anita Diamant.",
    "likes": 226,
    "reposts": 96
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T07:34:34",
    "text": "Harvard researcher Ari Ne'eman says the policy shifts underway under the Trump administration pose a unique threat to people with disabilities, but that they've fought for rights before and won.",
    "likes": 957,
    "reposts": 258
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T00:15:55",
    "text": "50 years after the #VietnamWar ended, its impact still lingers. Last week, we published a series of reports gathered from #Vietnam, #Laos, and the U.S., exploring how the war continues to shape lives.\n\nExplore the full series: www.npr.org/series/g-s1-...",
    "likes": 125,
    "reposts": 16
  },
  {
    "username": "NPR",
    "created_at": "2025-05-05T06:18:34",
    "text": "The Faces of Gun Violence exhibit at the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) headquarters showed the portraits of 120 people killed in gun violence in the U.S.",
    "likes": 9610,
    "reposts": 3707
  },
  {
    "username": "NPR",
    "created_at": "2025-05-04T16:40:25",
    "text": "UPDATE: Police say they arrested two people involved. The target was a free Lady Gaga concert in Rio de Janeiro, which drew more than 2 million people to Copacabana Beach on Saturday night.",
    "likes": 7015,
    "reposts": 1175
  },
  {
    "username": "NPR",
    "created_at": "2025-05-04T11:47:21",
    "text": "When asked about the image, Cardinal Timothy Dolan, the archbishop of New York who is friendly with Trump, said \"it wasn't good\" and that he hoped Trump had nothing to do with it.",
    "likes": 1379,
    "reposts": 228
  },
  {
    "username": "NPR",
    "created_at": "2025-05-04T11:24:49",
    "text": "The president says a third term is \"not something I'm looking to do,\" and the U.S. economy is in a \"transition period.\"",
    "likes": 719,
    "reposts": 158
  },
  {
    "username": "NPR",
    "created_at": "2025-05-04T11:07:51",
    "text": "An 18-year-old from Russian-occupied Luhansk tells NPR how and why he escaped to Kyiv.",
    "likes": 654,
    "reposts": 100
  },
  {
    "username": "NPR",
    "created_at": "2025-05-04T11:00:59",
    "text": "Hours after the Trump administration proposed eliminating the National Endowment for the Arts from next year's federal budget, hundreds of arts groups in the U.S. were told their grants were canceled.",
    "likes": 745,
    "reposts": 329
  },
  {
    "username": "NPR",
    "created_at": "2025-05-04T10:37:18",
    "text": "Ahead of the election of the next pope, a chimney was installed atop the Sistine Chapel on Friday, which will help notify the public of the 267th pope.",
    "likes": 1804,
    "reposts": 237
  },
  {
    "username": "NPR",
    "created_at": "2025-05-04T10:29:28",
    "text": "The victory hands Venezuelan jockey Junior Alvarado his first career win in the Kentucky Derby. Sovereignty's trainer, Bill Mott, has won the Kentucky Derby once before.",
    "likes": 3286,
    "reposts": 445
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T18:49:02",
    "text": "A few days ago, President Trump issued an executive order seeking to block all federal funding to NPR, the latest in a series of threats to media organizations across the country.",
    "likes": 5315,
    "reposts": 1697
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T17:50:12",
    "text": "Florida lawmakers have sent the governor a bill that would provide financial relief to condo owners. The measure softens mandates passed after the deadly 2021 collapse of a condo tower in Surfside.",
    "likes": 468,
    "reposts": 98
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T16:40:41",
    "text": "Buzzi, who was best known for her regular appearances on the NBC variety TV show Rowan & Martin's Laugh-In, died on Thursday at her home in Texas.",
    "likes": 3962,
    "reposts": 549
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T15:33:43",
    "text": "The Daniel K. Inouye telescope snapped a clear image of sunspots.",
    "likes": 2388,
    "reposts": 345
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T14:59:01",
    "text": "A very eventful day in Omaha, for @npr.org: www.npr.org/2025/05/03/n...",
    "likes": 297,
    "reposts": 37
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T14:44:08",
    "text": "JUST IN: The billionaire investor, now 94, also said he would be resigning as CEO at the end of the year. He spoke at Berkshire Hathaway's annual shareholder meeting known as \"Woodstock for Capitalists.\"",
    "likes": 805,
    "reposts": 134
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T13:27:25",
    "text": "Transportation Secretary Sean Duffy says he will ask Defense Department officials why an Army Black Hawk helicopter violated flight restrictions at Ronald Reagan Washington National Airport.",
    "likes": 8610,
    "reposts": 2223
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T11:29:11",
    "text": "Latinos, many from outside the U.S. mainland, have risen in prominence in horseracing, from the grooms to some of the winningest jockeys.\nBy @ximenabustillo.bsky.social",
    "likes": 641,
    "reposts": 97
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T11:02:27",
    "text": "The cartoonish-looking salamanders have faced an uncertain future in the wild. But researchers hope that breeding axolotls in captivity and releasing them in the wild can help their numbers.",
    "likes": 1614,
    "reposts": 188
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T11:01:01",
    "text": "It may not be a household name, but Palantir is now one of the world's most valuable companies. Its \"spy tech\" is set to gain more government and military work in the Trump administration.\nBy @bobbyallyn.bsky.social",
    "likes": 618,
    "reposts": 316
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T10:47:13",
    "text": "USDA's Animal and Plant Health Inspection Service has opened up 73 jobs to internal candidates. They include roles just vacated by people who are receiving full pay and benefits through September.",
    "likes": 5028,
    "reposts": 1807
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T10:33:20",
    "text": "The ruling from U.S. District Judge Beryl Howell is the first to permanently block an executive order issued by President Trump punishing a law firm for representing clients or causes he dislikes.",
    "likes": 2522,
    "reposts": 502
  },
  {
    "username": "NPR",
    "created_at": "2025-05-03T10:20:31",
    "text": "EPA announced plans to reorganize the agency, moving science-focused staff into different roles and reducing the overall number of employees.",
    "likes": 348,
    "reposts": 163
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T18:09:48",
    "text": "Radio Free Asia is laying off about 90 percent of its staff meaning it is effectively shutting down. It says it can no longer pay people after its funding was cut off by the Trump administration.\n\nBy @emilyzfeng.bsky.social",
    "likes": 744,
    "reposts": 294
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T17:39:37",
    "text": "On the last Friday of the month, a group of volunteers serves up tasty treats to morning bike commuters and passersby. The event has been going on for over 20 years.",
    "likes": 637,
    "reposts": 76
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T17:19:30",
    "text": "The Netflix series is Tina Fey's touching tribute and knowing update to a 1981 Alan Alda movie — a smart, nuanced take on marriage, friendships and the way changing circumstances can affect them both.\nFrom @edeggans.bsky.social",
    "likes": 653,
    "reposts": 35
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T17:11:05",
    "text": "Sister Inah Canabarro Lucas, a soccer-loving nun born in 1908, is remembered as compassionate and dedicated to her faith.",
    "likes": 927,
    "reposts": 104
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T16:58:48",
    "text": "Beyoncé's Cowboy Carter tour has officially kicked off. Some fans are going all out to capture the tour's Western fashion aesthetic.",
    "likes": 305,
    "reposts": 39
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T16:50:59",
    "text": "Scientists have created a broadly effective antivenom using the blood of a Wisconsin man who has spent years exposing himself to deadly snakebites from black mambas, taipans, cobras and many others.",
    "likes": 7115,
    "reposts": 1505
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T16:38:24",
    "text": "The acting U.S. attorney in Washington, D.C., has sent letters to several leading medical journals asking for information about their editorial practices.",
    "likes": 3692,
    "reposts": 1688
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T15:49:06",
    "text": "Erin Patterson hosted several of her estranged husband's relatives for lunch in July 2023. Within days, three of them were dead of mushroom poisoning. She denies deliberately poisoning them.",
    "likes": 233,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T15:31:37",
    "text": "The proposal would cut off rental subsidies after two years for able-bodied adults. Advocates warn if enacted, the White House plan would tip many low-income renters over the edge into homelessness.",
    "likes": 482,
    "reposts": 211
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T14:54:02",
    "text": "The National Science Foundation, a major government funder of basic science research, is being shaken up with over 1,000 grants already terminated and the White House looking to halve its budget.",
    "likes": 3271,
    "reposts": 1381
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T14:35:14",
    "text": "Medicaid cuts loom over House Republicans' budget reconciliation. Rep. Jeff Hurd, R-Colo. says the \"right reforms,\" like work requirements and stopping \"improper\" spending, could save money.",
    "likes": 258,
    "reposts": 48
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T14:30:42",
    "text": "The VA has abruptly ended the only low-interest, affordable loan modification option for thousands of vets who are behind on their mortgages. \n\nIf you're a vet at risk of foreclosure, we want to hear your story.",
    "likes": 19475,
    "reposts": 8955
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T14:16:11",
    "text": "Hats, horses and high rollers. These are just some of the things that add to the atmosphere of Churchill Downs on Derby Day.",
    "likes": 164,
    "reposts": 19
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T14:05:09",
    "text": "Proposals to bar Members of Congress from trading stocks have stalled for years. But President Trump's public support of the idea, along with the endorsement of a top Democrat could change the dynamic.",
    "likes": 569,
    "reposts": 75
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T13:46:58",
    "text": "After backing Joe Biden in 2020, Asian American voters in Nevada swung decisively toward Donald Trump in 2024. Now, they reflect on how his presidency is going so far.\nBy @sarahmccammon.bsky.social",
    "likes": 185,
    "reposts": 36
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T13:36:20",
    "text": "From @emilyzfeng.bsky.social \n\nShein and Temu goods might not be so cheap anymore. Starting today, the U.S. will start collecting import fees on small packages from China, much of which comes from Chinese e-commerce sites.",
    "likes": 581,
    "reposts": 177
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T13:35:12",
    "text": "President Trump's tariffs are having serious consequences on small businesses across the United States. The Catoctin Creek Distilling Co.'s co-owners talk about their experiences dealing with tariffs.",
    "likes": 341,
    "reposts": 117
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T13:23:17",
    "text": "Driver's licenses and IDs that are not Real ID-compliant will no longer get you through U.S. airport security once the law takes effect, but full enforcement may not start right away.",
    "likes": 1085,
    "reposts": 424
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T13:13:23",
    "text": "With nearly 40 years of legal practice, lawyer Abbe Lowell has represented many powerful people. Now he's starting a new law firm to represent those who have drawn the ire of President Trump.\nBy @carriejohnson.bsky.social",
    "likes": 5158,
    "reposts": 1206
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T13:05:41",
    "text": "The Trump administration has decimated an agency responsible for carrying out much of the research and prevention efforts to curb exposure to dangerous substances and situations in the workplace.",
    "likes": 572,
    "reposts": 241
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T12:55:48",
    "text": "These proposed cuts are to programs that Congress authorizes each year — not to spending on safety nets like Medicare, Medicaid and Social Security. More details are expected on Friday.",
    "likes": 238,
    "reposts": 83
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T12:39:23",
    "text": "Trump's comments on social media marked the latest volley in a battle between the administration and the wealthiest college in the world.",
    "likes": 405,
    "reposts": 64
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T12:35:13",
    "text": "It is not clear that the president has the authority to make such orders to CPB under the law.\n\nFrom @davidfolkenflik.bsky.social",
    "likes": 988,
    "reposts": 253
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T09:08:58",
    "text": "Rural communities are scrambling after the Trump administration canceled billions in disaster grants. Many were counting on the funds for infrastructure fixes meant to withstand future disasters.",
    "likes": 1212,
    "reposts": 420
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T08:33:29",
    "text": "May 7 is this coming Wednesday. But the head of the RMV says there's only a select group of people who \"really need a REAL ID credential right away.\"",
    "likes": 64,
    "reposts": 20
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T16:12:49",
    "text": "Harvard University shared information about its international students with the Department of Homeland Security.  \n\nwww.wgbh.org/news/local/2... @gbhnews.bsky.social",
    "likes": 193,
    "reposts": 80
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T08:44:13",
    "text": "What made this Broadway season special to me -- its the best one in my memory - is not allll the celebrities, but how well done so many shows were. Strong music, incisive scripts, smart and innovative direction, majestic performances. www.npr.org/2025/05/01/n...",
    "likes": 61,
    "reposts": 5
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T08:49:13",
    "text": "JUST IN: U.S. employers added 177,000 jobs in April — a modest slowdown from the previous month, while the unemployment rate held steady at 4.2%.",
    "likes": 299,
    "reposts": 55
  },
  {
    "username": "NPR",
    "created_at": "2025-05-02T06:26:45",
    "text": "In an executive order, President Trump directs the Corporation for Public Broadcasting to stop funding NPR and PBS, the nation's primary public broadcasters.",
    "likes": 1379,
    "reposts": 702
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T20:40:27",
    "text": "The judges of the annual prize for female and nonbinary writers praised Lubrin's debut short story collection, Code Noir, for breaking \"new ground in short fiction.\"",
    "likes": 1634,
    "reposts": 235
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T19:18:03",
    "text": "You count on the NPR Network. Today, supporters like you are donating and sharing what #PublicMediaGives to their communities that no other news service can. \n\nYour support connects small towns, big cities and the millions who call them home. Every dollar makes a difference. Donate now: n.pr/4lFTPPD",
    "likes": 1310,
    "reposts": 334
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T19:03:37",
    "text": "President Trump called for the report in an executive order, titled \"Protecting Children From Chemical and Surgical Mutilation.\"",
    "likes": 287,
    "reposts": 61
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T17:07:03",
    "text": "Columbia University student Mohsen Mahdawi left federal prison, but his case isn't over. His lawyer says the Trump administration's case against him is \"laughable\" and \"unconstitutional.\"",
    "likes": 952,
    "reposts": 146
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T16:31:36",
    "text": "The Department of Health and Human Services says it will require new vaccines to be tested against a placebo, which could complicate and delay Food and Drug Administration approval of many vaccines.",
    "likes": 659,
    "reposts": 214
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T16:26:22",
    "text": "Marvel's latest release is a decently effective blend of misfit mercenaries and pop psychology.",
    "likes": 333,
    "reposts": 29
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T15:39:24",
    "text": "Have you recently bought something online, and your receipt showed how much more you're paying as a result of tariffs? If so, we'd love to see the receipts.",
    "likes": 2658,
    "reposts": 758
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T15:31:21",
    "text": "The Trump administration, U.S. District Judge Fernando Rodriguez, Jr., ruled, does not \"possess the lawful authority under the (Alien Enemies Act), and based on the Proclamation, to detain Venezuelan aliens, transfer them within the United States, or remove them from the country.\"",
    "likes": 2207,
    "reposts": 499
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T15:15:11",
    "text": "Congress created the grants in the aftermath of the school shooting in Uvalde, Texas. The goal was to help schools hire mental health professionals, including counselors and social workers.",
    "likes": 5791,
    "reposts": 2766
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T15:00:15",
    "text": "ICE says it is investigating the cause of death of 44-year-old Marie Ange Blaise in a Florida detention center on Friday. A local congresswoman says Blaise had complained of chest pains \"for hours.\"",
    "likes": 13902,
    "reposts": 5464
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T14:48:29",
    "text": "Trump said he would make Secretary of State Marco Rubio his interim national security adviser.",
    "likes": 353,
    "reposts": 77
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T14:28:37",
    "text": "JUST IN: Ed Martin, President Trump's pick for U.S. Attorney for D.C., is distancing himself from a Jan. 6 rioter known for antisemitic views. NPR's reporting raises questions about his ties to the rioter. \n\nFrom @tomdreisbach.bsky.social",
    "likes": 654,
    "reposts": 195
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T14:27:08",
    "text": "A new bill from a top Democrat seeks to close a loophole that federal judges have used to collect pension benefits despite facing credible accusations of wrongdoing by employees.\nBy @carriejohnson.bsky.social",
    "likes": 472,
    "reposts": 77
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T14:22:08",
    "text": "\"Weird Al\" Yankovic has no trouble tapping into his dorkiness. Perhaps that's the secret to his decades-spanning appeal. On this week's Wild Card with Rachel Martin, he talks about aging into his weirdness.",
    "likes": 441,
    "reposts": 63
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T14:09:47",
    "text": "With stock market volatility and fears of price increases driven by the new tariffs, you may be worried about your finances. A certified financial planner explains how to navigate these tricky times.",
    "likes": 175,
    "reposts": 40
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:59:36",
    "text": "Two majority Black cities in Alabama now have Black representation in Congress because of court-ordered redistricting. The progress comes as President Trump pulls back federal diversity initiatives.",
    "likes": 770,
    "reposts": 120
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:47:50",
    "text": "The Tennessee Legislature aimed to challenge a 1982 ruling by the U.S. Supreme Court that established a right to education for all students. Republican lawmakers still hope to overturn that.",
    "likes": 257,
    "reposts": 92
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:41:14",
    "text": "From the ashes of World War II, President Harry Truman helped create global institutions that have defined international order. President Trump is moving aggressively to scale back that U.S. role.",
    "likes": 457,
    "reposts": 137
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:32:53",
    "text": "President Trump is easing some of his tariffs on the U.S. auto industry. But what will the overall impact of these economic policies mean for the nation's biggest carmakers? Ford Motor CEO weighs in.",
    "likes": 129,
    "reposts": 28
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:24:37",
    "text": "From San Juan to the Tiny Desk, it's hard to catch a moment where the Puerto Rican rapper, doctor and author doesn't smile, laugh or perreo hasta abajo.",
    "likes": 151,
    "reposts": 9
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:16:16",
    "text": "The VA Servicing Purchase program has helped about 20,000 veterans avoid foreclosure. But Republicans in Congress have been critical of the program, saying it puts too much taxpayer money at risk.",
    "likes": 651,
    "reposts": 292
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:07:55",
    "text": "Politicians, lawyers and journalists who left behind autocratic systems in Europe, Asia and Latin America see the Trump administration employing similar methods.",
    "likes": 1144,
    "reposts": 342
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T13:01:56",
    "text": "Nominees for the 78th Annual Tony Awards were announced Thursday morning. They include George Clooney, Nicole Scherzinger, Sarah Snook, Sadie Sink, Audra McDonald and more.",
    "likes": 221,
    "reposts": 26
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T12:52:47",
    "text": "Kamala Harris had centered her closing argument of her unsuccessful presidential campaign on the dangers posed by Trump. These were her first major remarks since he took office.",
    "likes": 1161,
    "reposts": 230
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T12:49:16",
    "text": "May Day is not officially acknowledged in the U.S. because of what historians say is an ongoing resistance to unity among the working class. This resistance is prompting protesters to take action on Thursday, regardless.",
    "likes": 13466,
    "reposts": 3365
  },
  {
    "username": "NPR",
    "created_at": "2025-05-01T10:15:21",
    "text": "Public Media Giving Days are here! ❤️🖤💙\n\nThe NPR Network makes trustworthy journalism, music, and unforgettable stories available to nearly 99% of the U.S. population–free of charge. \n\nIt's time to show your love for how much #PublicMediaGives your community.\n\nDonate here: n.pr/4lFTPPD",
    "likes": 1536,
    "reposts": 443
  }
]