[
  {
    "username": "Vox",
    "created_at": "2025-05-30T14:00:42",
    "text": "The autism commission is doomed to fail. voxdotcom.visitlink.me/7E_tCc",
    "likes": 25,
    "reposts": 6
  },
  {
    "username": "Vox",
    "created_at": "2025-05-30T13:59:57",
    "text": "Trump may kick half a million immigrants, from nations with unstable or authoritarian regimes, out of the US. voxdotcom.visitlink.me/N_8FMT",
    "likes": 16,
    "reposts": 5
  },
  {
    "username": "Vox",
    "created_at": "2025-05-30T13:59:17",
    "text": "An exhausting — if not exhaustive — timeline of J.K. Rowling’s transphobia. voxdotcom.visitlink.me/jv6gav",
    "likes": 30,
    "reposts": 4
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T14:27:47",
    "text": "hey, Vox has a 30% off sale today, and our current monthly rate is less than that of many newsletters I subscribe to. if you like reading our work, consider supporting it voxdotcom.visitlink.me/8xp3YM",
    "likes": 12,
    "reposts": 6
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T14:43:14",
    "text": "The Supreme Court’s latest decision is a love letter to the abundance agenda.\n\nwww.vox.com/scotus/41485...",
    "likes": 57,
    "reposts": 14
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T14:51:47",
    "text": "Thanks so much to the kids who talked to me about their hopes and dreams for this week’s nl!",
    "likes": 8,
    "reposts": 3
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T15:03:07",
    "text": "Hi folks! If you follow me to stay on top of climate or health news, I'd love to put a plug in for @vox.com's membership program. Right now new annual memberships are 30% off \n\nIf you value our journalism, consider signing up! It's the most direct way to support our work. www.vox.com/support-memb...",
    "likes": 12,
    "reposts": 6
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T15:48:09",
    "text": "We're running our first Vox Membership sale! New annual memberships are 30% off for a limited time, and monthly are also discounted. voxdotcom.visitlink.me/8xp3YM",
    "likes": 2,
    "reposts": 1
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T17:52:31",
    "text": "\"The right’s push for prohibiting lab-grown meat is fueled by little more than paranoia, greed, and cultural grievance.\" Read more: voxdotcom.visitlink.me/VLxN_n",
    "likes": 32,
    "reposts": 10
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T13:22:37",
    "text": "Earth is full of wonder — we help you see it. Vox Members make that possible. \n\nFor a limited time, join for 30% off and get unlimited access, ad-free podcasts, and more:\nvoxdotcom.visitlink.me/sA4mVD",
    "likes": 3,
    "reposts": 1
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T09:20:03",
    "text": "I've been using Google's new AI Mode and I like it and it terrifies me www.vox.com/technology/4...",
    "likes": 5,
    "reposts": 2
  },
  {
    "username": "Vox",
    "created_at": "2025-05-29T09:35:29",
    "text": "The Trump administration is targeting a wildlife science program that’s crucial for public health — even though it costs less than 1% of the Interior budget.\n\n@benjij.bsky.social for @vox.com: www.vox.com/environment/...",
    "likes": 29,
    "reposts": 15
  },
  {
    "username": "Vox",
    "created_at": "2025-05-28T21:49:47",
    "text": "The sweeping federal court order striking down Trump’s tariffs, explained \n\nwww.vox.com/donald-trump...",
    "likes": 147,
    "reposts": 43
  },
  {
    "username": "Vox",
    "created_at": "2025-05-28T22:15:06",
    "text": "If this decision stands on appeal, it’s a big loss for Trump that will make it difficult for his trade war to continue. www.vox.com/donald-trump...",
    "likes": 140,
    "reposts": 30
  },
  {
    "username": "Vox",
    "created_at": "2025-05-28T12:11:47",
    "text": "The left’s attachment to thinking of politics in “material” terms is causing it to misread the moment. voxdotcom.visitlink.me/GN0z8e",
    "likes": 24,
    "reposts": 5
  },
  {
    "username": "Vox",
    "created_at": "2025-05-28T10:46:13",
    "text": "The socialist left's insistence on seeing the world in materialist terms makes it ill-equipped to understand the real roots of Trump and similar far-right figures www.vox.com/politics/414...",
    "likes": 46,
    "reposts": 9
  },
  {
    "username": "Vox",
    "created_at": "2025-05-28T10:32:05",
    "text": "a few months ago, a young reader wrote to me about wanting to date but finding it hard to trust others. that general distrust is so pervasive in society today. i dug into the science of how we decide who to trust, what destroys it, and how to be a little more trusting www.vox.com/even-better/...",
    "likes": 14,
    "reposts": 4
  },
  {
    "username": "Vox",
    "created_at": "2025-05-28T11:53:43",
    "text": "The new pope is so focused on AI that he actually chose the name Leo XIV *because of AI* \n\nIs it weird for the Catholic Church to be making this a priority? Not at all! I argue it makes perfect sense — other religions should do the same \n\nwww.vox.com/future-perfe...",
    "likes": 20,
    "reposts": 5
  },
  {
    "username": "Vox",
    "created_at": "2025-05-27T16:40:13",
    "text": "China is the world’s largest single greenhouse gas emitter.\n\nBut now, for the first time, there’s been a shift: The country’s greenhouse gas emissions have actually fallen even as energy demand went up. Learn more: voxdotcom.visitlink.me/9HROrY",
    "likes": 101,
    "reposts": 27
  },
  {
    "username": "Vox",
    "created_at": "2025-05-27T12:28:33",
    "text": "In his latest move, Trump is attacking the people who have helped bail out American higher education. voxdotcom.visitlink.me/GVlo8U",
    "likes": 28,
    "reposts": 12
  },
  {
    "username": "Vox",
    "created_at": "2025-05-27T12:12:51",
    "text": "There are two Gen Zs. And that divide within the generation certainly complicates the long-held belief that younger voters are generally more progressive than older ones — and that Democrats thus have a natural edge with younger generations. voxdotcom.visitlink.me/bZe523",
    "likes": 24,
    "reposts": 6
  },
  {
    "username": "Vox",
    "created_at": "2025-05-23T14:09:14",
    "text": "Why the Senate’s repeal of California’s gas car ban is such a big deal. voxdotcom.visitlink.me/6yll2U",
    "likes": 54,
    "reposts": 20
  },
  {
    "username": "Vox",
    "created_at": "2025-05-23T14:08:11",
    "text": "The Republican justices draw a line in the sand – in an order that makes absolutely no sense. voxdotcom.visitlink.me/xJZSB5",
    "likes": 26,
    "reposts": 8
  },
  {
    "username": "Vox",
    "created_at": "2025-05-23T12:22:45",
    "text": "The GOP says states’ rights matter — until it’s California. The Senate’s repeal of California’s gas car ban isn’t just about emissions. It sets a dangerous precedent for environmental policy anywhere.\n\nFrom @vox.com via @grist.org: www.vox.com/climate/4142...",
    "likes": 44,
    "reposts": 12
  },
  {
    "username": "Vox",
    "created_at": "2025-05-23T13:46:30",
    "text": "During a brutal ocean heat wave, clownfish actually shrank to survive. It’s a surprising adaptation that shows how some creatures are finding ways to cope even as warming oceans are becoming inhospitable for many species.\n\n@benjij.bsky.social for @vox.com:\nwww.vox.com/down-to-eart...",
    "likes": 22,
    "reposts": 7
  },
  {
    "username": "Vox",
    "created_at": "2025-05-22T14:45:03",
    "text": "One of the GOP justices must have defected in a case about religious schools, but the Court didn’t reveal who it was. voxdotcom.visitlink.me/NATP6c",
    "likes": 46,
    "reposts": 10
  },
  {
    "username": "Vox",
    "created_at": "2025-05-22T14:44:04",
    "text": "What wouldn’t Jesus do? voxdotcom.visitlink.me/KLUw3w",
    "likes": 50,
    "reposts": 18
  },
  {
    "username": "Vox",
    "created_at": "2025-05-22T14:43:08",
    "text": "Everything you need to discuss before moving in with your partner. voxdotcom.visitlink.me/fCpfFr",
    "likes": 20,
    "reposts": 3
  },
  {
    "username": "Vox",
    "created_at": "2025-05-22T14:37:42",
    "text": "In a time of uncertainty in the US and around the world, one of the most reliable sources of joy is hearing from kids about what they want their future to look like. \n\nWhat hopes and dreams do the kids in your lives have for themselves and for the world? Let us know here: forms.gle/4qQ8r5CL1BVH...",
    "likes": 15,
    "reposts": 3
  },
  {
    "username": "Vox",
    "created_at": "2025-05-21T18:05:17",
    "text": "Elon Musk, Jeff Bezos, and Mark Zuckerberg share a favorite author: Iain M. Banks, the Scottish science fiction writer best known for his Culture series. \n\nBanks is an odd choice for a bunch of tech billionaires. The author was a socialist and avowed hater of the super-rich.",
    "likes": 54,
    "reposts": 15
  },
  {
    "username": "Vox",
    "created_at": "2025-05-21T11:33:42",
    "text": "A conservation program in the US-Mexico Borderlands is mobilizing an unlikely advocate to help save the endangered jaguar—the rancher. \n\n@benjij.bsky.social's latest feature details an amazing shift: humans and apex predators more peacefully coexisting. \n\nwww.vox.com/down-to-eart...",
    "likes": 18,
    "reposts": 7
  },
  {
    "username": "Vox",
    "created_at": "2025-05-21T11:36:02",
    "text": "Bad news: Most of the big forest nations that promised to end deforestation by 2030 are experiencing more forest loss today than they did when they made the pledge. \n\n@benjij.bsky.social for @vox.com: www.vox.com/climate/4137...",
    "likes": 32,
    "reposts": 17
  },
  {
    "username": "Vox",
    "created_at": "2025-05-21T11:39:37",
    "text": "Normally, cities navigating a lead poisoning crisis (impacting dozens of schools and thousands of children) could depend on the CDC for federal support. \n\nNot anymore.\n\n@dylanlscott.bsky.social for @vox.com:  www.vox.com/public-healt...",
    "likes": 37,
    "reposts": 25
  },
  {
    "username": "Vox",
    "created_at": "2025-05-21T11:34:17",
    "text": "\"No tax on tips\" looks less like a pro-worker tax credit and more like a big business tax cut.\nvoxdotcom.visitlink.me/4OVTMJ",
    "likes": 44,
    "reposts": 15
  },
  {
    "username": "Vox",
    "created_at": "2025-05-19T16:22:58",
    "text": "What do the kids in your life want the future to look like?\nWe're collecting dreams, hopes, and big ideas for an upcoming edition of Vox's Kids Today newsletter. \n\nLet us know! forms.gle/xHvViJvne1ss...",
    "likes": 17,
    "reposts": 4
  },
  {
    "username": "Vox",
    "created_at": "2025-05-19T11:12:46",
    "text": "President Trump's second term has so far been dominated by his aggressive use of executive power — but now, he’s finally trying to get something through Congress.\n\nHe’s promising tax cuts and a “new golden age.” Here's what's really inside his big, beautiful bill.",
    "likes": 44,
    "reposts": 26
  },
  {
    "username": "Vox",
    "created_at": "2025-05-16T12:35:06",
    "text": "Gen Z is experiencing a growing divide — not just politically, but spiritually, too.\n\nData shows a quiet revival of religion, especially among young men, may be fueling their shift to the right. Young women, meanwhile, are drifting from organized religion.",
    "likes": 39,
    "reposts": 8
  },
  {
    "username": "Vox",
    "created_at": "2025-05-15T11:50:25",
    "text": "In uncertain times, children's dreams — to help people, save the planet, or become astronaut-scientist-rock stars — remind us what's possible.\n\nFor our Kids Today newsletter, we want to hear from kids (and their grown-ups) about their hopes for the future: voxdotcom.visitlink.me/QMzoGJ",
    "likes": 17,
    "reposts": 3
  },
  {
    "username": "Vox",
    "created_at": "2025-05-15T09:53:58",
    "text": "This administration is undoubtedly “pro-Israel” in rhetoric and its willingness to go to extraordinary lengths to punish Israel’s critics in America. \nBut as he conducts his foreign policy, Trump seems remarkably unconcerned about what Israel has to say about it.\n www.vox.com/politics/413...",
    "likes": 45,
    "reposts": 14
  },
  {
    "username": "Vox",
    "created_at": "2025-05-15T09:13:42",
    "text": "The Trump administration is trying to remove protections for a very odd bird on a technicality and maybe that doesn't sound like a big deal but it's actually a very big deal and signals something scary for all other species near the brink\n\nwww.vox.com/down-to-eart...",
    "likes": 37,
    "reposts": 27
  },
  {
    "username": "Vox",
    "created_at": "2025-05-15T11:24:13",
    "text": "This story was really fascinating to work on. Teens talked to me about how their phones enable passive-aggressive, conflict-avoidant behavior, and what to do about that",
    "likes": 100,
    "reposts": 13
  },
  {
    "username": "Vox",
    "created_at": "2025-05-15T10:49:47",
    "text": "What do the kids in your life want the future to look like?\n\nWe're collecting dreams, hopes, and big ideas for an upcoming edition of Vox's Kids Today newsletter. Let us know! forms.gle/QqDkj8YvidVP...",
    "likes": 12,
    "reposts": 1
  },
  {
    "username": "Vox",
    "created_at": "2025-05-14T16:05:53",
    "text": "Hearing aids are being reimagined as sleek, multifunctional wearables.\n\nFrom AirPods with accessibility features to smart glasses that double as hearing aids, hearing assistive technology is becoming as common as noise-canceling headphones or fitness trackers.",
    "likes": 30,
    "reposts": 2
  },
  {
    "username": "Vox",
    "created_at": "2025-05-14T12:41:02",
    "text": "Rachel Fobar has a great story for us today on what the hell is going on with animal experimentation under the Trump administration, balancing a lot of threads very well - give it a read! \n\nwww.vox.com/future-perfe...",
    "likes": 29,
    "reposts": 14
  },
  {
    "username": "Vox",
    "created_at": "2025-05-14T13:52:42",
    "text": "For an upcoming edition of Kids Today, I want to hear about kids’ hopes for the future! If you have kids in your life and want to talk about their goals and dreams, you can fill out the form here (kids 13+ also welcome to fill it out themselves)",
    "likes": 11,
    "reposts": 3
  },
  {
    "username": "Vox",
    "created_at": "2025-05-14T09:04:47",
    "text": "MAGA's intellectual cadres are buckling under the pressures of power www.vox.com/on-the-right...",
    "likes": 66,
    "reposts": 12
  },
  {
    "username": "Vox",
    "created_at": "2025-05-13T09:31:49",
    "text": "The problem with stadium tours? For one thing, STADIUMS. www.vox.com/music/412355...",
    "likes": 32,
    "reposts": 4
  },
  {
    "username": "Vox",
    "created_at": "2025-05-13T12:04:08",
    "text": "What is \"moral ambition\" — and should you have more of it? Would it make your career feel a lot more meaningful? \n\n@rutgerbregman.com thinks so. I talked to him about his new book — read an excerpt of our convo here and listen to the podcast version linked in the piece!\n\nwww.vox.com/future-perfe...",
    "likes": 45,
    "reposts": 6
  },
  {
    "username": "Vox",
    "created_at": "2025-05-13T12:16:00",
    "text": "Some truly phenomenal charities here — check out the ones between @pureearthnow.bsky.social and @give-directly.bsky.social. You can buy a year of happiness for someone for just $9!  \n\nDetails here: www.vox.com/future-perfe...",
    "likes": 11,
    "reposts": 1
  },
  {
    "username": "Vox",
    "created_at": "2025-05-13T13:43:28",
    "text": "Take your Vox puzzle experience offline for a whole new dimension of solving with our brand new crosswords books.\n⁠\nLinks to purchase both books can be found here: www.vox.com/21523212/cro...",
    "likes": 6,
    "reposts": 0
  },
  {
    "username": "Vox",
    "created_at": "2025-05-12T09:12:30",
    "text": "Israel has announced a \"concluding\" plan for Gaza that, if implemented, would amount a moral crime of historical proportions. There's still time to stop it — but America is looking away \n\nwww.vox.com/world-politi...",
    "likes": 507,
    "reposts": 206
  },
  {
    "username": "Vox",
    "created_at": "2025-05-12T12:13:14",
    "text": "The Pahalgam attack was yet another example of how we continue to underestimate what jihadi militant groups are capable of, and how they continue to drive global events even as governments want to move on from the \"war on terror\".\nExplored this dynamic last year www.vox.com/world-politi...",
    "likes": 4,
    "reposts": 2
  },
  {
    "username": "Vox",
    "created_at": "2025-05-12T12:26:39",
    "text": "The weather forecast does not appear by magic.\n\nIt relies on countless government employees, a massive network of sensors, tens of thousands of weather balloon launches—to record a stunning 6.3 billion observations/day\n\nNow that system is being taken apart, piece by piece\nwww.vox.com/climate/4124...",
    "likes": 62,
    "reposts": 29
  },
  {
    "username": "Vox",
    "created_at": "2025-05-12T13:54:45",
    "text": "Notable that the US-China trade statement doesn't mention fentanyl www.vox.com/politics/406...",
    "likes": 68,
    "reposts": 19
  },
  {
    "username": "Vox",
    "created_at": "2025-05-09T14:28:39",
    "text": "Quality journalism needs your support — now more than ever. \n\nHelp Vox keep making sense of the world. Become a member today: voxdotcom.visitlink.me/JvNx5e",
    "likes": 17,
    "reposts": 4
  },
  {
    "username": "Vox",
    "created_at": "2025-05-08T19:02:35",
    "text": "The first American pope — Chicago-born Robert Francis Prevost, Pope Leo XIV — has been elected, a mere 249 years after the founding of the nation. But he isn’t a symbol of American triumph or decline. voxdotcom.visitlink.me/Ad0BjS",
    "likes": 303,
    "reposts": 39
  },
  {
    "username": "Vox",
    "created_at": "2025-05-08T16:17:26",
    "text": "Pope Leo XIV, the church’s new leader and its first American pope, has signaled he’ll follow in Pope Francis’s footsteps.\n\nDoes that mean he's conservative? Liberal? That question may be beside the point.\n\nAmerican politics has poisoned how we think about the papacy.",
    "likes": 77,
    "reposts": 8
  },
  {
    "username": "Vox",
    "created_at": "2025-05-08T09:10:31",
    "text": "Nobody said the future would be good for you www.vox.com/technology/4...",
    "likes": 10,
    "reposts": 3
  },
  {
    "username": "Vox",
    "created_at": "2025-05-08T09:27:34",
    "text": "When housing researchers asked Seattle fire officials about their unique building code that permits single-stair buildings, they were met with a shrug.\n\n\"It was this emperor’s no clothes moment,\" @aarmlovi.bsky.social said.\n\nwww.vox.com/housing/4101...",
    "likes": 48,
    "reposts": 9
  },
  {
    "username": "Vox",
    "created_at": "2025-05-08T08:39:02",
    "text": "Grandparents are playing a bigger role in kids’ lives. They need support too.",
    "likes": 21,
    "reposts": 3
  },
  {
    "username": "Vox",
    "created_at": "2025-05-08T10:36:54",
    "text": "When cities have upzoned, we see more studio, one and two bedroom apartments, but very little development of family-sized units (3 or 4 bedrooms.) \n\nAdvocates say single stair reform could help change that, and allow more families with kids to stay in cities if they want\n\nwww.vox.com/housing/4101...",
    "likes": 66,
    "reposts": 19
  },
  {
    "username": "Vox",
    "created_at": "2025-05-06T17:43:16",
    "text": "Don’t blame Joe Rogan too much — one theory says that the roots of this gender gap go back decades. voxdotcom.visitlink.me/Cf232h",
    "likes": 23,
    "reposts": 5
  },
  {
    "username": "Vox",
    "created_at": "2025-05-06T17:42:32",
    "text": "The loving, aggravating, inescapable relationship that lasts a lifetime. voxdotcom.visitlink.me/kMVzge",
    "likes": 25,
    "reposts": 4
  },
  {
    "username": "Vox",
    "created_at": "2025-05-06T12:59:59",
    "text": "For the last 17 years, a group of cicadas known as Brood XIV has been buried several inches underground, doing very little. \n\nNow they’re about to emerge. \n\nBy the billions.",
    "likes": 46,
    "reposts": 12
  },
  {
    "username": "Vox",
    "created_at": "2025-05-05T10:15:33",
    "text": "I loved this @annanorth.bsky.social piece wrestling with the new research on potentially eliminating menopause\n\nwww.vox.com/life/410612/...",
    "likes": 42,
    "reposts": 5
  },
  {
    "username": "Vox",
    "created_at": "2025-05-05T11:12:05",
    "text": "New treatments on the horizon could delay or potentially even eliminate menopause. Do we want that?",
    "likes": 6,
    "reposts": 6
  },
  {
    "username": "Vox",
    "created_at": "2025-05-05T11:26:09",
    "text": "Dani and James calling it how it is. \n\nwww.vox.com/today-explai... @vox.com",
    "likes": 82,
    "reposts": 15
  },
  {
    "username": "Vox",
    "created_at": "2025-05-05T13:35:38",
    "text": "The economic costs of President Donald Trump’s trade war are becoming painfully clear:\n\n📈 Rising prices and interest rates\n📉 Retirement savings are bleeding value\n💵 Economic growth is slow\n🚚 Manufacturers are slashing orders\n❌ Small businesses are on the brink of insolvency.",
    "likes": 84,
    "reposts": 44
  },
  {
    "username": "Vox",
    "created_at": "2025-05-02T11:07:36",
    "text": "Wildlife Services 2024 body count included over 2,000 green iguanas, almost 1,700 red-tailed hawks, and 614 armadillos, according to recently published data.\n\n@kennytorrella.bsky.social breaks it down for @vox.com: www.vox.com/future-perfe...",
    "likes": 36,
    "reposts": 18
  },
  {
    "username": "Vox",
    "created_at": "2025-05-02T09:19:35",
    "text": "America’s federal public lands are truly unique, part of our birthright as citizens. No other country in the world has such a system.\n\nBut during the first 100 days of President Donald Trump’s second term, those lands have come under relentless attack.",
    "likes": 185,
    "reposts": 73
  }
]