[
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T17:21:56",
    "text": "AI is speedrunning the social media era by optimizing chatbots for engagement, user feedback, time spent. \n\nEvidence is mounting that this poses unintended risks, includ. chats from peer-reviewed research, OpenAI's \"sycophancy\" debacle, & Character ai lawsuits www.washingtonpost.com/technology/2...",
    "likes": 177,
    "reposts": 74
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T15:59:59",
    "text": "Four ways women are stronger than men\n\nGood stuff from @starrevartan.bsky.social, author of The Stronger Sex\n\nwww.washingtonpost.com/health/2025/...",
    "likes": 103,
    "reposts": 27
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T16:42:41",
    "text": "Breaking news: Billionaire entrepreneur Jared Isaacman, President Trump’s pick to be NASA administrator, has been told that his nomination will be rescinded, according to a person who has been briefed on it.",
    "likes": 186,
    "reposts": 49
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T16:01:22",
    "text": "Honolulu police say they are launching a review after attorneys accused officers of arresting sober drivers to meet quotas.\n\nThe ACLU of Hawaii says it has identified at least 127 people arrested from 2022 through 2024 who had blood alcohol levels of 0.00.",
    "likes": 6236,
    "reposts": 1850
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T15:28:34",
    "text": "Chatbots tuned to win people over can end up saying dangerous things to vulnerable users, a new study found.",
    "likes": 93,
    "reposts": 33
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T14:56:32",
    "text": "Some of the U.K.’s richest residents are leaving for Spain, Italy, Switzerland and the United Arab Emirates — places where taxes are lower or where they can pay a flat tax to shield their global income.",
    "likes": 161,
    "reposts": 50
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T14:12:16",
    "text": "Allison Jedson graduated with her doctorate from the University of Rhode Island with her three children, who each earned bachelor's degrees. The family attended five ceremonies in three days.",
    "likes": 254,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T13:19:14",
    "text": "Exclusive: The Justice Department is using a little-known law to criminally charge unauthorized immigrants who have failed to register their presence in the country, threatening them with potential jail time and fines.",
    "likes": 540,
    "reposts": 247
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T12:35:33",
    "text": "Elon Musk said he was “horsing around” with his 5-year-old son X, who struck him in the face and caused a bruise.\n\n“I said, ‘Go ahead, punch me in the face.’ And he did,” he said.",
    "likes": 119,
    "reposts": 26
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T11:28:11",
    "text": "Trump administration lawyers are arguing that the Library of Congress doesn’t belong to Congress — the latest move to erase the traditional lines that separate the branches of government.",
    "likes": 758,
    "reposts": 324
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T10:40:55",
    "text": "You'd expect more troops to seize more fentanyl, cutting supply and driving up prices. But seizures are down, and the drug remains cheap and plentiful in the United States.\n\nSome security officials believe cartels are getting better at evading detection\n\nwww.washingtonpost.com/world/2025/0...",
    "likes": 83,
    "reposts": 22
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T10:20:47",
    "text": "An impersonator breached the phone of White House Chief of Staff Susie Wiles, President Trump said, and pretended to be her in calls and messages received by her high-profile contacts.",
    "likes": 330,
    "reposts": 100
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-31T09:45:54",
    "text": "Airlines appear to be charging individual passengers more than groups for seats on identical flights.",
    "likes": 319,
    "reposts": 105
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T20:22:53",
    "text": "Meta announced on Thursday that it will work with defense technology start-up Anduril to offer the U.S. military and its allies technology for soldiers involving augmented reality and artificial intelligence software.",
    "likes": 68,
    "reposts": 27
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T18:26:10",
    "text": "Pitching in tonight for @postsports.bsky.social for some 🏀! And it should be a fun one: Mystics-Liberty at 7:30.\n\nLiberty’s Jonquel Jones (hamstring) went through warmups and is a game-time decision. Mystics’ Sika Koné (wrist) was upgraded to active.",
    "likes": 27,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T19:13:26",
    "text": "Return to office five days a week except for the three weeks that the office will house soldiers for the military parade that coincides with the president's 79th birthday www.govexec.com/workforce/20...",
    "likes": 172,
    "reposts": 43
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T18:57:39",
    "text": "Breaking news: President Donald Trump said Friday that he would double tariffs on steel imports from 25 percent to 50 percent.\n\nThe president spoke at a rally at U.S. Steel in Pennsylvania to herald the deal between the company and Japan’s Nippon Steel. wapo.st/4judrE2",
    "likes": 114,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T17:30:18",
    "text": "Shakira’s performance at the WorldPride Welcome Concert has been canceled.\n\nThe pop icon had been set to perform at the baseball stadium on Saturday night as part of the opening festivities for WorldPride, the largest LGBTQ+ festival in the world.",
    "likes": 61,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T11:11:50",
    "text": "In 2007, Kari Lake won two Emmys for reporting in Cambodia.\n\nNow in the gov't, she’s tasked with dismantling Voice of America and Radio Free Asia — the two most important independent news sources in the increasingly authoritarian country. @washingtonpost.com: \n\nwww.washingtonpost.com/style/media/...",
    "likes": 66,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T15:14:40",
    "text": "President Donald Trump announced he has fired the director of the National Portrait Gallery, Kim Sajet, whom he called “highly partisan.” It's unclear if Trump has the authority to fire Sajet.",
    "likes": 136,
    "reposts": 66
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T14:06:18",
    "text": "Breaking news: Contradicting HHS Secretary Robert F. Kennedy Jr., the CDC continues to recommend the coronavirus vaccines for healthy children, according to new documentation posted to the agency's website.",
    "likes": 21708,
    "reposts": 4927
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T12:44:14",
    "text": "Queen of eras, master of rights: Taylor Swift now owns all of her music, ending the music ownership fight that inspired her “Taylor’s Version” re-records.",
    "likes": 1854,
    "reposts": 209
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T12:21:22",
    "text": "A Department of Defense employee who monitored insider threats is accused of trying to trade secrets for citizenship in a foreign nation because of disagreements with the Trump administration.",
    "likes": 49,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T11:46:02",
    "text": "Years before Kari Lake was involved in the Trump administration, she was an Emmy Award-winning journalist.\n\nNow, she's embracing the task of eliminating the USAGM organization’s ability to cover news abroad.",
    "likes": 69,
    "reposts": 22
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T11:05:58",
    "text": "President Trump’s second term has been volatile.\n\nThis week — with back-and-forth over his tariffs, criticism from Elon Musk and no real progress on ending wars — shows how quickly his fortunes can rise and fall.",
    "likes": 64,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T10:38:49",
    "text": "Breaking news: The Supreme Court cleared the way, for now, for the Trump administration to revoke the temporary legal status of more than 530,000 migrants from four countries who have been allowed to live and work in the United States while their immigration cases play out.",
    "likes": 94,
    "reposts": 48
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T10:11:34",
    "text": "Plumes of dense smoke from uncontained wildfires in Manitoba, Canada, will blow across more than a dozen central and eastern states Friday and Saturday.\n\nA milky haze will overtake Midwestern skies Friday, reducing air quality from Minnesota to Michigan and southward to Illinois and Indiana.",
    "likes": 312,
    "reposts": 114
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T09:42:25",
    "text": "U.S. Immigration and Customs Enforcement is shaking up its leadership as the Trump administration struggles to ramp up deportations and meet the president’s goal of removing 1 million unauthorized immigrants in his first year.",
    "likes": 41,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T09:02:49",
    "text": "Column by Michelle Singletary: Almost a third of Americans say they’ll take on debt this summer for vacation. \n\nHere’s how to return home with memories, not financial remorse.",
    "likes": 24,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T08:39:48",
    "text": "There is a peculiar charm and revelation in watching a young player on the way to becoming possibly a champion. This is especially true at Roland Garros. \n\nColumn by @sallyjenx.bsky.social",
    "likes": 33,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T08:26:52",
    "text": "One of 2025’s most important primaries is drawing to a close in New Jersey, setting up a high-profile test of voters’ views on Trump’s Republican Party and a Democratic Party looking to rebuild.",
    "likes": 41,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T07:55:51",
    "text": "A pair of courtroom defeats has blown a hole in President Donald Trump’s plan to use historically high tariffs to reshape global trade, raise hundreds of billions of dollars in new tax revenue and boost the fortunes of domestic manufacturers.",
    "likes": 133,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-30T07:26:40",
    "text": "As soon as Faizan Zaki heard what would become his winning word at the Scripps National Spelling Bee, his eyes lit up.\n\nWithout hesitation, Faizan spelled éclaircissement, pretending to type each letter on an imaginary keyboard with signature confidence. wapo.st/3ZIvqj0",
    "likes": 2498,
    "reposts": 334
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T22:29:28",
    "text": "C-H-A-M-P-I-O-N: Faizan Zaki, 13, of Texas wins the Scripps National Spelling Bee.\n\nThe runner-up from last year was competing in his fourth bee. The national spelling contest celebrated its 100th anniversary this year.",
    "likes": 249,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T21:30:02",
    "text": "Some of the citations in the White House’s sweeping “MAHA Report” appear to have been generated using artificial intelligence, resulting in numerous garbled scientific references and invented studies, AI experts said Thursday.",
    "likes": 416,
    "reposts": 164
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T20:47:06",
    "text": "Michigan Gov. Gretchen Whitmer said President Trump would be breaking a promise if he went through with pardoning the two men who were convicted of plotting to kidnap her, claiming that he pledged not to do so during a conversation last month.",
    "likes": 416,
    "reposts": 97
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T19:32:51",
    "text": "Nine students will face off Thursday on the final night of the 2025 Scripps National Spelling Bee.\n\nThe three-day competition began with 243 spellers from across the U.S. and other areas, including Canada, Nigeria and Kuwait. \n\nFollow live updates here:",
    "likes": 49,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T18:25:11",
    "text": "Tracking Trump, Day 130:\n\n• Tariffs back on after whiplash rulings\n• More pardons for convicted felons\n• Does Trump always chicken out on trade?\n\nPlus more to know for May 29: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 21,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T17:04:56",
    "text": "A new curriculum would teach Oklahoma high schoolers that there were “discrepancies” in the 2020 presidential election. Some parents opposed to the new standards are trying to remove their children from the future lessons, while others filed a lawsuit.",
    "likes": 1009,
    "reposts": 311
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T16:05:05",
    "text": "Breaking news: President Donald Trump’s tariffs can continue for now, after an appeals court granted the Trump administration's request to temporarily stay a lower court’s order.",
    "likes": 63,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T15:26:02",
    "text": "Three women and two doctors are suing Kansas over a law that nullifies a person’s decisions about end-of-life care if they are pregnant, arguing that it violates the right to personal autonomy and equal protection under the state constitution.",
    "likes": 2499,
    "reposts": 621
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T14:51:53",
    "text": "Billionaire Elon Musk is formally leaving the Trump administration after months of overseeing contentious federal spending.\n\nWhile DOGE team’s status and legacy remain up in the air, we took a look back on Musk’s major moments:",
    "likes": 68,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T14:21:44",
    "text": "A new partnership will link United’s MileagePlus and JetBlue’s TrueBlue loyalty programs, allowing members of each to earn and redeem points on either carrier’s flights, as soon as this fall.",
    "likes": 58,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T13:24:55",
    "text": "Irreversible tipping points in the climate system — like the melting of Arctic ice sheets or the wide-scale collapse of coral reefs — are closer than scientists previously believed.",
    "likes": 526,
    "reposts": 286
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T13:14:51",
    "text": "The 2-year-old, native-born U.S. citizen, removed by ICE in February, is now stuck in Poté on a soon-to-expire tourist visa without a Brazilian citizen’s access to routine pediatric checkups, day care or school @terrencemccoy.bsky.social and Marina Dias report\nwww.washingtonpost.com/world/2025/0...",
    "likes": 125,
    "reposts": 68
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T12:31:02",
    "text": "Breaking news: A federal judge blocked the Trump administration’s attempt to bar international students from enrolling at Harvard. The ruling grants Harvard a win in one of the most high-stakes battles in its ongoing war with the administration.",
    "likes": 631,
    "reposts": 162
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T12:00:03",
    "text": "The federal Court of International Trade ruled that President Trump exceeded his authority in imposing broad tariffs on goods imported from around the world.\n\nWe explain what the Court of International Trade is, which tariffs have been halted and what happens next.",
    "likes": 93,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T11:28:46",
    "text": "A marine heat wave has formed near Florida, the Caribbean and Bahamas, which can enhance the level of moisture and fuel available for storms, heighten humidity and help lock in unusually high temperatures for weeks.",
    "likes": 211,
    "reposts": 65
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T10:08:06",
    "text": "An underappreciated aspect of the new WMO report -- if the temperature predictions are correct, the world will pass 1.5C in as a long-term average (i.e., the _actual_ Paris goal) in 2027. \n\nIn just two years. \n\nwww.washingtonpost.com/climate-envi...",
    "likes": 196,
    "reposts": 119
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T10:43:34",
    "text": "your dose of joy and hope this morning: our feature on the effort to adopt dogs on the Ukrainian front lines. www.washingtonpost.com/world/intera...",
    "likes": 67,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T10:45:48",
    "text": "President Trump extended relief to at least 11 people whose crimes spanned decades and included tax evasion and extortion, according to a White House official.\n\nThe pardon recipients confirmed by the official all had felony convictions, like Trump, and could see an array of benefits.",
    "likes": 96,
    "reposts": 56
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T10:19:46",
    "text": "Breaking news: The Supreme Court narrowed the scope of government-required environmental reviews for major infrastructure projects, overturning a lower-court block on a controversial rail line in Utah that would carry billions of gallons of oil.",
    "likes": 45,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T10:02:51",
    "text": "\"I studied in the U.S. because I loved what America is about: it’s open, inclusive and diverse. Now my students and I feel slapped in the face\" www.washingtonpost.com/immigration/... @davidnakamura.bsky.social",
    "likes": 112,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T09:56:14",
    "text": "A relocation of Newtok, Alaska, residents highlights how ill-prepared the United States is to respond to the way climate change is making some places uninhabitable, according to an investigation by The Post, ProPublica and KYUK radio.",
    "likes": 863,
    "reposts": 299
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T09:28:43",
    "text": "Elon Musk, a key adviser to President Donald Trump who oversaw the U.S. DOGE Service, said Wednesday that he is leaving the administration after leading a contentious effort to reshape the federal bureaucracy and slash government spending. wapo.st/3ZzCGO3",
    "likes": 63,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T09:03:34",
    "text": "Wildfires in the Canadian province of Manitoba, which shares a border with the United States, have prompted authorities to declare a state of emergency and order tens of thousands of people to leave their homes.\n\nWinds will likely blow wildfire smoke into Midwestern states.",
    "likes": 1812,
    "reposts": 699
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T08:34:07",
    "text": "Rep. Jamie Raskin, the top Democrat on the House Judiciary Committee, opened a probe into the private dinner that President Trump hosted for top investors in his meme coin, seeking to highlight the ethical and legal concerns raised by the president’s willingness to profit while in office.",
    "likes": 623,
    "reposts": 138
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T08:08:00",
    "text": "Analysis by Ben Golliver: Oklahoma City’s 124-94 victory over the Minnesota Timberwolves in Game 5 of the Western Conference finals returned the franchise to the Finals for the first time since 2012 and avenged a heartbreaking West finals loss to the Golden State Warriors in 2016.",
    "likes": 49,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T07:44:13",
    "text": "Lawyers for the Trump administration said officials are complying with a federal judge’s orders to return a wrongly deported Guatemalan man to the United States, one of the first public signs of a turnaround by a government that has aggressively resisted returning deportees.",
    "likes": 158,
    "reposts": 47
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-29T07:09:23",
    "text": "A specialized federal court in New York ruled that most of President Trump’s tariffs — including those on Chinese goods — are illegal, upending negotiations with more than a dozen nations and creating fresh uncertainty for countless American businesses.",
    "likes": 255,
    "reposts": 64
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T22:00:07",
    "text": "Elon Musk, a key adviser to President Trump who oversaw the U.S. DOGE Service, said he is leaving the administration.\n\nA day earlier, in a huge break with Trump and Republicans, Musk said he did not approve of the president's major spending bill.",
    "likes": 188,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T21:03:57",
    "text": "A New Jersey federal judge ruled that the detention of Mahmoud Khalil, a student activist from Columbia University, was unconstitutional.\n\nBut the judge declined to issue a preliminary injunction in the case, so Khalil must remain in detention.",
    "likes": 232,
    "reposts": 58
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T20:31:33",
    "text": "Breaking news: Secretary of State Marco Rubio has announced that the State Department will ‘aggressively revoke’ visas for Chinese students with ties to the Chinese Communist Party and those studying in “critical fields.”",
    "likes": 67,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T20:17:57",
    "text": "Breaking news: Qatar has asked the U.S. to clarify that the pending transfer of a luxury jetliner President Trump wants for Air Force One was initiated by the administration and that Qatar was not responsible for any future transfers, officials said.",
    "likes": 1757,
    "reposts": 514
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T19:47:01",
    "text": "Breaking news: The Court of International Trade ruled that President Donald Trump exceeded his authority in imposing tariffs on all imported goods. The president invoked a 1977 law that granted him emergency powers over the economy.",
    "likes": 398,
    "reposts": 113
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T19:15:13",
    "text": "Health and Human Services Secretary Robert F. Kennedy Jr.’s surprise announcement ending coronavirus vaccine recommendations for healthy children and pregnant women blindsided the agency, according to officials.",
    "likes": 2127,
    "reposts": 764
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T18:38:03",
    "text": "Tracking Trump, Day 129:\n\n• Republicans reject a \"millionaire tax\"\n• RFK Jr.'s attack on scientific journals\n• Elon Musk disapproves of Trump's bill\n\nPlus more to know for May 28: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 45,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T16:31:48",
    "text": "A federal judge in New York cleared a path for the Treasury Department’s DOGE team to access data systems that contain sensitive financial information on millions of Americans.",
    "likes": 89,
    "reposts": 57
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T16:12:06",
    "text": "A group of activist Tesla shareholders are calling on CEO Elon Musk to devote at least 40 hours a week to the company after he spent much of the past year focused on federal politics.",
    "likes": 210,
    "reposts": 39
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T15:10:29",
    "text": "Researchers have developed new tools that can deliver genes and selectively activate them in hundreds of different cell types in the brain and spinal cord. Scientists hope this could help treat ALS, Parkinson’s disease and Alzheimer’s.",
    "likes": 991,
    "reposts": 262
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T14:19:00",
    "text": "Planned Parenthood has paused abortions in Missouri after the state Supreme Court ruled a judge used the wrong standard to block abortion restrictions. The decision comes after voters approved a constitutional right to reproductive freedom last November.",
    "likes": 220,
    "reposts": 92
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T12:50:59",
    "text": "Yes, double-dipping can transmit bacteria and viruses from your mouth to the shared bowl. And yes, in theory, those microorganisms can be spread to other eaters. But in most cases, that might not be as risky as it seems.",
    "likes": 119,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T12:22:11",
    "text": "International students contributed $44 billion to the U.S. economy in the 2023-2024 school year. Economists warn that the loss of international students would affect not just the schools that depend on their tuition but local and state economies, as well.",
    "likes": 207,
    "reposts": 93
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T12:13:10",
    "text": "The New York Fed estimates that more than 9 million borrowers will see their credit scores nosedive as their history of missed student loan payments will return to their credit. The good news is they can fix it.   www.washingtonpost.com/business/202...",
    "likes": 28,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T11:54:05",
    "text": "A Venezuelan artist who was part of a viral song begging President Trump not to deport him hopes to make the same case in immigration court that he made in the song: that he deserves a shot at the American Dream.",
    "likes": 74,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T11:26:42",
    "text": "DC Streetcars will be phased out after just a little over a decade in service, a little longer than it took to build. In its place Mayor Muriel Bowser promises a “next generation streetcar,” otherwise known as an electric bus www.washingtonpost.com/dc-md-va/202...",
    "likes": 121,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T11:31:36",
    "text": "Analysis by Glenn Kessler: There is no dispute that people have died because the Trump administration abruptly suspended foreign aid. One might quibble over how many people have died. But you can’t call it a lie.",
    "likes": 739,
    "reposts": 220
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T09:29:48",
    "text": "A great story from Anahad O'Connor. \n\nWhat to look for and avoid in a protein bar --> wapo.st/4k9zOzT",
    "likes": 22,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T09:30:47",
    "text": "After a flurry of offseason moves, the Fever’s depth will be tested without Caitlin Clark as she misses her first regular season game since high school. www.washingtonpost.com/sports/2025/...",
    "likes": 7,
    "reposts": 1
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T10:51:17",
    "text": "House Republicans rejected a push by some allies of President Donald Trump to include tax hikes on the rich in sweeping legislation they passed last week — a decision that could carry repercussions into next year’s elections.",
    "likes": 71,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T10:06:08",
    "text": "Elon Musk said in an interview that slashing the size of federal government proved far tougher than he expected and lamented the intense criticism leveled at the U.S. DOGE Service, which he has led. wapo.st/4kFrCY1",
    "likes": 165,
    "reposts": 27
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T09:38:17",
    "text": "Column by Michelle Singletary: Here’s the truth about navigating the aftermath of student loan delinquency if your score dropped dramatically.",
    "likes": 28,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T08:53:05",
    "text": "A federal judge ruled that the Treasury Department’s DOGE team could access sensitive financial information on millions of Americans, but they must be vetted and trained first.",
    "likes": 59,
    "reposts": 43
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T08:21:40",
    "text": "President Donald Trump lashed out at the Kremlin on Tuesday for its unwillingness to negotiate a ceasefire with Ukraine as he continued to consider increased sanctions against Russia.\n\nIn perhaps his harshest rhetoric yet against Vladimir Putin, Trump declared that Putin is “playing with fire.”",
    "likes": 68,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T07:52:46",
    "text": "Trump’s pick to investigate waste, fraud and abuse at the Labor Department, Anthony D’Esposito, is a former Republican congressman who lost his New York seat after he was accused of putting his mistress and fiancée’s daughter on his payroll.",
    "likes": 210,
    "reposts": 101
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-28T07:16:04",
    "text": "Health and Human Services Secretary Robert F. Kennedy Jr. said that he could bar government scientists from publishing in the world’s leading medical journals, instead proposing the creation of “in-house” publications by his agency.",
    "likes": 5421,
    "reposts": 2166
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T21:55:41",
    "text": "Several times a month, if not multiple times a week, Wings of Rescue flies pets from precarious situations, such as overcrowded shelters or natural disaster zones, to safety.\n\nSince its founding in 2012, the nonprofit has transported nearly 79,000 animals.",
    "likes": 1778,
    "reposts": 349
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T21:22:24",
    "text": "After launching into space, SpaceX loses another Starship in test flight.\n\nThe spacecraft came apart midflight Tuesday evening after a successful launch to space. There was no crew aboard the test flight.",
    "likes": 480,
    "reposts": 125
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T20:52:20",
    "text": "The State Department on Tuesday suspended foreign students’ visa appointments as it weighs expanded guidelines for screening applicants’ social media accounts.",
    "likes": 74,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T15:11:14",
    "text": "After not participating in the past two Winter Olympics, NHL players will play in Milan. But Alex Ovechkin will not be among them.",
    "likes": 50,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T19:42:26",
    "text": "President Donald Trump will soon pardon Todd and Julie Chrisley, the former stars of USA Network’s “Chrisley Knows Best,” who were found guilty of fraud and tax evasion, the White House confirmed on Tuesday.",
    "likes": 180,
    "reposts": 61
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T18:48:34",
    "text": "Tracking Trump, Day 128:\n\n• A rift in Pete Hegseth's inner circle\n• RFK's new covid vaccine recommendations\n• NPR sues Trump administration\n\nPlus more to know for May 27: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 63,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T18:18:39",
    "text": "Michael “Mike” Nedd, a 30-year veteran of Bureau of Land Management who serves as deputy director for administration and programs, was removed Tuesday.\n\nHe had reportedly told career employees to ignore a memo from an appointee of the U.S. DOGE Service.",
    "likes": 599,
    "reposts": 255
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T17:01:49",
    "text": "Charles didn’t mention Trump in his Speech from the Throne. Given all its references to Canada‘s independence, sovereignty and new friends, he didn’t have to\n\nAmanda Coletta reports from Toronto\n\nwww.washingtonpost.com/world/2025/0...",
    "likes": 152,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T15:34:16",
    "text": "A former assistant to Sean Combs testified that the rapper showed up at her home with a gun and told her he was going to Kid Cudi’s house “to kill him\" after learning about Cudi's relationship with Casandra Ventura.\n\nFollow more from the trial:",
    "likes": 60,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T15:24:56",
    "text": "The Trump administration is directing federal agencies to cancel or redirect contracts with Harvard University, an effort that affects roughly $100 million in federal agreements with the Ivy League institution.",
    "likes": 51,
    "reposts": 26
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T13:26:17",
    "text": "The Supreme Court declined to take the case of a Massachusetts middle school student who said his free speech rights were violated when school administrators forbid him to wear a T-shirt that read, “There Are Only Two Genders.”",
    "likes": 100,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T11:58:36",
    "text": "Breaking news: Health and Human Services Secretary Robert F. Kennedy Jr. is ending his agency's recommendation that healthy pregnant women and healthy children receive the coronavirus vaccine.",
    "likes": 2889,
    "reposts": 1083
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T11:31:18",
    "text": "Millions of Americans are suddenly facing dramatically lower credit scores from delinquent student loans, making it tougher for them to secure housing, insurance, car loans, even employment at a vulnerable time for the U.S. economy.",
    "likes": 162,
    "reposts": 81
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T10:59:46",
    "text": "NPR sued the Trump administration on Tuesday, saying that a May 1 executive order violates the news organization’s First Amendment rights.\n\n“This is not about politics — it is about principle,” the member stations wrote in a joint statement.",
    "likes": 302,
    "reposts": 55
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T10:05:22",
    "text": "North Korea blasted President Donald Trump’s plans for a defense shield designed to track and intercept missiles on Tuesday, calling it a “very dangerous” and “threatening” move that could be used for offensive purposes. \nwww.washingtonpost.com/world/2025/0...",
    "likes": 44,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T10:26:28",
    "text": "More than 32,000 low-paid AmeriCorps service workers were terminated in a sweeping budget cut last month that gutted the national service program.\n\nThe April 25 move was one of the biggest government cutbacks since the Trump administration took office, but went largely unnoticed.\n\nHere’s why:",
    "likes": 161,
    "reposts": 93
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T09:52:00",
    "text": "☀️ Summer is on the way. ☀️\n\nFind out where it will be unusually hot, humid, wet and sunny — and what parts of the country might see drought intensify.",
    "likes": 27,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T09:12:12",
    "text": "Border czar Tom Homan, captain of the \"zero tolerance\" policy that split migrant parents from their kids, was paid money by the private-prison company that profits off detaining immigrants. Drain the swamp www.washingtonpost.com/business/202... @douglasmac.bsky.social @aaronschaffer.com",
    "likes": 572,
    "reposts": 277
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T09:17:19",
    "text": "At the Pentagon, personality conflicts persist and inexperience reigns, fueling internal speculation about Defense Secretary Pete Hegseth’s long-term viability in President Trump’s Cabinet.",
    "likes": 351,
    "reposts": 83
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T08:44:01",
    "text": "Deputy Director Dan Bongino said the FBI will reexamine the leaked Supreme Court draft decision to overturn Roe v. Wade and the discovery of cocaine at the White House.",
    "likes": 220,
    "reposts": 76
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T08:16:51",
    "text": "The third week of testimony in Sean “Diddy” Combs’s sex-trafficking and racketeering case will bring more government witnesses to the stand, including Combs’s former assistant Capricorn Clark. \n\nFollow for live updates here:",
    "likes": 47,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T08:11:33",
    "text": "Border czar Tom Homan earned at least $5,000 in fees consulting for a division of the GEO Group, one of two companies that operates the vast majority of the nation’s immigrant detention facilities, per a financial disclosure obtained by The Post. wapo.st/4jrr9Yv",
    "likes": 151,
    "reposts": 77
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T07:45:20",
    "text": "The Department of Veterans Affairs, the government’s second-largest agency, serving some of America’s most vulnerable citizens, is set to lose 83,000 employees under the Trump administration’s cutbacks.",
    "likes": 292,
    "reposts": 160
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T07:18:28",
    "text": "House Republicans barely passed a massive bill containing much of President Trump’s domestic agenda after months of tense negotiations between feuding factions. Now it’s the Senate’s turn.\n\nHere are seven ways Republican senators are pressing to change the bill:",
    "likes": 66,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-27T06:49:41",
    "text": "Liverpool police detained a man in connection with an incident in which a car was driven through a crowd as thousands celebrated Liverpool’s soccer championship Monday on the city’s streets, sending the celebration into chaos. wapo.st/3H8q9et",
    "likes": 169,
    "reposts": 31
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T13:28:56",
    "text": "On a new live recording, BRUCE SPRINGSTEEN isn’t warning us of what’s coming, he’s speaking out against what’s here\n\nwapo.st/4dAgxFu",
    "likes": 278,
    "reposts": 53
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-26T13:59:15",
    "text": "Twice a day, every day, meteorologists around the world simultaneously release weather balloons. But in recent months, fewer balloons are being launched in many corners of the United States.\n\nIn some cases, helium or hydrogen shortages are to blame.",
    "likes": 378,
    "reposts": 121
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-26T13:38:27",
    "text": "Sgt. Quandarius Stanley suffered a brain injury in last year’s Gaza pier mission. His recovery was cut short by his unexpected and mysterious death.",
    "likes": 116,
    "reposts": 42
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-26T13:03:58",
    "text": "From failing to publicize a major outbreak to scaling back safety alert specialists and rules, the Trump administration’s anti-regulatory and cost-cutting push risks unraveling a critical system that helps ensure the safety of the U.S. food supply, according to experts.",
    "likes": 361,
    "reposts": 196
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-26T09:01:07",
    "text": "Nothing makes sense with these two teams. Not the Pacers taking the first two games inside rowdy Madison Square Garden, and not New York then spoiling Indy’s advantage by winning Game 3. \n\nColumn by @candacedbuckner.bsky.social",
    "likes": 15,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-26T10:48:43",
    "text": "The head of the Gaza Humanitarian Foundation abruptly resigned Sunday, expressing concern that the newly formed group’s plans were impossible to carry out without compromising what he called “humanitarian principles of humanity, neutrality, impartiality, and independence.”",
    "likes": 127,
    "reposts": 46
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-26T09:59:39",
    "text": "President Donald Trump said Sunday that he would delay tariffs that were set to be imposed next week on the European Union until July 9.\n\nTrump said that he and the Europeans intend to “rapidly get together and see if we can work something out.”",
    "likes": 66,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-26T09:29:34",
    "text": "A New York City crypto investor kidnapped a 28-year-old man and tortured him for weeks by electrocuting him with wires, beating him with a gun and forcing him to smoke cocaine to extort cryptocurrency from him, prosecutors and police say.",
    "likes": 161,
    "reposts": 56
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T16:08:50",
    "text": "Need a backpack big enough for a weekend trip that's not too bulky? Our travel team has their top recommendations.",
    "likes": 35,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T15:14:31",
    "text": "People are uploading selfies to ChatGPT and asking how they can glow up. Some say they have spent thousands of dollars following the artificial intelligence’s suggestions.",
    "likes": 66,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T14:24:59",
    "text": "Doctors who treat patients for obesity are being forced to develop what amounts to a subspecialty in navigating health coverage for the most popular class of weight-loss medications, known as GLP-1 drugs.",
    "likes": 259,
    "reposts": 53
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T13:27:44",
    "text": "85 percent of children diagnosed with cancer are alive at least five years later, according to the National Cancer Institute. Survivors can face lifelong complications from their treatments — something oncologists are working to improve.",
    "likes": 971,
    "reposts": 203
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T12:56:06",
    "text": "Flag football will make its debut in the 2028 Olympics. Quarterback Darrell Doucette III believes players with flag experience have subtle but substantial advantages over NFL athletes, who are eligible to play.",
    "likes": 52,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T12:26:11",
    "text": "Anne Valerie Ter, 14, lost her mother and sister in the DCA plane crash. After their deaths, she pounded her grief into the piano keys as she prepared for a concert.",
    "likes": 211,
    "reposts": 39
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T11:51:47",
    "text": "Jennifer Aniston credits her next-level fitness to Pvolve, a low-impact exercise program. \n\nAndrea Sachs tested the travel kit and a free month of classes to see if it really works.",
    "likes": 31,
    "reposts": 0
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T10:40:36",
    "text": "The Trump administration’s move to end deportation protections for wartime allies who fled to the U.S. after the fall of Afghanistan has infuriated veterans, who say the U.S. government is betraying a sacred promise.",
    "likes": 390,
    "reposts": 158
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-25T09:46:29",
    "text": "Millions of Americans are suddenly facing dramatically lower credit scores from delinquent student loans, making it tougher for them to secure housing, insurance, car loans and even employment.",
    "likes": 154,
    "reposts": 65
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T16:41:49",
    "text": "Analysis by Will Oremus: Over the past two weeks, Elon Musk's Grok committed a string of bizarre blunders that might make it difficult for the AI to gain mainstream credibility.",
    "likes": 156,
    "reposts": 39
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T15:52:59",
    "text": "While tariff-fueled inflation has yet to show up broadly in the economy, it could be driving a noticeable uptick in the cost of furniture and other household furnishings, according to experts.",
    "likes": 86,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T15:16:23",
    "text": "Madison Hubbell and Gabriella Papadakis, two Olympic gold medal ice dancers, want to change figure skating — ice dance, in particular.",
    "likes": 1008,
    "reposts": 158
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T14:17:50",
    "text": "Politics has been central to Elon Musk’s identity over much of the past year, but his latest obsession has faded into disenchantment over the personal costs and difficulties in producing results, said two people familiar with his thinking in recent months.",
    "likes": 205,
    "reposts": 36
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T12:51:53",
    "text": "“You are the first West Point graduates of the golden age of America,” President Trump said during his address to the graduating class of the U.S. Military Academy at West Point on Saturday. “We’ve turned it around.”",
    "likes": 72,
    "reposts": 23
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T12:18:29",
    "text": "The pilot of a small private plane that crashed in a residential neighborhood of San Diego earlier this week faced fog as he attempted to land, while runway lights and a weather alert system at the airport were not working, investigators said.",
    "likes": 1721,
    "reposts": 718
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T09:40:10",
    "text": "There’s this look Dylan Crews and Luis García Jr. began to exchange in the Nationals dugout. \n\n“When he hits it hard, he just looks at me and I say, ‘I know,’” García said, laughing.\n\nWhat is it like to be two of the unluckiest players in MLB? I asked ‘em:\nwww.washingtonpost.com/sports/2025/...",
    "likes": 20,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T10:07:34",
    "text": "In the (free to read) charts newsletter this week, I went long on age and death in Congress. s2.washingtonpost.com/camp-rw/?tra...",
    "likes": 183,
    "reposts": 51
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T10:23:51",
    "text": "The three Cuban American lawmakers finally agreed late Wednesday to go along with the package after President Trump agreed not to extend a Treasury Department license allowing energy giant Chevron to continue to produce and export Venezuelan oil.",
    "likes": 58,
    "reposts": 34
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-24T09:02:42",
    "text": "Prove citizenship to vote? For some married women, it might not be so easy.  www.washingtonpost.com/politics/202...",
    "likes": 72,
    "reposts": 23
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T21:22:27",
    "text": "Colorado strengthened its protections for immigrants on Friday, adopting legislation that reinforces its unwillingness to cooperate with the Trump administration’s mass deportation campaign even as the president wields lawsuits and funding cuts in bids to bend blue jurisdictions to his will.",
    "likes": 395,
    "reposts": 70
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T21:21:13",
    "text": "Masked officers descended on courthouses across the country this week and arrested stunned immigrants showing up for scheduled immigration hearings as part of a new directive from federal officials aimed at dramatically accelerating deportations.",
    "likes": 237,
    "reposts": 141
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T20:50:31",
    "text": "Billy Joel has canceled all of his scheduled performances in the United States and Britain because of a brain disorder called normal pressure hydrocephalus, according to a statement. Here’s what to know about the ailment, according to experts.",
    "likes": 160,
    "reposts": 26
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T19:55:18",
    "text": "A former Los Angeles deputy mayor of public safety has agreed to plead guilty to making a fake bomb threat to City Hall for which he sought to blame a fabricated anti-Israel actor, federal prosecutors said.",
    "likes": 159,
    "reposts": 54
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T18:06:38",
    "text": "Tracking Trump, Day 124:\n\n• Tariff threats on the E.U. and Apple\n• A block on Trump's Harvard enrollment ban\n• Russia-Ukraine prisoner swap\n\nPlus more to know for May 23: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 25,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T18:34:43",
    "text": "Scores of staffers at the White House National Security Council were abruptly dismissed on Friday, as the Trump administration moved to dramatically downsize the coordinating body, according to people familiar with the matter.",
    "likes": 107,
    "reposts": 55
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T16:54:25",
    "text": "A federal judge on Friday struck down President Donald Trump’s executive order sanctioning the law firm Jenner & Block, the second time a court has struck down one of Trump’s efforts to punish a firm.",
    "likes": 276,
    "reposts": 64
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T14:52:45",
    "text": "The House Republicans’ tax and spending package is set to infuse the Trump administration with a monumental funding hike for immigration enforcement, aiming to dramatically ramp up the scale and pace of the president’s mass deportation agenda.",
    "likes": 43,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T13:34:48",
    "text": "Stocks moved lower Friday after President Donald Trump threatened new tariffs on imports from the European Union and on iPhones made outside the United States.\n\nMajor U.S. indexes were down roughly 1 percent in early afternoon trading.",
    "likes": 68,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T12:29:45",
    "text": "Breaking news: A federal judge has temporarily prevented the Department of Homeland Security from revoking Harvard’s ability to enroll international students.",
    "likes": 398,
    "reposts": 75
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T11:34:22",
    "text": "Justin Sun, known for his showy publicity stunts, has spent more than $20 million on the $TRUMP meme coin, making him one of its largest holders.\n\nHere’s what to know.",
    "likes": 69,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T10:44:30",
    "text": "Climate advocates are mobilizing against the Trump tax bill, warning that it threatens to cede the United States’ leadership role in global efforts to combat climate change. \n\nThey plan to pressure Republican senators by citing home-state economic damage.",
    "likes": 124,
    "reposts": 27
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T10:07:32",
    "text": "Media Matters, a left-leaning watchdog group that publishes reports on conservative media and social media platforms such as Elon Musk’s X, said it received a civil investigative demand letter from the Federal Trade Commission.",
    "likes": 224,
    "reposts": 93
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T09:32:04",
    "text": "President Donald Trump threatened Apple on Friday with a minimum 25 percent tariff if the tech giant does not make iPhones for American customers in the United States.",
    "likes": 58,
    "reposts": 30
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T08:58:12",
    "text": "The House passage of Trump’s biggest legislative priority was a joint victory for the president and Speaker Mike Johnson, who earned and kept the president’s trust throughout the tricky negotiations, according to multiple House GOP and White House officials.",
    "likes": 20,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T08:29:38",
    "text": "Breaking news: Harvard University said it planned to file a lawsuit Friday morning against the Trump administration, challenging the abrupt federal revocation of the school’s ability to enroll international students.",
    "likes": 277,
    "reposts": 67
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T08:20:54",
    "text": "An area west of Mexico is being monitored for a possible tropical storm or hurricane next week, as a storm-sparking pulse moves across the Pacific Ocean.",
    "likes": 60,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T07:50:19",
    "text": "A federal judge has extended her freeze on President Donald Trump’s plan for mass layoffs and reorganizations at 22 federal agencies until a lawsuit against his administration is resolved, saying the president “likely must” seek approval from Congress before carrying out such widespread changes.",
    "likes": 456,
    "reposts": 116
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-23T07:19:02",
    "text": "Approved by Congress in 2022, the plaque honoring law enforcement personnel for defending the Capitol on Jan. 6, 2021, can’t be installed until House Republican leadership gives the go-ahead.",
    "likes": 594,
    "reposts": 324
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T21:28:31",
    "text": "Disney notified 45 “cast members” who are Venezuelan workers who lost their temporary protected status that they are on leave without pay after the Supreme Court upheld the Trump administration’s termination of their legal status — the first major company to do so.",
    "likes": 176,
    "reposts": 126
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T17:56:35",
    "text": "NEW \n\nDuring his first term, President Trump tried to terminate Temporary Protected Status for immigrants from El Salvador. \n\nAnd then he and President Bukele struck a deal.\n\nThis year Trump hasn't touched TPS for Salvadorans, as it sends Venezuelans to that nation's prisons.",
    "likes": 111,
    "reposts": 39
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T18:18:33",
    "text": "We're an hour away from President Trump's meme coin dinner, where he'll again cross what was once seen as an ethical red line: profiting off the presidency www.washingtonpost.com/politics/202... @cqzakrz.bsky.social",
    "likes": 1113,
    "reposts": 325
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T19:16:18",
    "text": "Scott 'Kid Cudi' Mescudi's testimony marked the first time he’s publicly addressed a sensational allegation first described in Cassie Ventura’s 2023 lawsuit against Sean “Diddy” Combs: She claimed Combs blew up Mescudi’s car after he found out Mescudi was dating her. wapo.st/3ZxWEsy",
    "likes": 65,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T18:41:34",
    "text": "Tracking Trump, Day 123:\n\n• What Trump's bill could mean for you\n• Supreme Court deadlocked on religious schools\n• A new \"MAHA\" health report\n\nPlus more to know for May 22: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 16,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T15:19:33",
    "text": "The sweeping tax bill passed by the House on Thursday morning is the cornerstone of the Republican Party’s economic agenda, with the potential to influence pocketbook issues like tax rates, overtime, child care and health care.\n\nHere are 10 ways it could affect your finances:",
    "likes": 44,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T14:34:45",
    "text": "Breaking news: The Trump administration revoked Harvard’s ability to enroll foreign students, saying it allowed anti-American agitators.\n\nExisting foreign students must transfer or risk losing their legal status, DHS said.",
    "likes": 223,
    "reposts": 136
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T14:34:35",
    "text": "A small private plane crashed in a residential neighborhood in San Diego, setting ablaze numerous homes and vehicles and killing at least two passengers that were on the plane.",
    "likes": 133,
    "reposts": 54
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T13:28:26",
    "text": "Investor unease over President Donald Trump’s economic program drove the government’s borrowing costs to their highest level in nearly two decades, following House approval of tax legislation that is expected to add trillions of dollars to the ballooning U.S. national debt.",
    "likes": 100,
    "reposts": 40
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T13:26:33",
    "text": "Yaron Lischinsky was a photographer who wanted to be a diplomat. Sarah Milgrim tried to forge relationships to bring peace.\n\nThey were killed Wednesday as a gunman opened fire near the Capital Jewish Museum in D.C. wapo.st/43t3mRI",
    "likes": 58,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T12:48:19",
    "text": "The White House blamed exposure to environmental toxins, poor nutrition and increased screen time for a decline in Americans’ life expectancy Thursday.",
    "likes": 316,
    "reposts": 79
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T12:41:03",
    "text": "Scott “Kid Cudi” Mescudi said he and Sean Combs met at the Soho House in Los Angeles after someone blew up the rapper’s car — the first time the men had seen each other since they entered a love triangle with Cassie Ventura. wapo.st/4k4QDM9",
    "likes": 26,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T12:08:16",
    "text": "More details are emerging about the young couple who was shot and killed near the Capital Jewish Museum in D.C. late Wednesday.\n\nFollow the latest updates:",
    "likes": 40,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T11:44:50",
    "text": "The unsuccessful nomination of Ed Martin revealed a shifting relationship between the president and GOP senators — and Trump’s willingness to walk away from a protracted fight.",
    "likes": 54,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T11:09:05",
    "text": "Kid Cudi, real name Scott Mescudi, arrived at the courthouse Thursday morning for Sean “Diddy” Combs’s sex-trafficking and racketeering trial.\n\nThe rapper took the stand shortly afterward.\n\nFollow along for live updates here: wapo.st/4jywe1j",
    "likes": 29,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T11:00:29",
    "text": "The House narrowly approved President Trump’s massive tax-and-immigration legislation despite intense internal divisions among Republican lawmakers..\n\nNow, the bill heads to the Senate, which is expected to rework it extensively over the next few weeks.\n\nHere’s what to expect:",
    "likes": 24,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T10:26:12",
    "text": "Breaking news: The Supreme Court deadlocked over the constitutionality of the nation’s first public religious charter school, blocking the creation of the controversial Catholic online academy in Oklahoma.",
    "likes": 133,
    "reposts": 29
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T10:09:46",
    "text": "Rapper Kid Cudi expected to testify Thursday in Sean Combs’s sex-trafficking case\n\n--Scott “Kid Cudi” Mescudi is rapper who briefly dated Ventura — and whose car exploded after a jealous Combs threatened to blow it up, according to a lawsuit Ventura filed.\nwww.washingtonpost.com/entertainmen...",
    "likes": 18,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T10:18:06",
    "text": "Breaking news: The Supreme Court upheld the conviction of a government contractor found guilty of defrauding a state transportation program designed to promote diversity. \n\nThe unanimous decision reversed a trend in which the justices have pushed back on how prosecutors pursue white-collar fraud.",
    "likes": 387,
    "reposts": 88
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T09:51:17",
    "text": "Wendy McMahon, who resigned on Monday, made clear that she did not want CBS’s parent company, Paramount, to settle President Trump’s lawsuit. \n\nNow, many staffers at the network are viewing her departure as further proof that a settlement is imminent.",
    "likes": 105,
    "reposts": 29
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T09:10:07",
    "text": "North Korea’s efforts to modernize its navy — and its military pride — have been damaged after its newest warship partially capsized during a launch ceremony on Wednesday, with leader Kim Jong Un calling the “catastrophic failure” a “criminal act.” \nwww.washingtonpost.com/world/2025/0...",
    "likes": 64,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T09:20:33",
    "text": "The House passed a sweeping budget proposal, dubbed the One Big Beautiful Bill, in a 215-214-1 vote on Thursday morning.\n\nSee how your representative voted here:",
    "likes": 62,
    "reposts": 40
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T08:47:42",
    "text": "Day 9 of Sean “Diddy” Combs’s sex-trafficking and racketeering trial is expected to bring several government witnesses to the stand. \n\nAmong them is Scott “Kid Cudi” Mescudi.\n\nFollow along for live updates here:",
    "likes": 29,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T08:16:49",
    "text": "Exclusive: The Trump administration is allowing “forced reset triggers,” which ATF declared illegal during the Biden administration because they make semi-automatic weapons fire more rapidly.",
    "likes": 129,
    "reposts": 75
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T07:40:16",
    "text": "A young Israeli couple was shot dead near the Capital Jewish Museum in Washington late Wednesday by a gunman who chanted “free, free Palestine” after the shooting, according to authorities. \n\nA suspect was in custody. wapo.st/3YVbNnJ",
    "likes": 52,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-22T07:01:13",
    "text": "Breaking news: House Republicans approved President Trump’s sprawling tax and immigration agenda Thursday morning, sending to the Senate legislation that the GOP hopes will transform the federal government.",
    "likes": 66,
    "reposts": 35
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T23:58:37",
    "text": "“We are actively investigating and working to get more information to share,” Homeland Security Secretary Kristi L. Noem said of a shooting that killed two Israeli Embassy staff members late Wednesday. \nwapo.st/43sc8j0",
    "likes": 43,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T22:03:58",
    "text": "Ari Katz first met Martha Stewart as a high school senior in 2019 through a shared love of chickens.\n\nTheir initial 30-minute meeting stretched to four hours, leading to the formation of an unlikely friendship and a new business.",
    "likes": 58,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T21:15:54",
    "text": "A federal district court judge issued an order Wednesday allowing Mahmoud Khalil, a Columbia graduate student and pro-Palestinian activist, to meet with his wife and lawyers at a detention center, possibly facilitating him to meet his newborn baby. \n\nFollow more updates here:",
    "likes": 145,
    "reposts": 27
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T18:27:15",
    "text": "Tracking Trump, Day 122:\n\n• A clash with South Africa's president\n• U.S. accepts Qatar's airplane gift\n• What the No Tax on Tips Act would do\n\nPlus more to know for May 19: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 39,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T17:46:27",
    "text": "Two people have been charged with helping inmates who broke out of a New Orleans jail, Louisiana State Police said Wednesday, as a days-long manhunt continues for the escapees whom authorities have called “armed and dangerous.”",
    "likes": 45,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T14:56:51",
    "text": "In early February, as many as 75% of Elon Musk's posts on X were about DOGE or U.S. politics.\n\nRecently, the figure has been more like 10%. Instead, he's posting WAY more about his companies.\n\nMy latest w/ @sarahellison.bsky.social: www.washingtonpost.com/politics/202...",
    "likes": 189,
    "reposts": 48
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T16:54:47",
    "text": "Elon Musk used to be a political force on X. Now he’s back to business. \n\nThe shift mirrors Musk’s effort to revive his companies, which suffered reputational damage and, in Tesla’s case, steep declines in stock price.\nwapo.st/3FnIq6P",
    "likes": 82,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T16:18:56",
    "text": "A judge slammed federal prosecutors for dropping charges against Newark's Democratic mayor, calling the move “embarrassing” and saying it suggested “a failure to adequately investigate” after he was charged following a visit to an ICE facility.",
    "likes": 742,
    "reposts": 160
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T15:50:49",
    "text": "Column by Barry Svrluga: The NFL's response to the Eagles' tush push should have been, “We have to find a better way to stop this.” Instead, their response was: \"Let’s try to change the rules.\"",
    "likes": 53,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T15:19:36",
    "text": "Climate change is devastating the delicate reef habitats of clownfish. Researchers found they're adopting a strange behavior to survive. wapo.st/4jaVFWf",
    "likes": 83,
    "reposts": 22
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T14:43:02",
    "text": "Federal air safety regulators are restricting flights at Newark Liberty International Airport until the end of the year as officials scramble to train more air traffic controllers.",
    "likes": 650,
    "reposts": 251
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T14:16:05",
    "text": "In an extraordinary exchange, President Donald Trump amplified false claims that White Afrikaners have been victims of a genocide in a meeting with South Africa President Cyril Ramaphosa in the Oval Office. wapo.st/44I1tmG",
    "likes": 87,
    "reposts": 37
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T13:56:27",
    "text": "Breaking news: The Pentagon has taken possession of a Qatari luxury jet sought by President Trump for use as Air Force One despite national security experts saying it raises significant cost and security concerns, and members of Congress questioning whether the deal is ethical.",
    "likes": 235,
    "reposts": 106
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T12:58:50",
    "text": "Column by Lili Loofbourow: Norm from “Cheers” may have looked simple, but George Wendt, who died Tuesday at 76, understood from the start that the character was a paradox.",
    "likes": 63,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T12:31:50",
    "text": "Pope Leo XIV is being floated by world leaders — including President Trump — as a mediator between Ukraine and Russia.\n\nPlaying a role in ending the war could help define his early papacy.",
    "likes": 74,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T12:22:17",
    "text": "I'm a health reporter at The Washington Post looking to talk to people who do not qualify under these narrowed criteria about why coronavirus vaccination matters to you \n\nIf you're comfortable sharing your experiences for an article, please email me at fenit.nirappil@washpost.com",
    "likes": 84,
    "reposts": 66
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T12:07:29",
    "text": "The Philadelphia Eagles’ trademark tush push play remains legal and will stay in the sport after NFL owners did not approve a proposal Wednesday that would have banned it.",
    "likes": 39,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T11:36:18",
    "text": "Jacob Thomas and his wife Jennifer, who are farmers in Kansas, took a 10 percent hit when the Trump administration abruptly cut a $1 billion program that supplied local produce and meat to schools and food banks.",
    "likes": 138,
    "reposts": 52
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T10:59:54",
    "text": "The nor’easter, a disruptive type of coastal storm, is more typically seen during winter and rarely happens in May. \n\nIt will bring heavy rain and wind to millions through Friday.",
    "likes": 52,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T10:10:20",
    "text": "Breaking news: The Justice Department says it plans to drop police-accountability agreements with Minneapolis and Louisville, abandoning the Biden administration’s attempt to reshape law enforcement in cities where high-profile killings by officers ignited widespread outrage.",
    "likes": 132,
    "reposts": 77
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T10:03:00",
    "text": "Target is battling a fast-changing trade policy. But it’s also become a focus for angst over corporate rollbacks of diversity efforts.\n\nThe retail chain’s net sales slumped 2.8 percent to $23.8 billion in the first quarter, with foot traffic and sales declining, the company said.",
    "likes": 229,
    "reposts": 55
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T09:31:47",
    "text": "More government witnesses are expected to go on the stand this week in Sean “Diddy” Combs’s sex-trafficking and racketeering trial. \n\nAmong them is Scott “Kid Cudi” Mescudi, a rapper who briefly dated Casandra “Cassie” Ventura while she was involved with Combs.\n\nFollow for live updates here:",
    "likes": 22,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T09:00:18",
    "text": "Denzel Washington made a quick trip to the Cannes Film Festival for the premiere of director Spike Lee’s “Highest 2 Lowest.” \n\nA surprise was waiting for the actor.",
    "likes": 53,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T08:18:44",
    "text": "The Senate unexpectedly passed the No Tax on Tips Act in a unanimous vote, giving weight to the prospect of eliminating federal income tax for cash tips, which picked up political traction during Donald Trump’s presidential campaign.\n\nHere’s what’s in the bill and what it could mean for you.",
    "likes": 35,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T07:45:57",
    "text": "Now that Elon Musk has pulled back from his full-time government role, he posts about space travel, electric vehicles and artificial intelligence. \n\nThe billionaire rarely mentions Trump.\n\nThe shift mirrors Musk’s effort to revive the companies he controls, which suffered reputational damage.",
    "likes": 125,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-21T07:18:12",
    "text": "House Republicans on Wednesday are set to try to push President Trump’s massive tax and immigration package across the finish line, hoping to conquer internal divisions and tee up a vote that would send Trump’s sprawling agenda to the Senate.",
    "likes": 34,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T20:52:36",
    "text": "If Earth stays at its current levels of warming — below policymakers’ goal of 1.5 degrees Celsius — polar ice sheets may melt, causing seas to rise and displacing millions in coastal communities, a new study finds.",
    "likes": 509,
    "reposts": 215
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T19:27:45",
    "text": "Column by Robin Givhan: In the face of Biden’s cancer diagnosis, does the country have the capacity for empathy despite the political rancor, distrust, alternative facts and lies?",
    "likes": 129,
    "reposts": 23
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T17:04:38",
    "text": "For the first time in more than 60 years, two Washington Wizards were named to the NBA’s all-rookie teams",
    "likes": 22,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T18:12:17",
    "text": "A new pod where I try to explain the Trump meme coin dinner to normal people blessed with not knowing what meme coins even are www.washingtonpost.com/podcasts/pos...",
    "likes": 281,
    "reposts": 57
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T18:01:03",
    "text": "The Federal Bureau of Prisons has failed to screen thousands of older inmates in its custody for colorectal cancer, raising the risk that inmates with the disease might miss potentially lifesaving diagnoses, a watchdog said in a report released Tuesday.",
    "likes": 103,
    "reposts": 41
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T17:47:52",
    "text": "After three years of intensive negotiations, the World Health Organization on Tuesday adopted the world’s first agreement on how to cooperate and respond to future pandemics — without the support of the United States.",
    "likes": 2214,
    "reposts": 756
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T16:32:21",
    "text": "Googling things is about to get more complicated thanks to AI.\n\nShould you use Google's new AI Mode? Read more in our guide: wapo.st/43qkl7x",
    "likes": 28,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T15:58:45",
    "text": "Rough work week ahead? Try \"sleep banking,\" or snoozing extra leading up to a big event. Small studies show it can actually help. wapo.st/4jYxMm5",
    "likes": 44,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T14:52:55",
    "text": "NFL players could participate in flag football in the 2028 Olympics in Los Angeles if team owners ratify a resolution this week. wapo.st/3SKOIjW",
    "likes": 33,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T14:20:45",
    "text": "Exclusive: The Trump administration devised plans to spend up to $250 million earmarked for foreign assistance to fund instead the removal and return of people from active conflict zones, according to draft internal documents reviewed by The Post.",
    "likes": 209,
    "reposts": 108
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T13:41:40",
    "text": "A pattern of record-breaking warmth near Iceland is contributing to stormy weather and unusually cool temperatures in the United States this week.",
    "likes": 81,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T12:42:03",
    "text": "President Trump visited Capitol Hill to try to convince moderate and GOP hardliners to vote for a massive tax and immigration bill, which is central to his second-term plans and faces continued resistance.",
    "likes": 66,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T11:52:36",
    "text": "A jail employee was arrested in connection with the escape of 10 inmates from a New Orleans jail. He allegedly turned off the water in a cell where the inmates escaped from — after inmates asked him to do so.",
    "likes": 70,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T11:24:18",
    "text": "The FDA has unveiled plans to narrow its approval for updated coronavirus vaccines to older adults and people with at least one health condition that puts them at high risk for severe disease, marking a significant shift in the agency’s approach to green-lighting the shots.",
    "likes": 413,
    "reposts": 217
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T10:57:42",
    "text": "Tesla CEO Elon Musk said that he plans to do “a lot less” political spending going forward, after he spent massively to elect Donald Trump in the latest presidential election.\n\n“I think I’ve done enough,” Musk, the richest man in the world, said during an interview at the Qatar Economic Forum.",
    "likes": 87,
    "reposts": 18
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T10:30:19",
    "text": "Venezuelans have long considered the Miami suburb of Doral their refuge. \n\nPresident Trump’s immigration crackdown is calling that into question.",
    "likes": 35,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T09:40:51",
    "text": "I wrote about how media companies are responding to pressure to cancel diversity programs, settle lawsuits with Trump and perhaps carry conservative content in hopes of getting their mergers approved by Brendan Carr's FCC. \n\nToday's Tech Brief: www.washingtonpost.com/politics/202...",
    "likes": 63,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T09:59:19",
    "text": "I’m camped out outside Trump’s meeting with House Republicans about their massive tax and immigration package. \n\nHere’s what’s in the (now officially named) “One Big Beautiful Bill.”\n\nwww.washingtonpost.com/business/202...",
    "likes": 78,
    "reposts": 35
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T09:57:07",
    "text": "The second week of Sean “Diddy” Combs’s sex-trafficking and racketeering trial continues Tuesday, with more government witnesses expected to take the stand.\n\nFollow for live updates here:",
    "likes": 25,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T09:25:56",
    "text": "In four months, President Trump and a chainsaw-wielding Elon Musk have hacked off chunks of government in the name of efficiency, with tactics rarely seen in public or private industry.\n\nMany federal workers said they believe cruelty is part of the plan.",
    "likes": 281,
    "reposts": 114
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T08:51:01",
    "text": "Former Atlanta mayor Keisha Lance Bottoms is entering the Georgia governor’s race, casting herself as a fighter who would challenge President Trump and uplift the working people she said are suffering from his economic policies.",
    "likes": 238,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T08:16:42",
    "text": "An IT worker for the nat'l parks drove to a bridge & called a friend to talk him down.\n\nA Medicaid researcher killed herself after repeating \"I’m not enough\" to her family.\n\nA Social Security worker, whose data was under siege by DOGE, died at her cubicle. www.washingtonpost.com/investigatio...",
    "likes": 1497,
    "reposts": 826
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T08:22:55",
    "text": "Secretary of State Marco Rubio is expected to testify on Capitol Hill this week, offering frustrated Democrats their first chance to grill the former Republican senator on the Trump administration’s dramatic cuts to foreign aid and its broader reorientation of U.S. foreign policy.",
    "likes": 101,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T07:51:34",
    "text": "The Department of Health and Human Services is terminating $60 million in federal grants to Harvard University, the latest escalation in the Trump administration’s efforts to force change at some of the nation’s most prominent universities.",
    "likes": 94,
    "reposts": 51
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-20T07:23:58",
    "text": "They call themselves the “Five Families.”\n\nThis week will test whether they can agree to send President Donald Trump’s One Big Beautiful Bill to the Senate.",
    "likes": 43,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T21:16:17",
    "text": "Rep. LaMonica McIver (D-N.J.) will be charged with assaulting, resisting, and impeding law enforcement officers during a confrontation outside an immigration detention center in Newark, New Jersey, last week.",
    "likes": 367,
    "reposts": 125
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T18:42:36",
    "text": "The bombing outside an American Reproductive Centers clinic in Palm Springs, California, shows how difficult the diffuse movement is to combat, say experts.",
    "likes": 69,
    "reposts": 23
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T18:18:54",
    "text": "Adriana Smith was around nine weeks pregnant when she was declared brain-dead in February. But doctors say maintaining life support was the only legal option due to Georgia's strict abortion ban.",
    "likes": 325,
    "reposts": 142
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T17:53:41",
    "text": "Tracking Trump, Day 120:\n\n• What's next for Trump's budget bill?\n• Trump and Putin's 2-hour phone call\n• U.S. to pay $5 million to a Jan. 6 rioter's family\n\nPlus more to know for May 19: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 19,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T17:32:05",
    "text": "Jennifer Lawrence's wildly uninhibited portrayal of postpartum depression has rocketed Lynne Ramsay’s film “Die, My Love” into the awards conversation.",
    "likes": 110,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T14:41:13",
    "text": "Breaking news: The Navy’s former second-highest-ranking officer was convicted of bribery and other counts Monday, becoming the senior-most member of the U.S. military ever convicted of committing a federal crime while on active duty.",
    "likes": 326,
    "reposts": 112
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T14:20:22",
    "text": "The White House pushed for Republicans to support President Trump’s tax and immigration package, which narrowly passed the House Budget Committee late Sunday.\n\nWhite House press secretary Karoline Leavitt suggested that Republicans who oppose the bill would be siding with Democrats. wapo.st/4jeydYr",
    "likes": 43,
    "reposts": 18
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T13:58:13",
    "text": "Breaking news: A federal judge ruled the Trump administration exceeded its authority when it dismantled the U.S. Institute of Peace, an independent nonprofit created by Congress.",
    "likes": 573,
    "reposts": 118
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T13:41:13",
    "text": "Breaking news: President Donald Trump’s administration will pay nearly $5 million to the family of Ashli Babbitt to settle a lawsuit brought by the estate of the Trump supporter who was fatally shot by police when she tried to storm the House Speaker’s lobby during the Jan. 6, 2021 attack.",
    "likes": 79,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T12:45:25",
    "text": "Breaking news: The Supreme Court will allow the Trump administration to cancel temporary protections that have allowed nearly 350,000 Venezuelans to remain in the United States for humanitarian reasons.",
    "likes": 107,
    "reposts": 66
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T12:35:13",
    "text": "Column by Trisha Pasricha, MD: Why are so many young people getting colorectal cancer? New evidence suggests the reason may trace back to early childhood.",
    "likes": 46,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T11:53:54",
    "text": "Regeneron Pharmaceuticals is acquiring 23andMe’s DNA testing business and most of its assets out of bankruptcy, a deal that would put the DNA data of millions of customers in the hands of a pharmaceutical company, which hopes to mine genetic data for insights in crafting medicines.",
    "likes": 104,
    "reposts": 62
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T00:52:58",
    "text": "INGENIOUS President Trump has hit on a new tactic for gutting federal rules and policies that he dislikes @maxinejoselow.bsky.social @hannahnatanson.bsky.social and Ian Duncan report\n\nwww.washingtonpost.com/nation/2025/...",
    "likes": 83,
    "reposts": 36
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T19:32:56",
    "text": "WORLD’S COOLEST DICTATOR™ believed to be preparing arrest warrants for respected investigative journalists\n\nwww.washingtonpost.com/world/2025/0...",
    "likes": 355,
    "reposts": 150
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T11:25:01",
    "text": "Exclusive: Police are increasingly using facial recognition software across the country. An investigation by The Post has found that New Orleans police took this technology a step further, potentially violating municipal guardrails.",
    "likes": 142,
    "reposts": 71
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T11:05:17",
    "text": "“Sesame Street” has found itself a new home. \n\nNetflix announced that the decades-old public educational television program will premiere its 56th season on the global streaming giant, along with 90 hours of previous episodes.",
    "likes": 18229,
    "reposts": 3158
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T11:47:48",
    "text": "The FBI says criminals stole a record $16.6 billion in scams and cybercrime in 2024. This new non-profit is tackling the scam crisis. www.washingtonpost.com/business/202...",
    "likes": 43,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T10:37:06",
    "text": "Rep. Don Bacon, a retired Air Force general who once commanded the nearby Offutt Air Force Base, last month became the first — and to date only — GOP lawmaker to gamble with his political future by demanding the ouster of Defense Secretary Pete Hegseth.",
    "likes": 654,
    "reposts": 146
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T10:09:19",
    "text": "“American Idol” has had upsets before, but Sunday’s finale reminded everyone that a smart song strategy and being vulnerable with the audience pays off.",
    "likes": 23,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T09:37:01",
    "text": "Former president Joe Biden thanked Americans for their “love and support,” a day after it was disclosed he has been diagnosed with an aggressive form of prostate cancer.\n\n“Cancer touches us all,” Biden wrote on X.",
    "likes": 324,
    "reposts": 42
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T08:57:03",
    "text": "The second week of Sean “Diddy” Combs’s trial is expected to bring forth more government witnesses, including the return of Danity Kane singer Dawn Richard to the stand. \n\nFollow along for live updates here:",
    "likes": 28,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T08:25:56",
    "text": "A Mexican naval academy cadet and a sailor died when the “goodwill vessel” they were aboard hit the Brooklyn Bridge on Saturday, Mexico’s president said, as U.S. transportation investigators began to investigate the crash that injured 19 others and left the ship’s masts tangled with the bridge.",
    "likes": 69,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T07:54:50",
    "text": "Vice President JD Vance and Secretary of State Marco Rubio held their first formal meeting with Pope Leo XIV as the Trump administration seeks to reset relations with the Vatican by working together on resolving the war in Ukraine and de-emphasizing fundamental disagreements over migrant policy.",
    "likes": 70,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T07:26:32",
    "text": "A tentative agreement has been reached to end a New Jersey rail strike by raising the wages of locomotive engineers and trainees whose picketing halted the country’s third-largest transit system and threatened to snarl New York City work commutes this week.",
    "likes": 1222,
    "reposts": 211
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-19T06:54:03",
    "text": "The House Budget Committee passed a massive tax and immigration package central to President Trump’s agenda late Sunday, overcoming opposition from hard-line conservatives over spending.",
    "likes": 49,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T16:28:52",
    "text": "Breaking news: Former president Joe Biden has been diagnosed with prostate cancer, a spokesman announced Sunday.\n\nWhile the diagnosis “represents a more aggressive form of the disease, the cancer appears to be hormone-sensitive which allows for effective management,\" the spokesman said.",
    "likes": 288,
    "reposts": 60
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T14:50:59",
    "text": "At least 27 people were killed, including 11-year old twins, and more than 50 injured in the Indian-administered territory of Jammu and Kashmir over four days of fighting between India and Pakistan.",
    "likes": 63,
    "reposts": 23
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T14:22:38",
    "text": "Ari Aster’s political horror story “Eddington” is a love-hate affair that’s certainly got people talking, while “Sirât,” “The Plague” and others have garnered less qualified praise.",
    "likes": 43,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T13:56:18",
    "text": "Vice President JD Vance met Sunday in Rome with Ukrainian President Volodymyr Zelensky as the Trump administration continues to push for a ceasefire in the war in Ukraine.",
    "likes": 66,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T13:39:06",
    "text": "U.S. funding halted Africa’s HIV crisis in the small African country of Eswatini. But the Trump administration’s abrupt withdrawal of U.S. foreign aid has exposed a devastating downside of American hand-holding.",
    "likes": 76,
    "reposts": 23
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T13:21:24",
    "text": "Romanians at home and abroad will choose a new president on Sunday. It might be Romania’s most consequential election since the fall of communism.",
    "likes": 84,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T12:44:23",
    "text": "Israeli forces have started “extensive” ground operations in northern and southern Gaza, the military said Sunday, as airstrikes across the territory killed nearly 100 people and flagging ceasefire negotiations between Israel and Hamas were underway in Qatar.",
    "likes": 59,
    "reposts": 38
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T10:53:20",
    "text": "HOW A TODDLER SURVIVED A 15-STORY FALL “The first thing to realize is that it’s not the fall, it’s the landing”\n\nAlso, an MIT physicist alleges a mouse will survive a fall from an airplane onto dirt\n\nFascinating work from Dan Morse\n\nwww.washingtonpost.com/dc-md-va/202...",
    "likes": 56,
    "reposts": 18
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T11:15:49",
    "text": "The Trump administration has struck a deal to allow sales of a trigger mechanism that allows a semiautomatic firearm to fire more rapidly, one of several actions recently taken by Attorney General Pam Bondi to quickly dismantle Biden-era gun regulations.",
    "likes": 168,
    "reposts": 130
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T10:46:10",
    "text": "The Catholic Church inaugurated its 267th pope on Sunday, who sought to position himself as a humble unifier in an age of arrogance, hatred and division.",
    "likes": 1467,
    "reposts": 201
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T10:16:49",
    "text": "Walmart CEO Doug McMillon said earlier this week that some prices could rise because of the tariffs imposed by President Trump.\n\nTrump responded on Saturday, urging the world’s biggest retailer to simply absorb the consequences of his trade war.",
    "likes": 130,
    "reposts": 41
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T09:59:45",
    "text": "Journalism ran down front-runner Gosger at the Preakness Stakes on Saturday for an improbable half-length victory that had every single one of his human connections in tears.",
    "likes": 134,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T09:43:34",
    "text": "A large explosion that collapsed a fertility clinic in Palm Springs, California, on Saturday killed at least one person and injured four in what the FBI is calling an intentional act of terrorism.",
    "likes": 144,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T08:57:59",
    "text": "A Mexican naval sailing ship crashed into the Brooklyn Bridge on Saturday evening, snapping two of its masts and killing two crew members, officials said.\n\nNineteen others were injured, and two remained in critical condition, Mayor Eric Adams said shortly after midnight Sunday.",
    "likes": 345,
    "reposts": 71
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-18T08:34:07",
    "text": "Exclusive: Federal prosecutors across the country may soon be able to indict members of Congress without approval from lawyers in the Justice Department.\n\nIf adopted, the changes would remove a layer of review intended to ensure that cases against public officials are not politically motivated.",
    "likes": 278,
    "reposts": 183
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-17T19:40:24",
    "text": "An explosion outside a fertility clinic in Palm Springs, California on Saturday killed at least one person in what appears to be an intentional act of violence, Police Chief Andrew Mills said.",
    "likes": 1586,
    "reposts": 525
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-17T11:59:07",
    "text": "President Trump said Saturday that he plans to speak with Russian President Vladimir Putin, Ukrainian President Volodymyr Zelensky and NATO leaders on Monday to try to arrange a ceasefire in the war in Ukraine.",
    "likes": 59,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-17T10:05:42",
    "text": "Across the federal government, DOGE’s push for early retirement and voluntary separation is fueling an exodus of experienced, knowledgeable staffers unlike anything in living memory, according to longtime staffers.",
    "likes": 580,
    "reposts": 239
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-17T09:33:51",
    "text": "A federal appeals court on Friday lifted a block on an executive order from President Trump that seeks to strip union rights from federal workers at dozens of agencies and offices.",
    "likes": 108,
    "reposts": 61
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T22:00:34",
    "text": "Some of the tech industry’s biggest corporations are cracking down on employees who criticize their policies, stifling worker activism that was once ubiquitous in Silicon Valley.\n\nThe companies are rejecting worker petitions, firing employees, and removing critical posts on internal message boards.",
    "likes": 191,
    "reposts": 83
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T21:30:17",
    "text": "An audio recording of a prosecutor’s interview with then-President Joe Biden in 2023 shows Biden speaking slowly, often with long pauses, as he seeks to mentally assemble a sequence of events including his son Beau’s death, his own departure from the vice presidency and the launch of his book.",
    "likes": 45,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T20:59:54",
    "text": "During President Trump’s tour through the Middle East, the White House released daily lists of the dozens of deals it said he had secured during his visits.\n\nHowever, at least half a dozen of the contracts were announced before Trump even took office in January, according to a Post review.",
    "likes": 328,
    "reposts": 150
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T20:38:48",
    "text": "The top 25 WNBA players for the 2025 season",
    "likes": 18,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T20:22:40",
    "text": "Many of the major changes Elon Musk’s U.S. DOGE Service pushed at Social Security have been abandoned or are being reversed after proving ineffective, while others are yielding unintended consequences and badly damaging customer service and satisfaction.",
    "likes": 1898,
    "reposts": 753
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T19:49:41",
    "text": "A federal judge in D.C. gave the Trump administration a week to identify efforts to return Kilmar Abrego García and 137 Venezuelans from El Salvador, while a Maryland federal judge in the Abrego García case expressed increasing frustration with the Justice Department.",
    "likes": 525,
    "reposts": 175
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T19:21:26",
    "text": "Casandra “Cassie” Ventura wrapped up her fourth and final day of testimony in Sean “Diddy” Combs’s federal sex trafficking trial, as the defense concluded cross-examination of the government’s star witness and prosecutors introduced two more.",
    "likes": 61,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T18:50:31",
    "text": "Review by Emily Heil | The new chicken strips from McDonald’s don’t stack up favorably against options from Chick-fil-A, Popeyes and others.\n\nCheck out our full ranking here: wapo.st/4jYEVmf",
    "likes": 57,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T18:06:09",
    "text": "Moody’s Ratings downgraded the United States’ credit rating, as the country’s debt soars and interest rates remain high.\n\nThe downgrade, from the highest rating to one notch below, comes as the president’s budget bill suffered a blow in Congress.",
    "likes": 2879,
    "reposts": 825
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T17:35:15",
    "text": "Maryland Gov. Wes Moore vetoed a reparations bill that would have required the state to define the economic harms to Black descendants of enslaved people and recommend remedies, dealing a blow to reparations supporters who counted on the only Black governor of a U.S. state to be an ally.",
    "likes": 121,
    "reposts": 40
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T17:10:30",
    "text": "The FDA green-lit a blood test to detect plaques in the brain associated with Alzheimer’s disease, providing a less risky and more accessible tool to help diagnose the neurodegenerative condition.",
    "likes": 238,
    "reposts": 60
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T16:32:58",
    "text": "Breaking news: A divided Supreme Court continued to block the Trump administration’s use of a rarely invoked wartime power to deport migrants in Northern Texas and said administration officials had not given those targeted for removal last month sufficient time to challenge their deportations.",
    "likes": 199,
    "reposts": 56
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T16:00:30",
    "text": "As the first week after jury selection wraps up in the Sean “Diddy” Combs trial, The Post’s Anne Branigin takes a look at the testimony of Cassie Ventura, an ex-girlfriend of Combs.\n\nThese are the top three takeaways: wapo.st/3Fj39bN",
    "likes": 50,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T14:59:28",
    "text": "Nine inmates remain on the loose Friday afternoon after 11 escaped from a New Orleans jail in the morning, with the Orleans Parish sheriff warning that they should be considered “armed and dangerous.”",
    "likes": 35,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T13:55:32",
    "text": "The Department of Homeland Security is vetting a pitch for a reality television show in which immigrants would compete against one another for U.S. citizenship.",
    "likes": 165,
    "reposts": 75
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T12:49:18",
    "text": "For at least half a century, the National Weather Service has been an around-the-clock operation. That is no longer possible in parts of the country.",
    "likes": 928,
    "reposts": 429
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T12:07:47",
    "text": "Sean “Diddy” Combs’s federal sex-trafficking trial will end its first week of testimony Friday with more cross-examination of the prosecution’s star witness, Casandra “Cassie” Ventura.\n\nHere are three key takeaways from Ventura’s testimony so far.",
    "likes": 23,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T11:44:08",
    "text": "Two years ago, Georgia began allowing low-income adults to join Medicaid on the condition that they work or train for a job. But Georgia’s experience may actually offer reason for caution nationwide.",
    "likes": 63,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T10:55:05",
    "text": "The chief prosecutor of the International Criminal Court, currently pursuing war-crimes cases against the leaders of Israel and Russia, has abruptly stepped aside while under investigation himself amid allegations of sexual misconduct.",
    "likes": 39,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T10:14:46",
    "text": "Trump officials accused former FBI director James B. Comey of threatening President Donald Trump after Comey posted a picture of seashells on a beach arranged to spell out “86 47.” Trump is the 47th president; “86” can mean banning or removing someone, but it can also be slang for killing a person.",
    "likes": 69,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T10:07:12",
    "text": "‘American Idol’s’ last superstar, Carrie Underwood, seized her title 20 years ago and found her groove by separating her public persona from her private life. So her performance at Trump’s inauguration shocked some fans.",
    "likes": 26,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T09:40:58",
    "text": "President Donald Trump reveled in the spectacle of wealth and power over four frenzied days of deal-making in the Middle East this week. Less clear are the details of what he achieved.",
    "likes": 53,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T09:19:37",
    "text": "Populations in major American cities have bounced back from pandemic-induced drops, with New York, Houston and Los Angeles leading the way, according to new data from the U.S. Census Bureau — a recovery that experts said was fueled primarily by immigration.",
    "likes": 122,
    "reposts": 36
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T09:15:46",
    "text": "Five years since the pandemic began, millions of people are still grappling with long covid. Some trials are focusing on drugs that target the immune system, which is affected by different pathways to long covid.",
    "likes": 844,
    "reposts": 257
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T09:09:26",
    "text": "Charter Communications and Cox Communications will merge in a deal that combines two of the three biggest U.S. cable companies as their industry faces threats from cord-cutting and wireless competition.",
    "likes": 27,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T08:56:52",
    "text": "If you’ve noticed Siri listening when you didn’t ask for it, you have until July 2 to file a claim for your piece of Apple’s $95 million Siri settlement.",
    "likes": 170,
    "reposts": 60
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T08:37:03",
    "text": "After days of chaotic planning and repeated delays, Russian and Ukrainian delegations finally met Friday in Istanbul for the first direct talks in three years, amid limited expectations for progress.",
    "likes": 33,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T08:36:14",
    "text": "Some shoppers are getting surprised with new fees from online purchases, sometimes days or weeks after ordering, as tariffs on Chinese goods hit U.S. consumers.",
    "likes": 106,
    "reposts": 41
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-16T07:35:52",
    "text": "Friday's sports front: Bowing out\n\nHere's @baileyannej.bsky.social on Game 5: www.washingtonpost.com/sports/2025/...\n\nAnd @barrysvrlugawp.bsky.social on the silence, and the end: www.washingtonpost.com/sports/2025/...",
    "likes": 10,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T20:10:54",
    "text": "More than 500 Voice of America contractors will lose their jobs as the U.S.-funded news service continues its legal battle with the Trump administration.\n\n“Buckle up,” Kari Lake of the U.S. Agency for Global Media told The Post. “There’s more to come.”",
    "likes": 78,
    "reposts": 33
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T19:00:31",
    "text": "After hours of uncomfortable cross-examination Thursday, Cassie Ventura was portrayed by defense lawyers as an active participant in a turbulent but consensual relationship with Sean “Diddy” Combs marked by drug addiction and enthusiasm for freak-offs.",
    "likes": 27,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T18:14:44",
    "text": "Israeli strikes in the Gaza Strip killed more than 100 people Thursday, the enclave’s civil defense force said, as President Donald Trump sidesteps Israel on his multi-stop tour of the Middle East.",
    "likes": 128,
    "reposts": 81
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T17:48:48",
    "text": "Tracking Trump, Day 116:\n\n• Birthright citizenship case at Supreme Court\n• The cost of Trump's military parade\n• Trump's take on Russia-Ukraine peace talks\n\nPlus more to know for May 15: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 51,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T16:15:54",
    "text": "During day four of Sean “Diddy” Combs’s sex trafficking trial, his attorney, Anna Estevao, appeared to be trying to link aspects of Combs’s behavior to drug use when questioning his ex-girlfriend Cassie Ventura.\n\nRead more from the trial: wapo.st/3GSrGFn",
    "likes": 21,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T15:48:56",
    "text": "BREAKING: Kennedy Center staff announces intent to unionize. My latest: \n\nwww.washingtonpost.com/entertainmen...",
    "likes": 217,
    "reposts": 34
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T15:29:48",
    "text": "Breaking news: President Trump's June military parade in D.C. could cost $25 million to $45 million and involve dozens of war planes, hundreds of Army vehicles and thousands of soldiers sleeping in government office buildings.",
    "likes": 206,
    "reposts": 138
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T15:08:13",
    "text": "Breaking news: Staffers at the John F. Kennedy Center for the Performing Arts said that they plan to form a union in response to several waves of layoffs and what they describe as a lack of transparency from leaders at the arts institution, which President Donald Trump took over in February.",
    "likes": 526,
    "reposts": 98
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T14:59:21",
    "text": "If the Trump administration persuades the Supreme Court, it could allow the administration to begin denying automatic citizenship to the children born in 28 states and other U.S. territories.\n\nRead more about the SCOTUS birthright citizenship case:",
    "likes": 49,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T13:37:30",
    "text": "If the “Mission: Impossible” franchise is over, then it was quite a send-off for Tom Cruise, whose enthusiasm — and dedication to insane stunts — hasn’t dimmed.",
    "likes": 58,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T13:13:45",
    "text": "An early-season heat dome will bring a week of unusual heat and humidity. impacting about 50 million people across the South.\n\nWaters will warm in the Gulf of Mexico and Caribbean Sea ahead of hurricane season, which starts in just over two weeks.",
    "likes": 127,
    "reposts": 41
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T12:58:27",
    "text": "Breaking news: The Supreme Court appears divided about whether to scale back nationwide orders that have blocked President Donald Trump’s ban on birthright citizenship, in a case with implications for judicial power and what it means to be an American.",
    "likes": 61,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T12:36:28",
    "text": "Justice Department official Ed Martin, whose nomination to serve as U.S. attorney in D.C. stalled in the Senate, said that he is under investigation by an ethics office that handles attorney discipline in Washington, D.C.",
    "likes": 809,
    "reposts": 256
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T11:46:38",
    "text": "Dick’s Sporting Goods is set to acquire the footwear giant Foot Locker for $2.4 billion, the companies announced.\n\nThe merger comes as retailers across the country brace for the effects of President Trump’s tariffs on foreign goods, which are expected to hit the footwear industry especially hard.",
    "likes": 60,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T11:30:14",
    "text": "President Trump departed Washington without having outlined an overarching vision for his visit to the Middle East beyond a desire to strike business deals.\n\nBut the deals themselves appear to be the grand vision.",
    "likes": 58,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T11:13:09",
    "text": "The defense team in Sean Combs’s sex trafficking trial is suggesting that Combs's ex-girlfriend Cassie Ventura, who alleged abuse by Combs during his freak-offs, not only helped plan the sex parties but also enjoyed them.",
    "likes": 26,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T10:39:06",
    "text": "What do you really know about Medicaid? This quiz is worth taking - it's vital to understand the reverberations of what's happening, as Republicans consider how to cut a program that is the primary source of health insurance coverage for low-income populations. www.washingtonpost.com/dc-md-va/int...",
    "likes": 19,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T10:41:15",
    "text": "Maryland's new athletic director is a longtime executive in both the professional and college sports ranks.",
    "likes": 11,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T10:42:28",
    "text": "Walmart warned that price increases look certain — possibly within weeks — reinforcing that even the world’s biggest retailer is not immune from President Donald Trump’s trade war.",
    "likes": 122,
    "reposts": 43
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T10:14:33",
    "text": "Milwaukee County Judge Hannah Dugan pleaded not guilty Thursday to charges that she interfered with an immigration arrest as she argued that federal officials had no power to prosecute her.",
    "likes": 243,
    "reposts": 43
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T10:01:32",
    "text": "In its final scheduled argument of the term, the Supreme Court is considering the scope of lower-court rulings that have blocked President Donald Trump’s executive order restricting the guarantee of birthright citizenship nationwide.\n\nFollow for live updates here:",
    "likes": 39,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T09:33:27",
    "text": "Cassandra “Cassie” Ventura will return to a federal courthouse in Manhattan to testify for a third day against her former boyfriend Sean “Diddy” Combs on Thursday morning.\n\nThis time, she will face cross-examination from the Combs’s defense attorneys. \n\nFollow along for live updates here:",
    "likes": 31,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T08:44:24",
    "text": "Anthony Edwards and the sixth-seeded Timberwolves will face the Oklahoma City Thunder or Denver Nuggets for a chance to reach its first NBA Finals.\n\nAnalysis by @bengolliver.bsky.social",
    "likes": 24,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T09:07:21",
    "text": "A growing number of Democrats are publicly second-guessing their party’s handling of the last election, acknowledging that President Joe Biden’s delayed withdrawal was damaging and in some cases conceding they were too quick to dismiss questions about his age and mental acuity.",
    "likes": 68,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T08:43:44",
    "text": "Some Republican senators say they have questions about President Donald Trump’s plan to accept a $400 million jet from Qatar.\n\nHere’s what they had to say: wapo.st/43bfHdh",
    "likes": 91,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T08:15:17",
    "text": "A rare original of Magna Carta was discovered, hiding in the archives of the Harvard Law School, where it was mislabeled as a copy of the document that served as a foundational text for the Declaration of Independence, the U.S. Constitution — and international human rights law today.",
    "likes": 338,
    "reposts": 64
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T07:44:38",
    "text": "The Republican tax proposal emerging in the House of Representatives would add more than $2.5 trillion to the federal deficit over the next decade, according to nonpartisan estimates and budget experts.",
    "likes": 364,
    "reposts": 191
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-15T07:13:02",
    "text": "The Supreme Court will hold a special session Thursday morning to review a case involving President Donald Trump’s effort to ban automatic U.S. citizenship for children born to undocumented immigrants and foreign visitors. \n\nHere’s what to know about the case:",
    "likes": 75,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T21:04:37",
    "text": "Did you know that the mosquito prompted the invention of air conditioning?\n\nFor that reason, it deserves some kind of recognition. A statue, maybe? A proclamation? A museum? St. Johns County in Florida has seen fit to acknowledge the insect with all three.",
    "likes": 65,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T19:40:57",
    "text": "During her second day of testimony, Casandra “Cassie” Ventura shared the $20 million settlement amount she received in her explosive 2023 lawsuit against her former partner Sean “Diddy” Combs.",
    "likes": 57,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T18:45:37",
    "text": "The Department of Homeland Security is planning on a new Gulfstream V jet, an agency official confirmed Wednesday, after Rep. Lauren Underwood (D-Illinois) said the plane could cost up to $50 million from the U.S. Coast Guard’s budget.",
    "likes": 190,
    "reposts": 96
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T17:49:41",
    "text": "Is it true that beards are dirtier than toilets? Here’s what experts had to say about your risk of infection.",
    "likes": 30,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T14:53:57",
    "text": "I received a call from a mother whose son received a W-2 for a company he never worked for with all of his personal info, including his SSN. They claimed he made $32,000 in income. \n\nWill he be on the hook for that tax bill? Here's what I told her. www.washingtonpost.com/business/202...",
    "likes": 110,
    "reposts": 42
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T16:21:14",
    "text": "Robert F. Kennedy Jr. faced questions from lawmakers in a pair of hearings Wednesday and did not directly answer whether he would vaccinate his own children against chicken pox and polio. He paused before answering, “Probably.”",
    "likes": 3184,
    "reposts": 813
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T15:18:00",
    "text": "A 2-year-old girl who was left in the United States after both her parents were removed from the country, sparking an international custody dispute, has been returned to Venezuela, according to the child’s family and the Venezuelan government.",
    "likes": 103,
    "reposts": 36
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T14:26:32",
    "text": "Director of National Intelligence Tulsi Gabbard has fired the top two officials at the National Intelligence Council, weeks after the council wrote an assessment that contradicted President Donald Trump’s rationale for invoking the Alien Enemies Act.",
    "likes": 228,
    "reposts": 123
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T13:10:32",
    "text": "A Georgetown University researcher who was been held in a Texas immigration detention center since March, must be released from custody and returned to Virginia as he challenges the legal basis for his deportation, a federal judge ruled.",
    "likes": 1532,
    "reposts": 366
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T12:51:50",
    "text": "As the U.S. Army plans a parade in Washington to celebrate the 250th anniversary of its founding on June 14, an event billed as a protest of President Trump “and the War Machine” is being planned for the same day.",
    "likes": 154,
    "reposts": 36
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T12:29:12",
    "text": "Research into the chimpanzees of Budongo found 34 instances of the chimpanzees practicing self-care, whether it be something as simple as licking their wounds to something more complex, such as chewing up plants and putting the material on a wound.",
    "likes": 149,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T11:56:18",
    "text": "House Speaker Mike Johnson (R-Louisiana) said Wednesday he supports banning members of Congress from trading stocks, an idea that has recently picked up bipartisan support and the blessing of President Donald Trump.",
    "likes": 100,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T11:20:20",
    "text": "Breaking news: A hotline connecting air traffic controllers at Washington National Airport and their counterparts at the Pentagon had been “inoperable” since March 2022, a Federal Aviation Administration official confirmed Wednesday.",
    "likes": 864,
    "reposts": 335
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T10:37:18",
    "text": "A federal judge ordered the reinstatement of nearly 200 fired federal workers who screen coal miners for black lung, a deadly and incurable disease caused by inhaling toxic coal dust. \n\nA day later, the workers were back on the job after the Trump administration complied with the order.",
    "likes": 212,
    "reposts": 57
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T10:01:05",
    "text": "President Trump’s pullback on tariffs reflected the core tension that has bedeviled the White House: What he seeks is virtually impossible without substantial political and economic blowback, even to constituencies the administration aims to protect.",
    "likes": 68,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T09:30:35",
    "text": "Pete Buttigieg said President Joe Biden’s decision to seek a second term “maybe” hurt Democrats and that “with the benefit of hindsight, I think most people would agree that that’s the case.”",
    "likes": 131,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T08:54:35",
    "text": "Star witness Casandra “Cassie” Ventura will return to the stand in the federal criminal trial of her former boyfriend, Sean “Diddy” Combs, who faces 15 years to life in prison if convicted. \n\nFollow along for live updates here:",
    "likes": 25,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T08:24:55",
    "text": "John Ewing Jr. was elected Omaha’s first Black mayor on Tuesday, defeating the city’s three-term Republican mayor, Jean Stothert, in a race where Democrats sought to tie her to President Trump’s unpopular agenda — another warning sign for Republicans in a critical battleground area.",
    "likes": 419,
    "reposts": 84
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T07:02:34",
    "text": "New: They stormed the Capitol. Now they’re selling merch.\n\nPardoned by President Trump, many Jan. 6 rioters are now working to capitalize on the attention through podcasts, speaking tours and new lives as online influencers\n\nwww.washingtonpost.com/technology/2... @byelliesilverman.bsky.social",
    "likes": 152,
    "reposts": 75
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T08:04:37",
    "text": "President Trump met with Syria’s leader in Saudi Arabia on Wednesday, a day after he announced plans to lift punishing sanctions that have crippled the Syrian economy.\n\nTrump attended a final event in Saudi Arabia on Wednesday before traveling to Qatar on the second leg of his trip. wapo.st/4jUNLBF",
    "likes": 28,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T07:28:00",
    "text": "Robert F. Kennedy Jr. is expected to be quizzed on Capitol Hill on his handling of the measles outbreak, the firing of thousands of federal health workers and major cuts to the health agencies he oversees.",
    "likes": 6490,
    "reposts": 1375
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-14T07:00:31",
    "text": "The Environmental Protection Agency plans to rescind and reconsider limits on four different “forever chemicals” under a landmark drinking water standard implemented last year by President Joe Biden, according to documents reviewed by The Post.",
    "likes": 93,
    "reposts": 78
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T21:54:27",
    "text": "Former transportation secretary Pete Buttigieg indicated in an interview published Tuesday that he would “assess” a potential 2028 presidential run and consider “what I bring to the table and how it’s different” from other candidates. wapo.st/4jW5AQQ",
    "likes": 4688,
    "reposts": 647
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T20:59:59",
    "text": "More than 35 years after Erik and Lyle Menendez killed their parents, a Los Angeles judge resentenced them Tuesday to 50 years to life with immediate parole eligibility.\n\nA state parole board will now consider whether to recommend that they be released.",
    "likes": 90,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T20:56:47",
    "text": "Opponents of fluoridated water often say people can get fluoride in other ways if they want, such as prescription tablets  \n\nNow RFK Jr. is going after those too wapo.st/3ESPzfj",
    "likes": 173,
    "reposts": 56
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T18:54:44",
    "text": "Cassie Ventura testified that Sean ‘Diddy’ Combs coerced her into participating in days-long drug- and sex-fueled parties with male escorts, which Combs allegedly filmed and directed down to the smallest details.",
    "likes": 91,
    "reposts": 23
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T17:53:46",
    "text": "FAREWELL AND GODSPEED, PEPE\n\nAs a Marxist guerrilla, José Mujica was nearly killed in a shootout and tortured during 14 years in prison\n\nAs president, he oversaw an economic boom, a reduction in poverty and the legalization of same-sex marriage and marijuana.\n\nwww.washingtonpost.com/obituaries/2...",
    "likes": 177,
    "reposts": 44
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T18:04:12",
    "text": "Tracking Trump, Day 114:\n\n• Trump's Middle East trip begins\n• Security concerns over Qatar's airplane gift\n• RFK Jr.'s polluted swim\n\nPlus more to know for May 13: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 24,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T16:54:32",
    "text": "Major League Baseball will reinstate players after their deaths who were punished with permanent ineligibility.\n\nPete Rose, baseball’s all-time hits leader, was banned after an investigation into whether he bet on the sport while managing the Cincinnati Reds.",
    "likes": 39,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T15:07:40",
    "text": "What's in Trump and Republicans' massive tax and immigration bill?\n\nHere's a breakdown for you.\n\nI'm the econ policy geek in Congress for @washingtonpost.com. I read the whole bill (really, I did) so you don't have to. \n\nwww.washingtonpost.com/business/202...\n\nLet's thread it out.... 🧵",
    "likes": 258,
    "reposts": 132
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T14:34:07",
    "text": "Review by Emily Heil: Burgers might be the reigning kings of fast-food dining, but in recent years, chicken has been taking a big (s)wing at the throne.\n\nHere's where the chicken from each establishment ranks.",
    "likes": 33,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T14:00:20",
    "text": "At 24, Bill Belichick’s girlfriend has advocated for fishermen, given Henna tattoos and won cheer titles. \n\nHer next project: shaping the image of an icon.",
    "likes": 29,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T13:35:10",
    "text": "The Trump administration aims to authorize the sale of hundreds of thousands of artificial-intelligence chips to two government-connected firms in the Middle East, in an attempt to create a bulwark against China that helps the region become an AI powerhouse in its own right.",
    "likes": 39,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T12:50:54",
    "text": "The Episcopal Church is ending its refugee resettlement agreement with the government rather than comply with a federal directive to help resettle White South Africans arriving in the United States as refugees.",
    "likes": 415,
    "reposts": 86
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T12:44:23",
    "text": "Breaking news: President Donald Trump announced the United States will be removing all sanctions against Syria.\n\n“I will be ordering the cessation of sanctions against Syria in order to give them a chance at greatness,” Trump said.",
    "likes": 68,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T12:44:03",
    "text": "Prosecution witness Cassie Ventura detailed physical abuse, as well as the nature of “freak offs,” which she said included the hiring of an escort and “performing” under the direction of Sean “Diddy” Combs.\n\nFollow live updates here.",
    "likes": 23,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T12:13:10",
    "text": "Government watchdogs, presidential historians and other critics say the Trump Organization's business deals in the Middle East are an escalation of unethical and even unconstitutional conflicts between the interests of the United States and its president.",
    "likes": 171,
    "reposts": 65
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T11:53:00",
    "text": "The White House announced a nearly $142 billion arms deal with Saudi Arabia during President Trump's visit to the country.\n\nThe Trump administration said the deal would supply Saudi Arabia with defense equipment and services from more than a dozen U.S. companies.\n\nFollow along for live updates:",
    "likes": 29,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T11:13:43",
    "text": "Star witness Cassie Ventura is now on the stand at Sean “Diddy” Combs’s federal sex trafficking trial. Ventura, Combs's girlfriend for nearly 10 years, helped open a floodgate of accusations against him, alleging that Combs abused her and forced her to participate in humiliating sex parties.",
    "likes": 51,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T10:51:47",
    "text": "Senate Minority Leader Charles E. Schumer is set to announce that he will place holds on all political nominees to Justice Department posts until he receives “more answers” about Qatar’s potential plane gift to the Trump administration. wapo.st/43fFEIT",
    "likes": 393,
    "reposts": 73
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T10:34:07",
    "text": "The Emergency Housing Vouchers program was supposed to last through 2030, but funding will probably run out sometime next year.\n\nThe remaining funds are likely to support families for another 18 months at most, housing officials said.",
    "likes": 121,
    "reposts": 67
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T09:41:35",
    "text": "Republicans slipped into a reconciliation bill a provision that would nullify all state-level AI laws and ban any new ones for the next decade. Consumer advocates and Democrats are furious. The bill will be marked up *today.* \n\nMy newsletter: www.washingtonpost.com/politics/202...",
    "likes": 147,
    "reposts": 75
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T10:02:42",
    "text": "Day two of Sean “Diddy” Combs’s federal sex trafficking trial is underway as star witness Casandra “Cassie” Ventura is expected to take the stand Tuesday.\n\nCombs faces 15 years to life in prison if convicted on all five criminal counts. wapo.st/3YKtgiB",
    "likes": 40,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T09:41:39",
    "text": "If it becomes law, President Donald Trump and congressional Republicans’ massive bill will reshape much of the federal government — and the U.S. economy.\n\nHere’s what’s in the proposal.",
    "likes": 58,
    "reposts": 22
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T09:18:49",
    "text": "His great-grandfather enshrined birthright citizenship. His mother was jailed in WWII internment. Now, Norman Wong has become an unlikely spokesman in the fight for American citizenship, with its presumed guarantees of civil rights, free speech and due process. www.washingtonpost.com/immigration/...",
    "likes": 115,
    "reposts": 41
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T09:27:50",
    "text": "The Commanders-Dolphins game on Nov. 16 will take place at Madrid’s iconic Santiago Bernabéu Stadium",
    "likes": 29,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T09:15:36",
    "text": "Day 2 of Sean “Diddy” Combs’s sex-trafficking trial is set to begin Tuesday, with male escort Daniel Phillip, plus witness Casandra “Cassie” Ventura, taking the stand. \n\nFollow along for live updates:",
    "likes": 34,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T08:59:11",
    "text": "President Trump on Monday praised Qatar for offering his administration a free luxury jet, but current and former U.S. military, defense and Secret Service officials said he will likely have to waive existing security specifications to be able to use the plane. wapo.st/43bfHdh",
    "likes": 87,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T08:38:51",
    "text": "Breaking news: Inflation ticked up in April after an unexpected slowdown the month before, but the annual rate pace of inflation eased slightly to 2.3 percent compared to March, in a first test of Trump’s tariff policies.",
    "likes": 35,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T08:16:13",
    "text": "Kim Kardashian is expected to speak about the night in 2016 when she was gagged and bound at gunpoint in her Paris apartment and robbed of jewelry worth millions.",
    "likes": 57,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T07:55:05",
    "text": "Star forward Jayson Tatum suffered an apparent leg injury late in Game 4 of the Eastern Conference semifinals, and he is set for further evaluation Tuesday with the Boston Celtics one loss from elimination.",
    "likes": 20,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T07:37:50",
    "text": "Tuesday's sports front: Capsizing\n\nHere's @baileyannej.bsky.social on the Game 4 loss: www.washingtonpost.com/sports/2025/...\n\nAnd @barrysvrlugawp.bsky.social on a Washington team that is just trying to hang on: www.washingtonpost.com/sports/2025/...",
    "likes": 4,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-13T07:24:49",
    "text": "President Trump kicks off the first major international trip of his second term in a region where his family business has grown significantly in recent months, presenting his administration with more potential conflicts of interest than ever. wapo.st/43Bg9C3",
    "likes": 147,
    "reposts": 50
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T21:25:49",
    "text": "DNC panel finds Hogg and another official weren’t properly elected to leadership\n\nwww.washingtonpost.com/politics/202...",
    "likes": 58,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T20:59:43",
    "text": "President Trump praised Qatar for offering his administration a free luxury jet, but current and former U.S. military, defense and Secret Service officials said he will likely have to waive existing security specifications to be able to use the plane.",
    "likes": 189,
    "reposts": 52
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T18:54:00",
    "text": "The Wizards have a lot riding on tonight’s NBA draft lottery.\n\nRead @byvarunshankar.bsky.social on how they could approach each outcome, from No. 1 to No. 6:",
    "likes": 12,
    "reposts": 2
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T19:50:08",
    "text": "Breaking news: The Dallas Mavericks won the NBA draft lottery drawing in a major surprise, earning the right to select Duke forward Cooper Flagg, one of the most coveted prospects of the past decade.",
    "likes": 49,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T19:10:32",
    "text": "Hasan Piker, a popular Turkish American streamer, says he was detained by Customs and Border Protection officers and asked about his political affiliation, opinion of Trump and whether he had connections to terrorist groups upon returning to the U.S.",
    "likes": 297,
    "reposts": 92
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T18:16:37",
    "text": "Tracking Trump, Day 113:\n\n• What the U.S.-China tariff reprieve does\n• Executive order on prescription drugs\n• Concerns over Qatar's airplane gift\n\nPlus more to know for May 12: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 21,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T18:09:21",
    "text": "K-12 school districts from Missouri to Maine are adopting geothermal technology to lower energy costs, saving hundreds of thousands of dollars.\n\nBut opposition from some Republicans is placing future projects in doubt.",
    "likes": 135,
    "reposts": 48
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T16:56:37",
    "text": "Witness Daniel Phillip described for jurors how he witnessed Sean “Diddy” Combs physically assault Cassie Ventura as she screamed and got dragged into a bedroom during one of his visits.",
    "likes": 60,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T16:44:14",
    "text": "Department of Homeland Security Secretary Kristi Noem announced that the department will terminate the temporary protected status for Afghans in the United States on July 12, stating that conditions no longer meet statutory requirements.",
    "likes": 57,
    "reposts": 37
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T16:12:12",
    "text": "Breaking news: The S&P 500 closed more than 3% higher after the U.S. and China agreed to lower most tariffs for 90 days.",
    "likes": 54,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T15:13:05",
    "text": "In a letter released Monday, Harvard’s president said efforts to combat antisemitism and other bigotry and uphold academic excellence “are undermined and threatened by the federal government’s overreach into the constitutional freedoms of private universities.\"",
    "likes": 256,
    "reposts": 66
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T14:55:58",
    "text": "Mexico has ditched its judicial selection process, based on experience and exams, for popular elections – a radical exercise in democracy.\n\nNow El Chapo’s lawyer is running to be a criminal court judge in Sinaloa\n\nMary Beth Sheridan reports from Ciudad Juárez\n\nwww.washingtonpost.com/world/2025/0...",
    "likes": 34,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T14:45:06",
    "text": "President Donald Trump said he would be \"stupid\" to decline Qatar's offer of a \"free, very expensive airplane.\" \n\nWhile the deal isn't final, ethics experts say the donation would be unconstitutional.",
    "likes": 144,
    "reposts": 40
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T14:37:05",
    "text": "Edan Alexander, a 21-year-old who grew up in New Jersey, was released by Hamas on Monday after nearly 600 days in captivity.\n\nHere's are some facts about Alexander.",
    "likes": 85,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T14:21:27",
    "text": "Sen. Bernie Sanders (I-Vermont), who has long railed against Big Pharma and pushed for lower drug prices, predicted that President Donald Trump’s executive order to reduce prescription drug costs will be thrown out in court.\n\nFollow live updates on Trump:\nwww.washingtonpost.com/politics/202...",
    "likes": 94,
    "reposts": 33
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T14:16:47",
    "text": "Breaking news: A group of nearly 50 White South Africans landed as refugees Monday, coming to the U.S. under a humanitarian designation meant for people fleeing war or persecution that the Trump administration has suspended for all other groups worldwide.",
    "likes": 99,
    "reposts": 49
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T13:19:40",
    "text": "One in five Gazans are facing starvation, while the entire territory is confronted with a critical risk of famine that is projected to worsen in the coming months, the globe’s leading body on food emergencies said Monday.",
    "likes": 106,
    "reposts": 65
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T13:01:23",
    "text": "Republicans are steering clear of dramatic Medicaid cuts in their spending bill, instead opting for smaller changes backed by moderate and swing-state members who had balked at the prospect of slashing the program.",
    "likes": 50,
    "reposts": 18
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T12:43:36",
    "text": "Breaking news: Hamas released Israeli American Edan Alexander from captivity in Gaza after more than 19 months, in a gesture to the Trump administration following direct talks between U.S. and Hamas officials in recent days.",
    "likes": 48,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T10:30:44",
    "text": "The Rockies followed the Pirates’ lead and fired their scapegoat Sunday. In both cities, that’s all a manager is these days. www.washingtonpost.com/sports/2025/...",
    "likes": 25,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T12:21:43",
    "text": "In Utqiagvik, Alaska. After rising on Saturday, the sun there will shine for 84 days, 11 hours, 4 minutes without setting.\n\nMeteorologists and astronomers call the lengthy bright stretch there “polar day.”",
    "likes": 191,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T11:56:46",
    "text": "Analysis by Rick Noack, Niha Masih and Shaiq Hussain: Pakistani officials have said Saturday’s ceasefire with India reestablished deterrence. But New Delhi insists the rules of engagement have irrevocably changed.",
    "likes": 23,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T10:40:07",
    "text": "President Trump is planning Monday to revive a plan from his first term, which would peg the prices the United States pays for drugs to the amounts paid in other countries, which tend to be lower.",
    "likes": 55,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T10:12:24",
    "text": "Summer-like levels of humidity are coming to central and eastern parts of the country. \n\nFind out when they will arrive and how humid it will be in your area.",
    "likes": 34,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T09:45:03",
    "text": "As Trump pushes through punishing tariffs on some of the United States’ biggest trading partners, some small business owners fear they could be the first to suffer. \n\nThe repeated changes to policy make planning difficult and can have a chilling effect on growth, small business owners told The Post.",
    "likes": 68,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T09:13:57",
    "text": "Sean “Diddy” Combs’s sex trafficking trial starts with opening statements in a high-profile case that will not be publicly broadcast. \n\nHere are the key players.",
    "likes": 36,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T08:45:13",
    "text": "From embarking on nuclear talks with Iran to attempting hostage talks with Hamas without Israel’s knowledge,  President Donald Trump has increasingly sidelined Prime Minister Benjamin Netanyahu, stoking anxieties in a country long accustomed to being consulted by successive U.S. administrations.",
    "likes": 261,
    "reposts": 47
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T08:15:26",
    "text": "Across the federal government, Trump officials are halting a wide range of operations by declining to approve key funds.\n\nThis unofficial hold on many activities has incapacitated parts of agencies as varied as the National Park Service and the Pentagon.",
    "likes": 157,
    "reposts": 86
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T07:41:01",
    "text": "Israel is preparing to receive Israeli American hostage Edan Alexander from captivity in Gaza after Hamas said late Sunday that it would release the 21-year-old unconditionally following direct talks with the Trump administration.\n\nHis parents traveled to Israel from New Jersey.",
    "likes": 53,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-12T07:09:42",
    "text": "China and the United States have agreed to lower tariffs on goods from each other’s countries for 90 days, offering a temporary reprieve in a trade war that threatens to cause a global recession and deepen a widening rift between the world’s two largest economies.",
    "likes": 391,
    "reposts": 104
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T18:44:06",
    "text": "Hamas said Sunday it is preparing to release Edan Alexander, the last known U.S. citizen hostage held alive in the Gaza Strip, as part of an effort to secure a ceasefire with Israel and after what it said were direct contacts with the Trump administration “in the last few days.”",
    "likes": 141,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T15:40:30",
    "text": "From Chicago’s suburbs to Latin America to the frescoed halls of power in Vatican City, and finally to the very pinnacle of the Roman Catholic Church, Pope Leo XIV's ascent has occurred with remarkable speed.",
    "likes": 115,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T15:10:37",
    "text": "Guest column by Miriam Rubin: Not everyone snoozes for a full eight hours. Here’s one way to figure out how much sleep you really need.",
    "likes": 38,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T14:44:25",
    "text": "As he has done in every major appearance since being named pope, Leo XIV invoked the name of his predecessor before a massive throng of 150,000 during his first Sunday blessing in St. Peter’s Square.\n\nThen he did something notably uncharacteristic of Pope Francis.\n\nHe sang.",
    "likes": 1268,
    "reposts": 158
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T14:20:36",
    "text": "Analysis by Dan Balz: The appointment of Jeanine Pirro as interim U.S. attorney for D.C. and the dismissal of Librarian of Congress Carla Hayden encapsulate how President Trump’s personnel pledge has played out in practice.",
    "likes": 190,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T13:56:49",
    "text": "The White House claimed in a news release Sunday that the “U.S. Announces China Trade Deal in Geneva,” but it has not provided any details on an agreement.",
    "likes": 231,
    "reposts": 50
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T13:32:43",
    "text": "President Trump plans to leave Monday for a four-day trip through deep-pocketed Middle East monarchies, a sign of Trump's intention to de-emphasize the traditional U.S. allies that typically serve as the first foreign destinations for new presidents.",
    "likes": 395,
    "reposts": 126
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T13:05:17",
    "text": "Britain’s Supreme Court made its landmark ruling last month that only biological women are women. Now British institutions are trying to figure out what that means.",
    "likes": 129,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T12:43:08",
    "text": "With the nation in the grip of the deadliest measles outbreak in decades, Health and Human Services Secretary Robert F. Kennedy Jr. appeals to vaccine believers and skeptics, muddying public health instructions at a time when clarity is essential.",
    "likes": 644,
    "reposts": 227
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T12:20:23",
    "text": "Many of the unsolicited pizza deliveries have gone to judges presiding over lawsuits challenging the Trump administration’s policies.",
    "likes": 177,
    "reposts": 74
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T11:38:32",
    "text": "Violence has often flared in the region of nuclear-armed India and Pakistan since the devastation of the 1947 partition left millions displaced and at least hundreds of thousands more dead.\n\nHere’s a look at the history of the conflict.",
    "likes": 78,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T10:58:59",
    "text": "The Pennsylvania audience appeared to welcome Democratic Sen. Ruben Gallego's straight talk about how Democrats need to stop blaming Americans who voted for Donald Trump for the fallout of the president’s policies and instead focus on engaging them.",
    "likes": 122,
    "reposts": 22
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T10:32:08",
    "text": "Newark Mayor Ras Baraka was arrested and charged with trespassing after he tried to visit Delaney Hall, an immigrant detention facility in Newark.",
    "likes": 90,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-11T09:51:35",
    "text": "Amid celebrations in India and Pakistan on Saturday, and self-congratulations in Washington, Kashmir endured another night of violence, with both sides claiming violations — a grim reminder that the deal seems only to have temporarily contained the conflict rather than ended it.",
    "likes": 94,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T15:45:34",
    "text": "White House Deputy Chief of Staff Stephen Miller has indicated that the Trump administration is considering whether it can suspend habeas corpus, the right of an individual to challenge their detention in court.\n\nHere's what that means.",
    "likes": 244,
    "reposts": 105
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T15:13:06",
    "text": "At Musgrave Pencil Company in Shelbyville, Tennessee, politics rarely came up before this year. President Donald Trump’s tariff policies have changed that.",
    "likes": 62,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T12:43:15",
    "text": "White House Deputy Chief of Staff Stephen Miller indicated Friday that the Trump administration is actively considering whether it can suspend habeas corpus, the right for an individual to challenge their detention in court.",
    "likes": 161,
    "reposts": 56
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T12:31:04",
    "text": "When Grace Clements walked across the stage at her university’s commencement ceremony this week, she leaped onto the school president and gave him a giant bear hug — bringing him straight to the ground.\n\nJim Clements, the president of Clemson University, is Grace Clements’s father. wapo.st/4d9Md42",
    "likes": 3245,
    "reposts": 445
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T12:05:31",
    "text": "Local and state officials are vying to host parts of a massive artificial intelligence project called Stargate, backed by OpenAI, even as some communities turn against data center development.",
    "likes": 44,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T11:49:19",
    "text": "China produces many American summer essentials — from swimsuits and flip-flops to beach shades to grills — and this weekend’s trade talks might not avert price rises.",
    "likes": 109,
    "reposts": 27
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T11:11:55",
    "text": "The new Chicago-raised Pope Leo XIV faces an immediate challenge in his native country: taming the brawling U.S. tribe of Catholics, riven by political divisions that have thwarted the will of his predecessors.",
    "likes": 71,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-10T10:14:07",
    "text": "Breaking news: India and Pakistan have agreed to an immediate ceasefire, ending days of clashes that killed dozens of people and pushed the nuclear-armed neighbors to the brink of war.",
    "likes": 172,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T21:11:14",
    "text": "Breaking news: Pakistan armed forces said they are targeting military sites in India after India fired missiles at three air bases in Pakistan’s Punjab province early Saturday, bringing the nuclear-armed rivals closer to war.",
    "likes": 477,
    "reposts": 140
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T20:33:57",
    "text": "President Donald Trump has insisted that prices are falling, even as consumers continually express concern about the economy. \n\nHere’s what the data actually shows.",
    "likes": 178,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T18:32:28",
    "text": "Newark Mayor Ras Baraka (D) was arrested by federal officials Friday during a protest at a newly opened immigration detention facility in his city, officials said.",
    "likes": 234,
    "reposts": 81
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T18:23:59",
    "text": "Lawmakers should raise the nation’s borrowing limit by mid-July to prevent the federal government from defaulting on its bills while Congress is away for its August recess, Treasury Secretary Scott Bessent said Friday.",
    "likes": 60,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T18:02:07",
    "text": "There are 1.4 billion Catholics. Will they, especially in the developing world, in the global south — where the church is growing so quickly — embrace Leo XIV? \n\nEarly signs point to yes.",
    "likes": 166,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T17:43:53",
    "text": "Tracking Trump, Day 110:\n\n• China trade talks begin this weekend\n• Why Trump is moving detainees to Texas\n• How federal cuts are affecting DC\n\nPlus more to know for May 9: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 13,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T17:32:02",
    "text": "The former Cardinal Robert Prevost, known as “Father Bob” in Chicago, is a White Sox fan, a naturalized citizen of Peru and is fluent in five languages.\n\nHere are some facts about Pope Leo XIV that may surprise you.",
    "likes": 468,
    "reposts": 74
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T16:06:21",
    "text": "After Robert Prevost, now Pope Leo XIV, was elected pope, genealogists got to work. \n\nWhat they found surprised them.",
    "likes": 98,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T15:25:31",
    "text": "The feud between billionaires Bill Gates and Elon Musk ramped up this week, with Gates accusing Musk of “killing the world’s poorest children” through massive cuts to the U.S. Agency for International Development, one of the first targets of Musk’s U.S. DOGE Service under the Trump administration.",
    "likes": 552,
    "reposts": 130
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T14:46:28",
    "text": "A federal judge ordered the government to release Rumeysa Ozturk, a Tufts University graduate student who was grabbed off the street in late March and detained for co-writing an opinion piece in a student newspaper criticizing the war in Gaza.",
    "likes": 509,
    "reposts": 130
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T14:18:09",
    "text": "Months after the Trump administration ground U.S. refugee admissions to a halt, the program meant for people fleeing war or political persecution has restarted — but only for one group: White South Africans.",
    "likes": 162,
    "reposts": 102
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T13:01:32",
    "text": "President Donald Trump said that the United States could lower tariffs on China to 80 percent ahead of a meeting this weekend between his top aides and their counterparts from Beijing.",
    "likes": 45,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T11:43:43",
    "text": "An atmospheric river will form in the Gulf of Mexico this weekend before slamming into Florida, the Southeast and southern Appalachia. \n\nSevere thunderstorms are possible in the area, and as the storm could fuel more than a half-foot of rain through early next week.",
    "likes": 394,
    "reposts": 109
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T10:56:11",
    "text": "As the Trump administration battles to use a wartime law to speed deportations of alleged gang members, it has moved dozens of detained Venezuelans to the one court district in the country where a federal judge for now has declined to stand in its way.",
    "likes": 94,
    "reposts": 40
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T10:25:32",
    "text": "The backlash to Casey Means, President Trump’s new surgeon general nominee and an ally of Health and Human Services Secretary Robert F. Kennedy Jr., has exposed divisions in the nascent “Make America Healthy Again” movement as it gains political power.",
    "likes": 92,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T09:56:49",
    "text": "Pope Leo XIV celebrated his first Mass as leader of the Catholic Church in the Sistine Chapel, a day after he was elected the first American pontiff by the papal conclave. \n\nIn a televised homily, he called for “missionary outreach” and defending the faithful. wapo.st/4d6M8hy",
    "likes": 348,
    "reposts": 44
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T09:10:41",
    "text": "As the world goes to hell, Trump is living his best life. My latest @postopinions.bsky.social column, on how Trump and his family are pocketing hundreds of millions of dollars while he talks about rationing dolls and pencils.   Gift link. \n wapo.st/3ZcXpaj",
    "likes": 407,
    "reposts": 176
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T09:29:39",
    "text": "Breaking news: Former Supreme Court Justice David Souter, the New Englander who disappointed Republicans and delighted liberals by slowing a conservative transformation of the high court, died May 8 at his home in New Hampshire. \n\nHe was 85.",
    "likes": 101,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T09:22:46",
    "text": "Republicans worried about losing their slim House majority next year are struggling with how to achieve Medicaid savings as even more Americans rely on the program.",
    "likes": 109,
    "reposts": 26
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T08:00:49",
    "text": "Friday's sports front: Confidence men \n\nHere's @baileyannej.bsky.social on a Game 2 win: www.washingtonpost.com/sports/2025/...\n\nAnd @barrysvrlugawp.bsky.social on two-goal leads, and trying: www.washingtonpost.com/sports/2025/...",
    "likes": 12,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T08:47:30",
    "text": "In their first game without Curry since he suffered a strained left hamstring, the Warriors were steamrolled by the Timberwolves and looked lost on several fronts without their franchise player.\n\n“We all miss Steph,” Warriors forward Jimmy Butler said.",
    "likes": 32,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T08:08:14",
    "text": "President Trump said he is appointing Jeanine Pirro — a Fox News host whose misstatements about the 2020 election were cited in two defamation lawsuits against the network — as the interim U.S. attorney for the District of Columbia.",
    "likes": 124,
    "reposts": 38
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T07:40:44",
    "text": "Pope Leo XIV celebrated his first Mass as leader of the Catholic Church in the Sistine Chapel, a day after he was elected the first American pontiff by the papal conclave. \n\nFollow along for live updates:",
    "likes": 469,
    "reposts": 50
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-09T07:01:45",
    "text": "President Donald Trump on Thursday fired Carla Hayden, the Librarian of Congress — the first woman and first African American to hold the position. \n\nShe was informed of the decision in a terse, two-sentence email.",
    "likes": 231,
    "reposts": 111
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T20:30:46",
    "text": "Defense Secretary Pete Hegseth said Thursday that service members who have self-identified as having gender dysphoria will have between 30 and 60 days to leave voluntarily or be forced out.",
    "likes": 114,
    "reposts": 55
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T19:54:24",
    "text": "The election of Pope Leo XIV, the first North American pontiff, comes after the death of Pope Francis, the first Latin American pope, signals a relinquishing of papal authority from Europe.",
    "likes": 209,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T18:45:29",
    "text": "man those critics who called out altmans call for regulation in 2023 as cynical posturing to protect his lead in AI and he would change course once he got there were fuckin right on the money",
    "likes": 972,
    "reposts": 140
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T18:05:27",
    "text": "Tracking Trump, Day 109:\n\n• Higher taxes on the rich, Trump proposes\n• First American pope a \"great honor\"\n• Trade deal reached with the U.K.\n\nPlus more to know for May 8: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 23,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T18:59:18",
    "text": "Breaking news: President Donald Trump said that he will appoint Fox News host and former prosecutor Jeanine Pirro to serve as interim U.S. attorney for the District of Columbia.\n\nLive updates here.",
    "likes": 49,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T17:54:50",
    "text": "Pope Leo XIV is the first American to lead the Catholic Church, and while his positions on some of the church’s hot-button issues remain unclear, he has signaled continuity with his predecessor.\n\nHere’s what we know about the new pontiff’s views.",
    "likes": 129,
    "reposts": 18
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T17:28:50",
    "text": "Many Vatican experts thought it highly unlikely that the College of Cardinals would choose an American pope. Cardinal Robert Prevost, now Pope Leo XIV, was born in Chicago and first went to Peru as a missionary in 1985, where he mostly remained. \n\nLearn more about Pope Leo XIV here: wapo.st/4jT3d1i",
    "likes": 150,
    "reposts": 18
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T17:06:41",
    "text": "Breaking news: The Justice Department has opened a criminal investigation into real estate transactions involving New York Attorney General Letitia James — the first known criminal probe of a law enforcement official who took action against President Donald Trump.",
    "likes": 221,
    "reposts": 106
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T16:38:16",
    "text": "The Trump administration on Thursday pushed out Cameron Hamilton as the acting head of the Federal Emergency Management Agency, according to an internal email reviewed by The Post.",
    "likes": 154,
    "reposts": 57
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T16:08:54",
    "text": "President Donald Trump reacted to the selection of Pope Leo XIV saying it is a “great honor” for the U.S. shortly after the announcement was made on Thursday.\n\nFollow more updates here: wapo.st/452zHRU",
    "likes": 48,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T15:42:39",
    "text": "The fate of President Donald Trump’s tax legislation may rest on whether the GOP can find common ground on tax breaks for high earners in predominantly Democratic states — and the issue also could cost House Republicans their majority next year.",
    "likes": 72,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T15:25:14",
    "text": "President Donald Trump said Thursday that he will replace interim U.S. attorney Ed Martin, his embattled nominee to serve as the top prosecutor for D.C., after 15 tumultuous weeks in office.",
    "likes": 73,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T14:23:43",
    "text": "Leo XIV read his first address in Italian, starting with, “Peace be with you all.”\n\nRobert Prevost, an American cardinal, was elected pope Thursday, taking the name Leo XIV. He is the first American to lead the Catholic Church. wapo.st/452zHRU",
    "likes": 796,
    "reposts": 137
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T13:37:14",
    "text": "Cardinal Robert Francis Prevost, a native of Chicago who is now the first American-born pope, has spent most of his career outside of the U.S, ministering to the dispossessed and marginalized.\n\nThe “Latin Yankee,” as he is known in Rome, worked 20 years in Peru.",
    "likes": 12515,
    "reposts": 2211
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T13:30:52",
    "text": "Breaking news: Cardinal Robert Prevost was elected pope on the second day of the Vatican conclave. \n\nThe first American pope, he will be known as Leo XIV. wapo.st/452zHRU",
    "likes": 409,
    "reposts": 91
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T12:53:38",
    "text": "Next in procedure, the cardinal elected pope must formally accept the role, and then is asked to choose a name. \n\nThe pope then enters the Room of Tears, changes garments, and shows himself to the world by walking out onto the balcony of St. Peter’s Basilica.",
    "likes": 109,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T12:36:13",
    "text": "Crowds in St. Peter’s Square cheered as white smoke rose from a chimney atop the Sistine Chapel, signaling the papal conclave had chosen a new pope on Thursday. wapo.st/4jT3d1i",
    "likes": 164,
    "reposts": 39
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T12:28:17",
    "text": "Church bells rang and crowds gathered in St. Peter’s Square cheered as white smoke billowed over the Vatican on Thursday evening, announcing that the conclave had elected a new pope.\n\nThe world will learn their choice when he appears on a balcony overlooking the square. wapo.st/452zHRU",
    "likes": 155,
    "reposts": 35
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T12:21:17",
    "text": "Breaking news: Cheers erupted and suspense built in the Vatican’s St. Peter’s Square on Thursday as cardinals announced a billow of white smoke that a successor to Pope Francis had been named. \n\nThe world will learn their choice when he appears on a balcony overlooking the square.",
    "likes": 96,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T11:26:53",
    "text": "The land underneath the largest cities in the United States is sinking, according to new research. But that sinking, known as subsidence, is not happening in the same way in each place, or even the same way across one city. \n\nFind out where here:",
    "likes": 55,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T10:54:43",
    "text": "A video game glitch. A bootlegged jersey with the wrong number. The best day of someone’s life.\n\nBriefly wore the bog hat… to write about the birth of the Derek Law fan club.\n\nStory below ⬇️\nwww.washingtonpost.com/sports/2025/...",
    "likes": 42,
    "reposts": 13
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T10:41:02",
    "text": "Transportation Secretary Sean P. Duffy is expected to announce a multi-billion modernization plan, after an exodus of FAA leaders.\n\nBut Duffy will be attempting to build the new system without key career FAA leaders.",
    "likes": 89,
    "reposts": 27
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T10:09:28",
    "text": "Microsoft co-founder Bill Gates will dramatically speed up his plans to give away most of his wealth, saying he will reduce his estimated $108 billion net worth by 99 percent over 20 years and prepare his eponymous foundation to stop operating by the end of 2045.",
    "likes": 294,
    "reposts": 53
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T09:35:22",
    "text": "A 55 percent majority of D.C. residents favor using about $850 million in D.C. money to help finance development around a new facility on the RFK Stadium site. www.washingtonpost.com/sports/2025/...",
    "likes": 26,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T09:45:18",
    "text": "New: I called up Thomas Mather at University of Rhode Island, @thetickguy.bsky.social, to ask — How do you fend off ticks?\n\nSpray any shoes you're going to wear in nature (even walking shoes, golf shoes) with permethrin to ward off ticks.\n\nMore here ➡️ wapo.st/3ZabJAm (Gift link)",
    "likes": 58,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T06:55:24",
    "text": "New: Small-time Trump meme coin buyers have seen their investments collapse.\n\nNearly 67,000 crypto novices have pulled out their debit cards to bet on $TRUMP, our analysis found. So far it’s been a monumental bust.\n\nGift link: wapo.st/3ZacyZY w/ @jeremybmerrill.com",
    "likes": 396,
    "reposts": 132
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T09:46:18",
    "text": "Exclusive: Some countries have turned to Elon Musk’s SpaceX company in preparation for trade talks, State Department staffers wrote. \n\nThe U.S. has a strategic interest in countering Chinese internet providers, but Musk’s role complicates the picture.",
    "likes": 59,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T09:11:10",
    "text": "The Department of Homeland Security detained Badar Khan Suri, postdoctoral fellow at Georgetown University, alleging that his presence in the U.S. could have “adverse foreign policy consequences.”",
    "likes": 87,
    "reposts": 47
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T08:44:03",
    "text": "Trump’s pick for top federal prosecutor in D.C., Ed Martin, has a history of picking fights in public life and attacking enemies he disagreed with, a Post examination shows.\n\nNow, he lacks enough support to win Senate confirmation because of his stances on the Jan. 6, 2021, riot. wapo.st/3YwKtMj",
    "likes": 97,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T08:20:47",
    "text": "President Trump will announce a trade agreement with the United Kingdom on Thursday morning, he wrote on social media, calling it “full and comprehensive,” without providing more details.",
    "likes": 33,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T07:42:51",
    "text": "Plumes of black smoke billowed from a chimney on the rooftop of the Sistine Chapel around midday local time on Thursday (6 a.m. Eastern time), indicating that the scarlet-robed cardinals gathered inside have yet to elect a new pope after two rounds of voting on the second day of the conclave.",
    "likes": 79,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-08T07:11:00",
    "text": "Fact Checker by Glenn Kessler: Much of what Commerce Secretary Howard Lutnick, a billionaire and former Wall Street executive, says is economically incoherent and contradictory. \n\nHere’s a guide to Lutnick’s talking points  — and what’s wrong about them.",
    "likes": 230,
    "reposts": 83
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T21:10:27",
    "text": "Liesl Benecke took her two daughters — then 10 and 12 — to see “Despicable Me” when it first hit theaters in 2010. \n\nIt was life-changing.",
    "likes": 93,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T20:48:31",
    "text": "Review by Tom Sietsema: Every year around this time, I get to answer one of my favorite questions: “What’s new?”\n\nLet me share the bounty.",
    "likes": 30,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T20:07:55",
    "text": "New York city police arrested dozens of masked protesters on Columbia University’s campus Wednesday evening after they took over part of a central library while students were trying to study for final exams.",
    "likes": 82,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T19:05:34",
    "text": "In the nearly 80 sexual assault lawsuits against the embattled music producer, many of Sean Combs’s alleged victims say they were under 18, drugged or aspiring entertainers at the time of the incidents.",
    "likes": 151,
    "reposts": 52
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T18:40:07",
    "text": "Tracking Trump, Day 108:\n\n• DOGE's push to pool personal data\n• Trump on the India-Pakistan conflict\n• Border military zones sow legal confusion\n\nPlus more to know for May 7: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 39,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T18:31:36",
    "text": "Voice of America will carry programming from the right-wing TV network One America News, according to a post on X from Kari Lake on Tuesday night.",
    "likes": 70,
    "reposts": 53
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T17:45:46",
    "text": "The U.S. economy faces the risk of higher unemployment and rekindled inflation amid President Donald Trump’s chaotic trade war, the Federal Reserve said Wednesday as it left borrowing rates unchanged.",
    "likes": 139,
    "reposts": 36
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T16:56:56",
    "text": "A state jury found three former Memphis police officers not guilty of second-degree murder in the 2023 beating death of Tyre Nichols that helped galvanize a movement to reform police conduct.",
    "likes": 76,
    "reposts": 30
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T16:13:22",
    "text": "An anti-government militia group is making threats against weather equipment that it says is a “weather weapon” controlled by the military, the National Oceanic and Atmospheric Administration warned employees.",
    "likes": 304,
    "reposts": 133
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T15:05:12",
    "text": "NEW by me and @joeheim.bsky.social --Trump appoints former ‘Real Housewives’ star to Holocaust Museum board\n\n--Other appointees include a former Republican political consultant. \n\nwww.washingtonpost.com/dc-md-va/202...",
    "likes": 32,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T15:10:27",
    "text": "Scoop: We've obtained internal cables showing how the U.S. government is pushing countries facing tariffs to clear way for Musk's Starlink\n\nState Dept says it's good to encourage Starlink adoption\n\nOthers point to blurring of Musk's private/government roles ...\nwww.washingtonpost.com/business/202...",
    "likes": 561,
    "reposts": 328
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T15:06:33",
    "text": "Cardinals did not select a new pope in the first secret vote of the papal conclave Wednesday, a result indicated by billowing black smoke from the world’s most watched chimney. The proceedingss are set to continue Thursday.",
    "likes": 105,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T14:38:57",
    "text": "The swift expansion of the Trump administration’s new “national defense areas” on the southern border is sowing confusion among defendants, their lawyers and judges, one of whom called the move “unprecedented.”",
    "likes": 84,
    "reposts": 29
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T14:25:42",
    "text": "Exclusive: A series of internal government messages obtained by The Post reveal how U.S. embassies and the State Department have pushed nations to clear hurdles for U.S. satellite companies, often mentioning Starlink by name.",
    "likes": 841,
    "reposts": 495
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T14:09:01",
    "text": "An anti-government militia group is making threats against weather equipment that it says is a “weather weapon” controlled by the military, the National Oceanic and Atmospheric Administration warned employees.",
    "likes": 638,
    "reposts": 255
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T13:35:37",
    "text": "Eugene Gligor, 45, pleaded guilty Wednesday to the 2001 murder of Leslie Preer. An airport water bottle spilled the secret held for decades by Gligor, who confessed to the killing during his plea hearing in Maryland.",
    "likes": 60,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T13:19:40",
    "text": "A Republican who narrowly lost a North Carolina Supreme Court election ended his challenge to the results Wednesday, clearing the way for the Democratic incumbent to be sworn in six months after she won the race.",
    "likes": 311,
    "reposts": 43
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T12:37:31",
    "text": "Experts are warning that President Donald Trump’s proposal to slash roughly 43 percent of funding for federal housing programs, like Section 8 vouchers, could have devastating effects for millions of Americans.",
    "likes": 173,
    "reposts": 99
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T11:54:13",
    "text": "Sen. Bernie Sanders urged CBS News parent company Paramount not to settle the $20 billion lawsuit filed by President Donald Trump.\n\nIn a letter to Paramount’s lead shareholder, Shari Redstone, Sanders argued that settling would be “a grave mistake.” wapo.st/4k9pK9H",
    "likes": 372,
    "reposts": 94
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T10:54:28",
    "text": "Imagine a society where we offered our teachers the same energy we give to sports draft prospects...and the same pay.\nwww.washingtonpost.com/business/202...",
    "likes": 397,
    "reposts": 67
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T11:18:06",
    "text": "Iconic weight management brand WeightWatchers filed for bankruptcy Tuesday to shed debt while the company tries to expand its tele-health business.\n\nThe 62-year-old company has been trying to shift its business model in the face of growing competition from weight-loss drugs such as Ozempic.",
    "likes": 35,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T10:50:18",
    "text": "Former president Joe Biden gave his first sit-down interview since he left office, telling the BBC that the idea of ceding Ukrainian territory to Russia as part of a ceasefire deal amounts to “modern-day appeasement.” \n\nHere’s some of what he said: wapo.st/3Z7hw9P",
    "likes": 269,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T09:35:09",
    "text": "The Argentine government described the operation as an “extraction” @schmidtsam.bsky.social and @marialuisapaul.bsky.social report\n\nwww.washingtonpost.com/world/2025/0...",
    "likes": 19,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T10:11:54",
    "text": "In this recent column, advice columnist Carolyn Hax receives a letter from a writer who dislikes their son’s partner’s facial jewelry and wants it gone for an upcoming “fancy” family wedding.\n\nRead Hax’s response here: wapo.st/3EHylS3",
    "likes": 37,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T09:37:44",
    "text": "The U.S. DOGE Service is racing to build a centralized system with unprecedented access to data about Social Security, taxes, medical diagnoses and other private information.\n\nThe goal would create a multitude of vulnerabilities, experts say.",
    "likes": 323,
    "reposts": 216
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T09:07:03",
    "text": "Tariffs on Chinese goods are making it more expensive to raise children in the United States, driving up prices and threatening shortages of critical baby gear at a time when household budgets are already under strain.",
    "likes": 445,
    "reposts": 179
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T08:33:02",
    "text": "Golden State’s superstar guard  Stephen Curry will undergo an MRI exam Wednesday after he strained his hamstring during Game 1 of the Western Conference semifinals against the Minnesota Timberwolves.",
    "likes": 23,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T08:09:20",
    "text": "A Navy fighter jet failed to land on an aircraft carrier and plummeted into the Red Sea on Tuesday, marking the fourth major mishap involving the vessel and the third loss of a fighter jet deployed with it since the warship left home last year.",
    "likes": 4098,
    "reposts": 1443
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T07:43:14",
    "text": "The conclave to choose the next pope is set to begin Wednesday, with cardinals from around the world gathering in the Vatican to partake in the centuries-old tradition.\n\nThey will remain sequestered until the new leader of the Catholic Church is selected.\n\nFollow along for live updates:",
    "likes": 51,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-07T07:19:06",
    "text": "India and Pakistan are facing direct conflict for the first time since tensions spiked in 2019, after India on Wednesday launched strikes on Pakistan and Islamabad claimed to have downed several Indian warplanes.",
    "likes": 82,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T21:32:06",
    "text": "How human is your dog’s name? How doggy is your name?\n\nTo find out, we explored the names of 61,000 dogs available for adoption and compared them with baby names stretching back to 1880.",
    "likes": 74,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T21:19:03",
    "text": "The top Democrat on the Senate Judiciary Committee on Tuesday called on the Justice Department and FBI to investigate a series of anonymous pizza deliveries made to the homes of federal judges in recent months, saying they appeared to be part of a wave of threats against the judiciary.",
    "likes": 228,
    "reposts": 63
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T20:27:52",
    "text": "As the House Education Committee prepares for another hearing Wednesday on the issue of antisemitism — meetings that, in the past, have led Ivy League presidents to resign — the stakes have only intensified.",
    "likes": 58,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T20:11:27",
    "text": "A federal judge on Tuesday barred the Trump administration from using the Alien Enemies Act to deport Venezuelan immigrants without a hearing, saying the White House has failed to prove the existence of an “invasion” or another conflict that would justify invoking the centuries-old law.",
    "likes": 379,
    "reposts": 91
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T19:53:39",
    "text": "A coalition of 14 news organizations on Tuesday asked the federal judge overseeing the lawsuit of the Maryland resident who was mistakenly deported to El Salvador to unseal records of the proceedings surrounding efforts to return him to the United States.",
    "likes": 1479,
    "reposts": 454
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T19:38:15",
    "text": "A federal judge refused Tuesday to lift her order requiring the Trump administration to facilitate the return of a Venezuelan man whom officials deported to El Salvador nearly two months ago in violation of a legal settlement.",
    "likes": 310,
    "reposts": 83
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T19:13:22",
    "text": "📬 SCOOP: At Trump’s urging USPS board will name FedEx official as next postmaster general 📬\n\nDavid Steiner sits on FedEx’s board and was the former CEO of Waste Management. \n\nTrump forced out the old postmaster Louis DeJoy in March over feuds with DOGE.",
    "likes": 215,
    "reposts": 92
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T17:59:13",
    "text": "Tracking Trump, Day 107:\n\n• Canada's prime minister visits DC\n• Supreme Court allows transgender military ban\n• EPA plans to end its Energy Star program\n\nPlus more to know for May 6: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 34,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T19:14:17",
    "text": "President Trump and the U.S. Postal Service’s governing board are expected to name FedEx board member David Steiner as the nation’s next postmaster general, helping solidify the White House’s control over the historically independent mail service.",
    "likes": 84,
    "reposts": 58
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T17:34:58",
    "text": "The Indian military said early Tuesday that it had launched strikes against Pakistan in retaliation for last month’s militant attack in Indian-administered Kashmir, putting the nuclear armed neighbors in direct conflict for the first time in six years.",
    "likes": 63,
    "reposts": 26
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T16:49:02",
    "text": "An exhibition featuring the work of LGBTQ+ African artists at the Smithsonian National Museum of African Art has been postponed until 2026 due to “our current budgetary situation,” a spokeswoman said, amid heightened scrutiny by the Trump administration.",
    "likes": 86,
    "reposts": 39
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T16:10:42",
    "text": "Exclusive: The Trump administration earlier this year urged the Ukrainian government to accept an unspecified number of U.S. deportees who are citizens of other countries, according to documents reviewed by The Post.",
    "likes": 105,
    "reposts": 61
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T15:54:55",
    "text": "The FAA halted the work of an outside panel of experts scrutinizing its management of air traffic control, a previously unreported move made after a fatal airliner crash near Washington raised questions about the agency’s abilities to keep the skies safe.",
    "likes": 3737,
    "reposts": 1694
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T15:23:26",
    "text": "Analysis by Aaron Blake: Republicans have nominated a bunch of flawed candidates in recent years. The numbers suggest Greene could be among the worst.",
    "likes": 91,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T14:53:22",
    "text": "In the film “Conclave,” most of the process for electing a new pope was accurate, but it isn't fully accurate. \n\nHere's what “Conclave” gets right — and wrong — about papal politics.",
    "likes": 154,
    "reposts": 35
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T14:27:46",
    "text": "A divided Supreme Court on Tuesday temporarily cleared the way for President Donald Trump’s executive order barring transgender troops from the military.",
    "likes": 30,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T14:14:03",
    "text": "The top Democrat on the Senate Judiciary Committee on Tuesday called on the Justice Department and FBI to investigate a series of anonymous pizza deliveries made to the homes of federal judges in recent months.",
    "likes": 146,
    "reposts": 39
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T12:59:04",
    "text": "The Environmental Protection Agency plans to end Energy Star, a popular program whose iconic blue labels have certified the energy efficiency of home appliances for more than three decades, according to two people briefed on the matter.",
    "likes": 134,
    "reposts": 71
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T12:22:05",
    "text": "President Donald Trump's proposal ton reopen Alcatraz, which would be extraordinarily expensive and logistically challenging, drew derision from locals and tourists.",
    "likes": 132,
    "reposts": 22
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T12:13:21",
    "text": "Thousands of flights into or out of New Jersey’s main airport have been derailed, with 94 cancellations and 112 delays after 9 a.m. Tuesday and more than 2,800 delays in the past seven days, according to the flight-tracking site FlightAware\n\nHere’s what to know.",
    "likes": 514,
    "reposts": 163
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T11:38:53",
    "text": "The Trump administration has temporarily suspended an air-quality monitoring program at national parks across the country, according to an internal email obtained by The Post and two people familiar with the matter who spoke on the condition of anonymity.",
    "likes": 423,
    "reposts": 197
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T11:15:39",
    "text": "As Robert F. Kennedy Jr. strives to “Make America Healthy Again,” he’s pushing state legislation and leaning into the bully pulpit.",
    "likes": 40,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T10:39:03",
    "text": "Tim Friede allowed himself to be bitten more than 200 times by venomous snakes to build up a venom tolerance.\n\nThose bites have put scientists on the path to a breakthrough: a potential universal antivenom.",
    "likes": 129,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T10:11:22",
    "text": "Prime Minister Benjamin Netanyahu on Monday described “intensified” operations in Gaza, including a massive relocation of the Palestinian population and indefinite Israeli military “control” of large swaths of the enclave.",
    "likes": 43,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T09:40:13",
    "text": "President Donald Trump’s economic message, and that of his aides, has shifted notably in recent weeks, as they warn of sacrifice and “transition” until, by their telling, his heavy tariffs pave the way for a boom.",
    "likes": 66,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T09:22:51",
    "text": "The Trump administration has paused contracts for air-quality monitoring at national parks.\n\nAfter The Post's article was published, a Park Service spokesperson said the stop-work orders would be reversed and that “contractors will be notified immediately.”\nwww.washingtonpost.com/climate-envi...",
    "likes": 74,
    "reposts": 35
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T09:07:20",
    "text": "Negativity bias may have evolved to help us survive. But in some individuals, negativity bias can be correlated with stress, depression and anxiety.\n\nThere are ways to manage negativity bias, experts said, so that it can benefit us.\n\nHere’s how:",
    "likes": 116,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T08:42:59",
    "text": "One week after leading Canada’s Liberals to a come-from-behind victory by promising staunch resistance to President Donald Trump, Canadian Prime Minister Mark Carney will get his first chance to make good on that pledge in an Oval Office meeting Tuesday.",
    "likes": 109,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T08:12:27",
    "text": "California Gov. Gavin Newsom (D) is offering to partner with the Trump administration to create a federal film tax credit program worth at least $7.5 billion to boost domestic film production, his office said.\n\nThe proposal came after President Trump called for massive tariffs on foreign-made films.",
    "likes": 67,
    "reposts": 20
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T07:44:15",
    "text": "This year’s Met Gala dress code, “Tailored for You,” to accompany an exhibit on Black dandyism through history with the theme “Superfine: Tailoring Black Style” — made for an evening of grounded, sophisticated, downright gorgeous fashion.\n\nHere’s a recap of last night’s festivities: wapo.st/3GESadb",
    "likes": 269,
    "reposts": 33
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-06T07:15:41",
    "text": "During an interview on CNN, former vice president Mike Pence on Monday criticized President Donald Trump’s wavering support for Ukraine as well as his broad-based tariffs.\n\nHere are five highlights from Pence’s interview:",
    "likes": 188,
    "reposts": 42
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T20:39:31",
    "text": "It’s the first Monday in May, which those in the fashion world know means one thing: the Met Gala! This year, the star-studded event is celebrating the history of Black dandyism. \n\nHere are some of our favorite looks: wapo.st/44rPuJW",
    "likes": 117,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T18:05:55",
    "text": "Tracking Trump, Day 106:\n\n• $1,000 stipends to self-deport\n• How Republicans could stall Trump's agenda\n• Plans to reopen Alcatraz and tariff foreign films\n\nPlus more to know for May 5: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 34,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T15:37:17",
    "text": "The Washington Post wins two Pulitzer Prizes in breaking news reporting and illustrated reporting and commentary.\n\nPost reporters were also finalists in three categories, including national and international reporting as well as commentary. wapo.st/4mkkGkT",
    "likes": 723,
    "reposts": 94
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T14:24:27",
    "text": "The Trump administration said Monday it is offering $1,000 stipends to undocumented immigrants who “self-deport” to their home countries using a U.S. Customs and Border Protection app.",
    "likes": 38,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T13:22:14",
    "text": "The Met Gala is back.\n\nThis year’s show is inspired by Monica L. Miller’s 2009 book “Slaves to Fashion: Black Dandyism and the Styling of Black Diasporic Identity,” which looked at Black dandyism as a form of style with political depth.\n\nHere are some things to know: wapo.st/4d77Bac",
    "likes": 82,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T12:22:31",
    "text": "The gender gap has narrowed in climbing.\n\nThese women have closed it. www.washingtonpost.com/sports/olymp...",
    "likes": 53,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T12:42:10",
    "text": "Big brands are backing away from LGBTQ+ celebrations as part of a broader rollback of diversity, equity and inclusion efforts, leaving organizers from coast to coast with budget shortfalls at a time when most are anticipating higher turnout, as well as facing heightened safety challenges.",
    "likes": 98,
    "reposts": 33
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T12:12:47",
    "text": "President Donald Trump called for a 100 percent tariff on movies produced overseas in a Truth Social post Sunday night, confounding studio executives and critics about what this could mean for the heavily globalized film industry.",
    "likes": 81,
    "reposts": 12
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T11:46:34",
    "text": "A battle over academic freedom is being waged in Texas, where the legislature is poised to give the state power to screen faculty, programs and courses in one of the country’s largest public university systems, and experts say the outcome could reverberate for higher education nationwide.",
    "likes": 1145,
    "reposts": 526
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T11:12:16",
    "text": "According to lobbying disclosure forms filed with the federal government, five companies and one nonprofit Susie Wiles previously represented as a lobbyist have reported recent activity with White House staff Wiles now oversees.",
    "likes": 256,
    "reposts": 127
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T10:45:34",
    "text": "An unusual weather pattern is causing storms to stall over eastern and southern states this week. \n\nFind out where flooding and severe storms are possible, as an uncommon phenomenon known as an omega block drenches dozens of states.",
    "likes": 56,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T10:14:38",
    "text": "As Republican lawmakers hammer out a “big, beautiful bill” to enact Trump’s policy plans, they’re running into a problem: their colleagues’ growing list of red lines.\n\n“Some of these are clearly in conflict,” one former Republican aide said.",
    "likes": 133,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T09:54:19",
    "text": "Washington Post advice columnist Carolyn Hax responds to a woman whose husband uses a spreadsheet to keep track of how much money she spends on him.\n\nHere’s what Hax had to say: wapo.st/44nNfY3",
    "likes": 172,
    "reposts": 26
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T09:33:32",
    "text": "Stephen Curry’s Golden State Warriors eliminated Houston from the NBA playoffs for the fifth time in 11 seasons, this time in Game 7 of a hard-fought first-round series.",
    "likes": 127,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T07:24:37",
    "text": "New: I wrote about Emily, who has streamed her life 24/7 for three years. No sick days, no vacations, no sex - and thousands of strangers who see her as a friend. “They don’t get a break from the constant surveillance … Is it any wonder these people burn out?” www.washingtonpost.com/technology/2...",
    "likes": 256,
    "reposts": 53
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T19:32:23",
    "text": "“It’s sad both for the White House and for the president,” Cardinal Anders Arborelius, the bishop of Stockholm, told The Post. “I mean, he makes themselves ridiculous, right?”\n\n@michelleboorstein.bsky.social and Anthony Faiola report from Rome\n\nwww.washingtonpost.com/world/2025/0...",
    "likes": 114,
    "reposts": 43
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T09:05:34",
    "text": "President Donald Trump said Sunday that he has ordered several agencies to rebuild and reopen Alcatraz, an infamous federal penitentiary that closed in the 1960s and has since become a popular tourist destination.",
    "likes": 56,
    "reposts": 22
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T08:38:50",
    "text": "Decades-spanning allegations against Sean “Diddy” Combs tie back to key moments in the hip-hop mogul’s life and career.\n\nHere are the moments in Combs’s life and career that are referenced in the federal indictment and the mounting lawsuits against him.",
    "likes": 47,
    "reposts": 14
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T08:07:13",
    "text": "As Catholic cardinals prepare to choose a successor to Pope Francis, church leaders, politicians and pundits blasted President Donald Trump on Sunday for sharing an AI-generated image of himself on a throne in the cassock and miter of the pontiff. wapo.st/3YXM4e3",
    "likes": 219,
    "reposts": 47
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T07:32:09",
    "text": "Arts organizations across the country saw their grants pulled with little explanation, while a proposed federal budget sought to eliminate the arts funding agency altogether.",
    "likes": 1717,
    "reposts": 797
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-05T07:08:11",
    "text": "Washington will host the NFL draft in the spring of 2027, two people familiar with the planning said Sunday night.\n\nThe draft is expected to be held on the National Mall, according to those people, who spoke on the condition of anonymity.",
    "likes": 45,
    "reposts": 18
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T16:53:48",
    "text": "Of the small handful of papal contenders, an even smaller subset tends flocks in countries at war. Pierbattista Pizzaballa, the Latin Patriarch of Jerusalem, is among them.",
    "likes": 249,
    "reposts": 45
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T16:37:03",
    "text": "Meme coin enthusiasts acknowledge the silliness and risks of meme coins. But for a generation that can feel excluded from traditional paths to economic independence, betting on a meme coin payday can seem like a reasonable shot at the American Dream.",
    "likes": 184,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T16:27:07",
    "text": "Brazilian authorities “discreetly and precisely” targeted an online hate crime network that could have carried out an attack with explosives on a Lady Gaga concert in Rio de Janeiro on Saturday, a free event that brought, by some estimates, some 2.5 million people to Copacabana Beach.",
    "likes": 2100,
    "reposts": 339
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T15:58:41",
    "text": "A lonely young woman in Texas has streamed every second of her life for three years and counting. Is this life, or a performance of one?",
    "likes": 72,
    "reposts": 15
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T15:34:41",
    "text": "Russian communities are facing a surge in crimes from both returning veterans and criminals using the war to get out of jail. But in Vladimir Putin’s new Russia, soldiers are the new heroes, and tough wartime censorship laws leave little room to criticize them.",
    "likes": 3732,
    "reposts": 1149
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T15:13:00",
    "text": "The study did not specify what amount of cinnamon equates to overconsumption but noted that while limited consumption could have health benefits, prolonged use might raise the risk of drug interactions.",
    "likes": 147,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T14:56:24",
    "text": "Even U.S. allies locked in national security disputes with Beijing, like the Philippines, are finding it impossible to resist China’s green energy infrastructure.",
    "likes": 169,
    "reposts": 58
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T14:33:43",
    "text": "Representatives of the Derby champion are “in discussions about” whether he will compete for the second leg of the Triple Crown later this month.",
    "likes": 60,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T13:48:10",
    "text": "Justice Department lawyers defending the Trump administration’s policies are encountering mounting criticism and frustration from federal judges, a sign of deepening tension between the executive branch and courts weighing its aggressive uses of power.",
    "likes": 586,
    "reposts": 155
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T13:18:59",
    "text": "A video of a Minnesota mom appearing to hurl a racist slur at a Black child on a city playground earlier this week has been circulating widely across social media, garnering criticism from many viewers and a half-million dollars in donations from others.",
    "likes": 86,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T12:43:31",
    "text": "Karla Flores had a tumor strangling her spinal cord near the base of her skull. Doctors weighed whether they should attempt a high-risk surgery that had never been done before.",
    "likes": 430,
    "reposts": 85
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T12:11:23",
    "text": "Exclusive: Steven J. Hatfill, a virologist who pushed hydroxychloroquine as a treatment for the coronavirus despite what most researchers said was a lack of scientific evidence, has joined the second Trump administration in a senior role.",
    "likes": 168,
    "reposts": 87
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T11:20:27",
    "text": "The plans to expand operations involve seizing more territory in Gaza, which would require more ground troops, a former Israeli military official with knowledge of the plans said.",
    "likes": 63,
    "reposts": 38
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T10:01:00",
    "text": "EXCLUSIVE Israel is planning to take control of and sharply reduce aid distribution in Gaza as a condition for lifting two-month blockade. It would use private U.S. security contractors Claire Parker Karen DeYoung Gerry Shih @catebrown.bsky.social report\n\nwww.washingtonpost.com/world/2025/0...",
    "likes": 65,
    "reposts": 41
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T10:19:02",
    "text": "Sovereignty held off favorite Journalism on a wet day at Churchill Downs, with Baeza finishing third.",
    "likes": 57,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-04T09:52:40",
    "text": "President Donald Trump, asked during an interview on NBC News’s “Meet the Press with Kristen Welker,” whether he believes that he needs to uphold the Constitution during his presidency, responded, “I don’t know.”",
    "likes": 491,
    "reposts": 224
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-03T15:47:57",
    "text": "President Donald Trump’s budget proposal would eliminate the National Endowment for the Arts and the National Endowment for the Humanities.",
    "likes": 195,
    "reposts": 97
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-03T14:41:44",
    "text": "Breaking news: Legendary investor Warren Buffett said Saturday that he plans to step down from his role leading Berkshire Hathaway.\n\nWarren, 94, serves as the conglomerate’s chairman and chief executive.",
    "likes": 480,
    "reposts": 62
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-03T12:23:14",
    "text": "An uncommon atmospheric phenomenon known as an omega block will bring days of rain and thunderstorms to the Eastern Seaboard, starting on Saturday and lasting until Wednesday or Thursday.",
    "likes": 79,
    "reposts": 16
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-03T11:52:02",
    "text": "A growing number of cases — including a 2-year-old kept in U.S. custody after her mother was deported to Venezuela — reignites fears of child separation policies.",
    "likes": 265,
    "reposts": 100
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-03T11:29:45",
    "text": "Exclusive: Michael Waltz engaged in intense coordination with Israeli Prime Minister Benjamin Netanyahu about military options against Iran ahead of an Oval Office meeting between the Israeli leader and President Donald Trump.",
    "likes": 85,
    "reposts": 38
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T21:55:47",
    "text": "Two airliners abandoned landing attempts at Washington’s Reagan National Airport on Thursday afternoon when an Army Black Hawk took a “scenic route” near the flight path and circled the Pentagon before landing at a military heliport.",
    "likes": 6117,
    "reposts": 2333
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T20:30:07",
    "text": "The White House confirmed Friday that President Donald Trump intends to host a military parade this summer to commemorate the U.S. Army’s 250th birthday.",
    "likes": 75,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T18:48:54",
    "text": "The stock market rallied Friday after a stronger-than-expected jobs report eased concerns that President Donald Trump’s sweeping tariffs could tank the U.S. economy.",
    "likes": 48,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T17:57:51",
    "text": "Tracking Trump, Day 103:\n\n• White House proposes big budget cuts\n• Trump planning CIA downsizing\n• Executive order targeting PBS and NPR\n\nPlus more to know for May 2: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 34,
    "reposts": 9
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T17:38:14",
    "text": "The Trump administration is proposing major cuts to federal government spending in its 2026 budget request, which was released Friday by the White House.\n\nHere’s how the Trump administration’s budget request looks for key agencies.",
    "likes": 39,
    "reposts": 19
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T16:42:38",
    "text": "Exclusive: The Trump administration is planning significant personnel cuts at the Central Intelligence Agency and other major U.S. spy units, downsizing the government’s most sensitive national security agencies, according to people familiar with the plans.",
    "likes": 232,
    "reposts": 121
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T14:46:17",
    "text": "Attorneys at a court hearing Friday said that they’ve reached a settlement in principle for the U.S. government to pay the family of Ashli Babbitt, a Trump supporter fatally shot by police on Jan. 6, 2021, as she raised herself into the opening of a broken glass door pane inside the U.S. Capitol.",
    "likes": 50,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T13:49:31",
    "text": "College decision day — the May 1 deadline at many schools across the country — coincided with a time of head-spinning upheaval, reversals and uncertainty in the first months of the Trump administration. \n\nSome students are turning down U.S. colleges for overseas options.",
    "likes": 120,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T12:39:49",
    "text": "Elon Musk’s embrace of Trump and right-wing politics has turned off many Democrats and independents, hurting his car company and his personal brand.",
    "likes": 154,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T11:55:40",
    "text": "Reggie is a 3-foot-3 Great Dane. Pearl is a 3½-inch Chihuahua. \n\nThe two record-holding dogs met eye-to-eye.\n\nDespite the odd-looking pairing, they have a lot in common. wapo.st/44VpqH9",
    "likes": 332,
    "reposts": 31
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T11:24:25",
    "text": "Breaking news: The White House released a partial budget proposal Friday calling for $163 billion in cuts to federal spending in the next fiscal year, pushing reductions to health care, education and many other government programs while boosting spending on defense and homeland security.",
    "likes": 96,
    "reposts": 55
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T11:01:38",
    "text": "President Donald Trump said he will rename Veterans Day as “Victory Day for World War I” as a way for the country to celebrate its military victories.\n\nHowever, only Congress has the authority to create or change a federal holiday.",
    "likes": 168,
    "reposts": 40
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T10:32:19",
    "text": "Jesús Rodríguez, a Venezuelan national, was legally living in the U.S. under a humanitarian parole program that the Trump administration announced would end early. \n\nWithout a clear path to stay legally, he decided to leave the United States, separated from his wife and 6-year-old daughter.",
    "likes": 132,
    "reposts": 40
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T09:49:15",
    "text": "President Donald Trump’s mixed message about a third term makes it hard to know how much he is seriously toying with the idea, which most legal scholars say is expressly forbidden by the Constitution.",
    "likes": 88,
    "reposts": 28
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T08:59:33",
    "text": "“Mr. Rodríguez, we’re going to miss you,” a girl told the teacher after singing.\n\u2029“I’m going to miss you, too,” he said, fighting back tears of his own.\nwww.washingtonpost.com/immigration/...",
    "likes": 1933,
    "reposts": 617
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T09:16:37",
    "text": "“Monty Python and the Holy Grail” turns 50 so I decided to write about it, an exercise as misguided as Arthur’s search for the grail itself. And I still don’t know the airspeed velocity of an unladen swallow!\n\nwww.washingtonpost.com/entertainmen...",
    "likes": 89,
    "reposts": 21
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T08:56:26",
    "text": "The White House on Friday will release a partial budget proposal that calls for $163 billion in cuts to federal spending in the next fiscal year, a person familiar with the matter confirmed.",
    "likes": 149,
    "reposts": 61
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T08:33:01",
    "text": "Breaking news: The U.S. labor market slowed in April, with employers adding 177,000 jobs, a solid showing despite ongoing economic uncertainty that’s caused many employers to put hiring plans on hold.",
    "likes": 131,
    "reposts": 29
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T08:12:15",
    "text": "April was unusually warm for much of the United States. \n\nFind out if the warm conditions will continue into this month and how May temperatures are changing in your area.",
    "likes": 33,
    "reposts": 3
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T07:39:44",
    "text": "White House officials have in recent weeks brainstormed strategies for enshrining into law the government cuts implemented by Elon Musk’s U.S. DOGE Service.\n\nSo far, however, administration officials are running into resistance not just from Democrats, but also from congressional Republicans.",
    "likes": 304,
    "reposts": 91
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-02T07:04:29",
    "text": "President Donald Trump signed an executive order on Thursday evening seeking to prohibit federal funding for NPR and the Public Broadcasting Service (PBS). \n\nThe order, which could be subject to legal challenge, called the broadcasters’ news coverage “biased and partisan.”",
    "likes": 176,
    "reposts": 91
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T21:59:09",
    "text": "President Donald Trump ordered the biggest personnel shake-up of his new administration on Thursday, replacing his national security adviser, Michael Waltz, with Secretary of State Marco Rubio.",
    "likes": 119,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T19:48:50",
    "text": "Liz Oyer, the Justice Department’s recently fired pardon attorney, made a staggering claim on social media this week: President Donald Trump’s pardons of people convicted of white-collar crimes have cost Americans $1 billion.",
    "likes": 973,
    "reposts": 472
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T18:46:36",
    "text": "Analysis by Aaron Blake: For weeks, the Trump administration and its allies have decried the procession of judges who have blocked Trump’s executive actions.\n\nTheir argument suffered yet another major setback on Thursday.",
    "likes": 216,
    "reposts": 52
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T18:14:36",
    "text": "Newly ousted national security adviser Michael Waltz was photographed at a Cabinet meeting on Wednesday appearing to use a modified Signal app to conduct official business with Cabinet members and other top Trump administration officials.",
    "likes": 231,
    "reposts": 82
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T17:59:17",
    "text": "Tracking Trump, Day 102:\n\n• National security adviser ousted\n• Elon Musk reflects on DOGE\n• Republicans sidestep recession fears\n\nPlus more to know for May 1: www.washingtonpost.com/the-seven-tr...\n\n📥 Get the newsletter: www.washingtonpost.com/newsletters/...",
    "likes": 23,
    "reposts": 4
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T15:56:38",
    "text": "NEW: A sweeping new study finds three-fourths of North America's bird species are in decline\n\nScientists say it should be a wake-up call for us since some of the pressures on birds — climate change, pollution, etc. — aren't good for people, either\nwww.washingtonpost.com/climate-envi...",
    "likes": 185,
    "reposts": 121
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T15:46:21",
    "text": "The chair of Tesla’s board said Thursday she is “highly confident” in CEO Elon Musk, issuing a statement in response to a Wall Street Journal report Wednesday night that said the board began searching for a new chief executive sometime in the last month.",
    "likes": 64,
    "reposts": 11
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T15:07:54",
    "text": "Stephen Miller, one of the chief architects of Trump’s second term, highlighted a months-long effort to dismantle previous policies on diversity, equity and inclusion and transgender medical treatments.",
    "likes": 79,
    "reposts": 24
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T14:41:22",
    "text": "Breaking news: President Donald Trump announced Thursday that he was tapping his national security adviser, Michael Waltz, to be U.S. ambassador to the United Nations.",
    "likes": 39,
    "reposts": 17
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T13:52:09",
    "text": "Breaking news: A Trump-appointed federal judge ruled that the president exceeded his authority by invoking the Alien Enemies Act to summarily deport Venezuelan migrants, dealing a blow to the administration’s deportation efforts and permanently barring such removals in South Texas.",
    "likes": 471,
    "reposts": 137
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T13:18:45",
    "text": "The Senate voted Thursday to overturn an EPA rule limiting the seven most hazardous air pollutants emitted by chemical plants, oil refineries and other industrial facilities, reversing one of President Joe Biden’s major environmental regulations.",
    "likes": 169,
    "reposts": 134
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T12:52:06",
    "text": "China has signaled that it is becoming more open to engaging in trade negotiations with the Trump administration, according to two blogs closely associated with China’s state apparatus, even as Beijing maintains a defiant stance in the trade war.",
    "likes": 38,
    "reposts": 8
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T12:29:11",
    "text": "At a Tuesday night rally in Michigan, President Donald Trump bragged about his economic policies of the last three months.\n\nBy Wednesday morning, new data showed the first deceleration of the U.S. economy in three years, and analysts said the country was inching closer to a recession.",
    "likes": 126,
    "reposts": 36
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T12:01:54",
    "text": "As Elon Musk’s role begins to fade — he has said he is going to be spending much less time in Washington and more time running his companies — he reflected on what it’s been like these past 100 days.\n\nAt times, he appeared as though he couldn’t believe he’s here in the first place.",
    "likes": 42,
    "reposts": 6
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T11:29:21",
    "text": "Breaking news: President Trump plans to replace national security adviser Michael Waltz, according to a U.S. official, after Waltz mistakenly included a journalist on a Signal group chat discussing highly sensitive attack plans against Houthi militants. wapo.st/3SmhB5H",
    "likes": 133,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T10:49:48",
    "text": "Breaking news: The House voted Thursday to block California from enforcing a rule that would ban sales of new gasoline-powered cars in the state by 2035.",
    "likes": 83,
    "reposts": 32
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T10:30:41",
    "text": "Analysis by Glenn Kessler: At the 100-day mark of his second term, President Trump faces plunging polls, sagging economic numbers and skittish securities markets — mainly because of his tariff policy. So let’s see how he’s trying to spin it.",
    "likes": 96,
    "reposts": 26
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T09:59:02",
    "text": "Analysis by Emily Yahr: After his 24-year-old girlfriend interrupted 73-year-old coach Bill Belichick’s “CBS Sunday Morning” interview, an obsession of tabloids and sports media goes mainstream.",
    "likes": 52,
    "reposts": 5
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T09:28:44",
    "text": "As the legal battle continues over the fate of Kilmar Abrego García, several law enforcement officials and researchers who study the MS-13 gang say the tattoos on his left hand — a marijuana leaf, a smiley face, a cross and a skull — do not show definitive evidence of any gang affiliation.",
    "likes": 158,
    "reposts": 31
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T09:03:20",
    "text": "“Maybe Happy Ending,” “Dead Outlaw,” “Death Becomes Her,” “Operation Mincement” and “Buena Vista Social Club” will contend for best musical at the 78th Tony Awards after headlining the nominations for the 2024-25 Broadway season.\n\nHere is the full list of nominations:",
    "likes": 29,
    "reposts": 7
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T08:26:59",
    "text": "Dominate, intimidate and silence are a familiar playbook for powerful men in the music industry. \n\nThe allegations against Sean “Diddy” Combs take it to an alarming degree.",
    "likes": 100,
    "reposts": 25
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T08:01:01",
    "text": "As Musk prepares to return to his private companies in coming weeks, he and his allies are increasingly pressing for Congress to take up the mantle of their government cost-cutting. \n\nBut that effort faces an uncertain future in a largely frozen Congress.",
    "likes": 68,
    "reposts": 10
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T07:38:25",
    "text": "Former vice president Kamala Harris marked President Donald Trump’s first 100 days in office by condemning his “reckless” tariffs, “unconstitutional demands” and efforts to stoke a climate of fear to silence his dissenters. wapo.st/3RGwwrp",
    "likes": 534,
    "reposts": 130
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T07:08:04",
    "text": "Health and Human Services Secretary Robert F. Kennedy Jr. intends to change how vaccines are tested. a move that the agency said will increase transparency, but that medical experts fear could limit access to vaccines and undermine the public’s trust in immunization depending on its implementation.",
    "likes": 1051,
    "reposts": 341
  },
  {
    "username": "The Washington Post",
    "created_at": "2025-05-01T06:29:55",
    "text": "Today's sports front: Storm Warning \n\n@baileyannej.bsky.social on Game 5: www.washingtonpost.com/sports/2025/...\n\n@barrysvrlugawp.bsky.social on the long wait for a playoff series win: www.washingtonpost.com/sports/2025/...",
    "likes": 22,
    "reposts": 5
  }
]