{
  "data": {
    "videos": [
      {
        "comment_count": 40,
        "create_time": 1748908643,
        "username": "msnbc",
        "video_description": "The first two episodes of Nicolle Wallace's new chart-topping podcast, \"The Best People with Nicolle Wallace” are out NOW! Listen to the episodes, featuring Jason Bateman and Rachel Maddow, wherever you get your podcasts and at the link in our bio.",
        "id": 7511505232858189099,
        "like_count": 548,
        "region_code": "US",
        "share_count": 15,
        "view_count": 20029
      },
      {
        "id": 7511478025884667182,
        "like_count": 14690,
        "region_code": "US",
        "share_count": 471,
        "username": "msnbc",
        "view_count": 292387,
        "create_time": 1748902308,
        "video_description": "\"We fully intend to hold Mr. Soliman accountable for his actions and these charges are the first step.\" Acting U.S. Attorney for the District of Colorado J. Bishop Grewell announces Mohamed Sabry Soliman, the man suspected of launching a fire attack on a group calling for the release of Israeli hostages in Gaza, is being charged with the commission of a hate crime. He was also charged in Colorado with attempted first-degree murder. A total of 12 people were injured and ranged in age from 52 to 88.",
        "comment_count": 1701
      },
      {
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Several of the nation’s largest LGBTQ Pride celebrations are down hundreds of thousands of dollars in corporate sponsorships this year, with some event organizers saying promised funds have been withdrawn or reduced and others saying they’ve been ghosted by longtime corporate partners. Pride organizers say some companies fear being targeted by the Trump administration over participation in diversity, equity and inclusion initiatives, while others are preserving cash in a tumultuous economy. #news #politics #trump #lgbtq  #pridemonth ",
        "view_count": 450639,
        "comment_count": 2443,
        "create_time": 1748892416,
        "share_count": 911,
        "id": 7511435520665472302,
        "like_count": 34375
      },
      {
        "share_count": 86,
        "username": "msnbc",
        "view_count": 71783,
        "create_time": 1748890487,
        "like_count": 947,
        "region_code": "US",
        "comment_count": 22,
        "id": 7511427219227561259,
        "video_description": "Sicily’s Mount Etna erupted, sending smoke and ash several kilometers (miles) into the air, officials said the activity posed no danger to the population. #news  #italy  #sicily "
      },
      {
        "create_time": 1748890293,
        "username": "msnbc",
        "video_description": "NEW: A man who law enforcement officials say used a “makeshift flamethrower” to injure eight people in Boulder, Colorado, on Sunday marching for the release of Hamas-held Israeli hostages has been charged with a federal hate crime. NBC News' Morgan Chesky reports.",
        "comment_count": 119,
        "id": 7511426454006189358,
        "like_count": 990,
        "region_code": "US",
        "share_count": 44,
        "view_count": 80154
      },
      {
        "like_count": 101441,
        "share_count": 6483,
        "video_description": "NBC News exclusive: President Donald Trump’s intelligence chief is exploring ways to revamp his routine intelligence briefing in order to build his trust in the material and make it more aligned with how he likes to consume information, according to five people with direct knowledge of the discussions. One idea that’s been discussed is possibly creating a video version of the PDB that’s made to look and feel like a Fox News broadcast, four of the people with direct knowledge of the discussions said. NBC News’ Courtney Kube has the latest. #trump #intel  #gabbard #nationalsecurity #politics #government #news",
        "view_count": 2353747,
        "comment_count": 8337,
        "create_time": 1748887518,
        "id": 7511414496133598510,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "create_time": 1748887435,
        "like_count": 85980,
        "region_code": "US",
        "video_description": "Sen. Joni Ernst (R-Iowa) was repeatedly pressed at a town hall last week over House GOP cuts to Medicaid and pushed back when told the cuts would lead to deaths, saying, “We all are going to die.” The next day Ernst posted a video doubling down on her remarks — invoking Jesus and the Tooth Fairy.  On #MorningJoe, Joe Scarborough reacts to her comments: “How has she become this type of legislator? I'm just I'm at a loss.” #news #healthcare #politics #trump #jodiernst #washington ",
        "view_count": 1029292,
        "comment_count": 7298,
        "id": 7511414085305797934,
        "share_count": 7479,
        "username": "msnbc"
      },
      {
        "username": "msnbc",
        "video_description": "Eight people were injured in an attack on advocates for Israeli hostages in Boulder, Colorado. A suspect is in custody and could face murder charges despite no confirmed deaths at this time. Colorado Attorney General Phil Weiser joins Ana Cabrera to discuss the ongoing investigation. #news  #colorado ",
        "share_count": 22,
        "view_count": 37305,
        "comment_count": 151,
        "create_time": 1748881040,
        "id": 7511386628246736174,
        "like_count": 582,
        "region_code": "US"
      },
      {
        "like_count": 1896,
        "video_description": "Ukraine’s Security Service said it has struck at least 40 Russian bombers deep inside Russian territory in what would be one of the largest and most audacious attacks on Russian territory in the years long conflict. Ukraine managed to smuggle 117 aerial drones on the backs of trucks that deposited them at the perimeter of four Russian air bases — one of them deep inside Siberia some 2,500 miles from Ukraine’s borders, according to Ukrainian officials. Some military commentators and pro-Russian bloggers have called it the country’s “Pearl Harbor.” It came Sunday, a day before the latest round of direct peace talks between Ukraine and Russia on Monday. #ukraine #russia #drones #worldnews #news #zelenskyy #putin",
        "view_count": 69216,
        "comment_count": 162,
        "create_time": 1748880577,
        "id": 7511384693955202347,
        "region_code": "US",
        "share_count": 34,
        "username": "msnbc"
      },
      {
        "id": 7511378381036850475,
        "share_count": 4920,
        "comment_count": 4728,
        "create_time": 1748879113,
        "like_count": 41897,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Speaker Mike Johnson on Sunday said President Trump’s “big beautiful bill” will not add to the federal deficit despite estimates showing it will add nearly $4 trillion to the national debt. Joe Scarborough offers his thoughts on the Speaker’s claims. #news  #morningjoe  #politics ",
        "view_count": 552094
      },
      {
        "like_count": 1930,
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 1587,
        "create_time": 1748877466,
        "id": 7511371285767900462,
        "share_count": 65,
        "video_description": "Sen. Chuck Schumer (D-NY) responds to the Boulder, CO attack that left at least eight people injured on Sunday and the rise of anti-Semitism across the U.S. #news  #schumer  #colorado ",
        "view_count": 180300
      },
      {
        "comment_count": 350,
        "share_count": 105,
        "username": "msnbc",
        "create_time": 1748869387,
        "id": 7511336492934057262,
        "like_count": 1493,
        "region_code": "US",
        "video_description": "Eight people were hospitalized with burns after a man attacked a peaceful rally in Boulder, Colorado, using a makeshift flamethrower and incendiary devices. The event was held to raise awareness for Israeli hostages held in Gaza. Authorities say the suspect shouted “Free Palestine” during the assault and is now facing terrorism-related charges. One victim remains in critical condition. #news  #colorado  #morningjoe ",
        "view_count": 80143
      },
      {
        "create_time": 1748863685,
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 270,
        "id": 7511311833135910186,
        "like_count": 1199,
        "share_count": 77,
        "video_description": "The FBI is investigating the attack against advocates for Israeli hostages in Gaza as an “act of terrorism.” The suspect used a makeshift flamethrower and threw an incendiary device. He was heard to have yelled “Free Palestine” during the attack. Six victims are hospitalized. #news #msnbc ",
        "view_count": 62390
      },
      {
        "create_time": 1748835496,
        "id": 7511191048031391019,
        "like_count": 5839,
        "region_code": "US",
        "share_count": 79,
        "view_count": 163319,
        "comment_count": 191,
        "username": "msnbc",
        "video_description": "Chris Hayes breaks down the \"real cost\" of Trump's tariffs on @All In with Chris Hayes following the president floating the idea of 50% tariff hikes on the European Union, then delaying that by more than a month over the weekend. Hayes calls it another example of the Trump administration \"setting a fire, kind of putting it out.\" #trump #tariffs #europe "
      },
      {
        "id": 7511173210054905134,
        "share_count": 17,
        "video_description": "On May 30, Taylor Swift announced that she had bought back the rights to her first six albums after a long battle over her music. She acquired the masters from private equity firm Shamrock Capital. This is the first time her music is fully under her control since her former record label Big Machine sold it to Scooter Braun in 2019. “The passionate support you showed those albums and the success story you turned The Eras Tour into is why I was able to buy back my music,” Swift wrote in a letter to fans posted on her website. “I can’t thank you enough for helping to reunite me with this art that I have dedicated my life to, but have never owned until now.” #taylorswift #reputation #taylorsversion ",
        "view_count": 25599,
        "comment_count": 34,
        "create_time": 1748831330,
        "like_count": 980,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "comment_count": 82,
        "create_time": 1748830451,
        "id": 7511169439694409003,
        "region_code": "US",
        "share_count": 19,
        "video_description": "The Centers for Disease Control and Prevention will no longer recommend routine COVID-19 vaccinations for healthy children and pregnant women, Health and Human Services Secretary Robert F. Kennedy Jr. announced. MSNBC medical contributor and former White House policy director under the Obama administration, Dr. Kavita Patel, explains what this change means for healthcare providers and patients. #health #vaccine #covid ",
        "view_count": 30039,
        "like_count": 715,
        "username": "msnbc"
      },
      {
        "create_time": 1748823278,
        "id": 7511138653406645550,
        "region_code": "US",
        "share_count": 270,
        "username": "msnbc",
        "view_count": 211122,
        "comment_count": 559,
        "like_count": 4293,
        "video_description": "Secretary of Homeland Security Kristi Noem is “monitoring the terrorist attack” in Boulder, Colorado. Boulder police say people were “set on fire” at a march for Israeli hostages in Gaza. Several people are injured in this “targeted” attack. At least one person is critically injured, two senior law enforcement officials tell NBC News. #colorado #breakingnews "
      },
      {
        "create_time": 1748818631,
        "share_count": 15961,
        "view_count": 3664437,
        "comment_count": 5114,
        "like_count": 131461,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Police in Boulder, Colorado are responding to an attack at Pearl Street Mall. The attack left several victims injured, authorities said. A suspect has been taken into custody. #colorado #breakingnews ",
        "id": 7511118689232489774
      },
      {
        "like_count": 48658,
        "region_code": "US",
        "share_count": 1528,
        "username": "msnbc",
        "comment_count": 1439,
        "create_time": 1748813271,
        "view_count": 491982,
        "id": 7511095619314928938,
        "video_description": "After weeks of threatening to crack down on the Smithsonian for “divisive narratives,” Trump on Friday fired National Portrait Gallery Director Kim Sajet—his first move since signing an executive order vowing to remove “anti-American ideology” from federally funded museums. @Briefing with Jen Psaki highlights how Sajet transformed the National Portrait Gallery with her leadership, including diversifying the artwork and artists on display. #museum #dc #trump "
      },
      {
        "comment_count": 404,
        "share_count": 354,
        "video_description": "Ali Velshi says the Trump administration's move to revoke visas of Chinese students, among other recent actions of the administration, is a \"self-inflicted brain drain.\" @Velshi on MSNBC  #studentvisa #internationalstudent #trump",
        "view_count": 117652,
        "create_time": 1748804640,
        "id": 7511058542107954478,
        "like_count": 3836,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "like_count": 476,
        "share_count": 24,
        "username": "msnbc",
        "video_description": "Eugene Daniels, Elise Jordan and Jonathan Capehart of @theweekendmsnbcam try their hands at the winning word from this year's Scripps National Spelling Bee — éclaircissement. #spellingbee #scrippsnationalspellingbee ",
        "view_count": 19199,
        "comment_count": 25,
        "create_time": 1748796089,
        "id": 7511021779302010158,
        "region_code": "US"
      },
      {
        "username": "msnbc",
        "video_description": "Sen. Mark Kelly (D-AZ) reacts to the departure of Elon Musk, Tesla CEO and DOGE advisor, from the White House. \"Elon did incredible damage. It's still lasting today,\" said Sen. Kelly. Musk's departure came immediately on the heels of him expressing public disappointment with the Republican Party’s “One Big Beautiful Bill Act,” despite the president’s obsessive efforts to rally public and partisan support for the legislation. @Briefing with Jen Psaki #elonmusk #doge #trump",
        "view_count": 408206,
        "share_count": 311,
        "comment_count": 1380,
        "create_time": 1748782614,
        "id": 7510963673372953899,
        "like_count": 16276,
        "region_code": "US"
      },
      {
        "username": "msnbc",
        "video_description": "The dire wolf is back—sort of. Biotech firm Colossal Biosciences used DNA from dire wolf fossils and surrogate dogs to produce three wolf pups. But University at Buffalo biologist Vincent Lynch says the results merely recreate the animal’s outward appearance, not the species itself. Colossal CEO Ben Lamm joined The Beat to explain why they sequenced the genome—and why a real-life \"Jurassic Park\" isn’t on the horizon.  #wolf #science #direwolf ",
        "view_count": 222772,
        "id": 7510775611686817070,
        "like_count": 5952,
        "region_code": "US",
        "share_count": 285,
        "comment_count": 140,
        "create_time": 1748738749
      },
      {
        "create_time": 1748991482,
        "id": 7511861004200955179,
        "region_code": "US",
        "video_description": "Newark Mayor Ras Baraka is suing interim U.S. Attorney for New Jersey Alina Habba, alleging she violated his constitutional rights and defamed him when he was arrested at a federal immigration detention center last month. MSNBC Legal Correspondent Lisa Rubin breaks down the new legal battle brewing in Trump world and why it matters. The Department of Homeland Security and the Justice Department did not immediately respond to NBC News' requests for comment.",
        "view_count": 491488,
        "comment_count": 470,
        "like_count": 22672,
        "share_count": 586,
        "username": "msnbc"
      },
      {
        "id": 7511858057090026795,
        "like_count": 5702,
        "region_code": "US",
        "view_count": 333301,
        "comment_count": 1666,
        "create_time": 1748990785,
        "share_count": 204,
        "username": "msnbc",
        "video_description": "House Speaker Mike Johnson, R-La., said Elon Musk is “terribly wrong” about the GOP spending bill and that his X post criticizing it was “very disappointing, very surprising.” Elon Musk called the Republican bill to advance President Donald Trump’s agenda a “disgusting abomination” in his post. “But with all due respect, my friend Elon is terribly wrong about the one big, beautiful bill,” Johnson said. #elonmusk #trump #politics #news #government"
      },
      {
        "comment_count": 2051,
        "like_count": 47817,
        "region_code": "US",
        "share_count": 2108,
        "create_time": 1748986596,
        "id": 7511840065656556842,
        "username": "msnbc",
        "video_description": "Elon Musk is out of his Trump administration DOGE job and he’s not holding back. Musk hammering Trump’s “big, beautiful” spending bill writing “I just can’t stand it anymore. This massive, outrageous, pork-filled Congressional spending bill is a disgusting abomination.”  This escalation comes days after the president said goodbye to Musk, praising him in an Oval Office press conference.  #elonmusk #trump #whitehouse #doge #politics #budget #news",
        "view_count": 987937
      },
      {
        "comment_count": 5211,
        "create_time": 1748981188,
        "like_count": 100809,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "BREAKING: The family of a man accused of launching an “antisemitic attack” that injured at least 12 protesters in Boulder, Colorado will be taken into Immigration and Customs Enforcement custody, Secretary of Homeland Security Kristi Noem announced. DHS is investigating \"to what extent\" the family of suspect Mohamed Sabry Soliman, 45, \"knew about this heinous attack, if they had knowledge of it, or if they provided support to it,\" Noem wrote on X. #breakingnews  #news ",
        "id": 7511816822493023530,
        "share_count": 5922,
        "view_count": 2247592
      },
      {
        "comment_count": 755,
        "create_time": 1748976293,
        "id": 7511795828684557614,
        "region_code": "US",
        "like_count": 13998,
        "share_count": 392,
        "username": "msnbc",
        "video_description": "Sen. Joni Ernst is facing backlash after telling constituents at a town hall, “we all are going to die,” in response to concerns about Medicaid cuts — then doubling down in a follow-up video posted to social media. Pressed again on Monday, Ernst defended herself, saying she’s “very compassionate” and urging critics to “listen to the entire conversation.” Joe Scarborough reacts. #news  #morningjoe  #politics ",
        "view_count": 352862
      },
      {
        "like_count": 8522,
        "share_count": 164,
        "username": "msnbc",
        "video_description": "Newark Mayor Ras Baraka is suing interim U.S. Attorney for New Jersey Alina Habba, alleging she violated his constitutional rights and defamed him when he was arrested at a federal immigration detention center last month. #news  #politics ",
        "view_count": 400764,
        "comment_count": 490,
        "create_time": 1748975248,
        "id": 7511791297565396266,
        "region_code": "US"
      },
      {
        "video_description": "“A building seized, pointlessly, shut down, pointlessly... all so its rightful owners can eventually come back and have to put it all back together again for no reason at all.” As Elon Musk ends his tenure as a special government employee and leaves behind his DOGE department, @The Rachel Maddow Show takes a look at the tech CEO’s legacy in Washington through the lens of his illegal gutting of the U.S. Institute of Peace. #elonmusk #doge #trump #whitehouse #government #politics #news",
        "comment_count": 8718,
        "like_count": 364038,
        "region_code": "US",
        "username": "msnbc",
        "create_time": 1748971409,
        "id": 7511774797546753323,
        "share_count": 23260,
        "view_count": 3911496
      },
      {
        "view_count": 143330,
        "comment_count": 248,
        "like_count": 5700,
        "region_code": "US",
        "username": "msnbc",
        "create_time": 1748914137,
        "id": 7511528856927440171,
        "share_count": 110,
        "video_description": "@Symone Sanders Townsend of @The Weeknight on MSNBC  says Democratic members of Congress could be taking more action in fighting back against the Trump administration. \"I think a lot of Democratic elected officials across the country are waiting to meet the moment because they know that they'll be able to rise to the occasion, but you have to want it,\" Sanders Townsend said. #democrats #trump "
      },
      {
        "region_code": "US",
        "username": "msnbc",
        "view_count": 2647216,
        "id": 7511519787521084718,
        "create_time": 1748912028,
        "like_count": 298533,
        "share_count": 24538,
        "video_description": "Nicolle Wallace reacts to Sen. Joni Ernst's, R-Iowa, apology video after dismissing concerns from her constituents at a town hall that proposed Medicaid cuts in the budget bill could cause people to lose eligibility and possibly die. \"I don't know what's going on with her. I imagine she has consultants, maybe they were on vacation,\" Wallace said. #news  #politics ",
        "comment_count": 11236
      },
      {
        "region_code": "US",
        "username": "msnbc",
        "view_count": 422756,
        "comment_count": 1509,
        "create_time": 1749081203,
        "id": 7512246395701824814,
        "like_count": 28299,
        "share_count": 1018,
        "video_description": "Rep. Rosa DeLauro, D-Conn., sharply criticized Office of Management and Budget Director Russell Vought during a House Appropriations Subcommittee on Financial Services and General Government hearing. In her opening statement, DeLauro accused him of “unlawfully impounding or stealing congressionally appropriated funds.” “You envision a king unbound by laws, who rules by decree, who accepts lavish gifts from foreign governments, who fills public offices with ultra-wealthy and political allies, and who expels opposition and crushes dissent,” DeLauro said. “This view of presidential authority could not be more un-American and more dangerous to our constitutional order.” #democrats #trump"
      },
      {
        "view_count": 138725,
        "comment_count": 529,
        "create_time": 1749080670,
        "id": 7512244157260303662,
        "region_code": "US",
        "share_count": 292,
        "like_count": 5180,
        "username": "msnbc",
        "video_description": "Just days after he left his powerful position as one of President Donald Trump’s closest advisers, Elon Musk is orchestrating a pressure campaign to sink the mammoth tax and spending package that is the centerpiece of the president’s policy agenda. Ana Cabrera explores potential reasons why Musk chose to take such a public stance against the bill — and why now. #elonmusk #donaldtrump #spendingbill #politics #news "
      },
      {
        "comment_count": 7676,
        "id": 7512228936739310894,
        "like_count": 170497,
        "region_code": "US",
        "video_description": "\"If you attack Donald Trump and Donald Trump says nothing, Donald Trump's silence is the biggest expression of fear that he has.\" Lawrence O'Donnell analyzes Elon Musk humiliating President Trump on the “big, beautiful bill” right after leaving the administration. #trump #musk #politics #news ",
        "create_time": 1749077143,
        "share_count": 10542,
        "username": "msnbc",
        "view_count": 2438188
      },
      {
        "like_count": 2148,
        "region_code": "US",
        "share_count": 27,
        "username": "msnbc",
        "view_count": 75005,
        "comment_count": 143,
        "create_time": 1749076511,
        "id": 7512226269073820974,
        "video_description": "Nicolle Wallace reports on how President Trump’s ambitious plan to broker dozens of trade deals with some of the United States’ closest trading partners has begun to show cracks as the clock on his 90-day pause for most country-specific tariffs winds down to just over one month. \"The stakes don't get much higher than this, especially when you consider what Trump's allies are preparing to do to millions of Americans right here at home, that big — whatever we want to call it — not-so-beautiful bill,\" Wallace says. #trump #trade #china "
      },
      {
        "username": "msnbc",
        "video_description": "President Trump doubled steel and aluminum tariffs to 50%. Greg Colibert, owner of Steel Products Manufacturing in Salt Lake City, joins @Katy Tur to share his concerns on the new tariffs and how it will impact his business. #tariffs  #steel  #aluminum #economy ",
        "view_count": 642121,
        "comment_count": 1139,
        "like_count": 18233,
        "region_code": "US",
        "create_time": 1749073590,
        "id": 7512213427268455723,
        "share_count": 278
      },
      {
        "create_time": 1749073270,
        "id": 7512212325248978222,
        "like_count": 64066,
        "video_description": "The Trump administration said that it has notified the accreditor for Columbia University that the school violated Title VI, threatening the university's accreditation status by saying it \"no longer appears to meet the Commissions accreditation standards.\" The U.S. Department of Education's Office for Civil Rights (OCR) and the Department of Health and Human Services' Office for Civil Rights (HHS OCR) \"determined that Columbia University acted with deliberate indifference towards the harassment of Jewish students, thereby violating Title VI of the Civil Rights Act of 1964,\" according to press release from the Education Department. #trump #columbia #columbiauniversity ",
        "comment_count": 1536,
        "region_code": "US",
        "share_count": 4373,
        "username": "msnbc",
        "view_count": 762473
      },
      {
        "comment_count": 449,
        "id": 7512193738219851054,
        "like_count": 24381,
        "region_code": "US",
        "share_count": 519,
        "create_time": 1749068937,
        "username": "msnbc",
        "video_description": "Antoine Massey — one of the fugitives from the Louisiana jailbreak — appeared to post a video to social media with a message to his followers. Authorities have not verified the authenticity of the post, but his mother and pastor confirm to NBC News that it is Massey on camera. NBC News’ Priya Sridhar has the story. #news  #louisiana ",
        "view_count": 341006
      },
      {
        "like_count": 24841,
        "username": "msnbc",
        "video_description": "President Trump posted on social media that he had a call with Russian President Vladimir Putin and that the two of them discussed the ongoing war with Ukraine and Iran's nuclear program. NBC News' Yamiche Alcindor reports. #MSNBC #news #politics #Trump #Putin #Ukraine #Russia ",
        "view_count": 1798765,
        "comment_count": 1683,
        "create_time": 1749062366,
        "share_count": 1176,
        "id": 7512165408657673518,
        "region_code": "US"
      },
      {
        "view_count": 125794,
        "comment_count": 160,
        "region_code": "US",
        "share_count": 95,
        "video_description": "Rep. Marjorie Taylor Greene, R-Ga., is reversing her support for the Trump-backed domestic policy bill after admitting she missed a key provision that would bar states from regulating artificial intelligence for the next 10 years. In a social media post, Greene said she would oppose the final version unless the Senate removes the AI language. Willie Geist and Jonathan Lemire respond on #MorningJoe: “The jokes write themselves.” #news  #trump  #politics  #washington ",
        "create_time": 1749061148,
        "id": 7512160260472261931,
        "like_count": 3509,
        "username": "msnbc"
      },
      {
        "id": 7512152812323622186,
        "share_count": 18951,
        "username": "msnbc",
        "video_description": "As the country prepares for the next hurricane season, Miami meteorologist John Morales issued a warning about how federal budget cuts at the National Weather Service and National Oceanic and Atmospheric Administration will impact meteorologists’ ability to predict and track threats. “Because of the gutting, the sledgehammer attack on science,” Morales says. #news  #hurricane #weather  #florida  #trump ",
        "view_count": 1725459,
        "comment_count": 4584,
        "create_time": 1749059416,
        "like_count": 190176,
        "region_code": "US"
      },
      {
        "comment_count": 2183,
        "create_time": 1749056510,
        "id": 7512140299225845034,
        "like_count": 27572,
        "region_code": "US",
        "video_description": "White House Deputy Chief of Staff Stephen Miller threatened to fire senior Immigration and Customs Enforcement officials in May if they did not begin detaining 3,000 migrants a day, according to two sources who spoke to attendees. Weeks later, ICE is launching the Trump administration’s largest immigration crackdown. In exclusive NBC News reporting, Julia Ainsley details “Operation At Large,” a nationwide, ICE-led plan already underway to ramp up arrests of unauthorized immigrants. #MSNBC #news #politics #ICE #Trump ",
        "share_count": 2860,
        "username": "msnbc",
        "view_count": 408538
      },
      {
        "id": 7512134401329810731,
        "like_count": 13188,
        "share_count": 380,
        "username": "msnbc",
        "video_description": "BREAKING: The sweeping Republican bill for President Donald Trump's domestic agenda is projected to add $2.4 trillion to the national debt over the next 10 years, according to a new estimate from the nonpartisan Congressional Budget Office. The figure is slightly higher than an earlier version of the bill, which the CBO projected to add $2.3 trillion in new debt. #breakingnews  #news  #trump  #politics  #washington ",
        "comment_count": 974,
        "create_time": 1749055130,
        "region_code": "US",
        "view_count": 445979
      },
      {
        "create_time": 1749054279,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "@Briefing with Jen Psaki reacts to Secretary of Education Linda McMahon’s hearing where basic math was put to the test. The math blunder was part of McMahon’s testimony about President Donald Trump’s 2026 budget proposal, which includes sweeping cuts to the Department of Education – drastically impacting education grants such as TRIO or GEAR UP. #news  #politics  #education ",
        "comment_count": 20636,
        "id": 7512130644688899371,
        "like_count": 686970,
        "share_count": 74407,
        "view_count": 6570119
      },
      {
        "share_count": 47687,
        "video_description": "The Trump administration announced on Tuesday that it had revoked a Biden administration requirement that hospitals provide emergency abortions to women whose health is in peril, including in states where abortion is restricted or banned, the New York Times reports. Mika Brzezinski and Claire McCaskill react to the news, warning of the potential life-threatening consequences: “Women don’t go to emergency rooms to get elective abortions… They will bleed out in parking lots because of this letter.” #MSNBC #news #Trump #morningjoe #politics #Biden ",
        "view_count": 4123727,
        "create_time": 1749053140,
        "id": 7512125825861586222,
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 11009,
        "like_count": 493286
      },
      {
        "like_count": 1193877,
        "share_count": 69156,
        "video_description": "Residents of a San Diego neighborhood protested on Friday after Immigrations and Customs Enforcement officials raided a popular Italian restaurant, leaving the ICE agents \"flummoxed,\" @The Rachel Maddow Show reports. \"This is not a sign of strength. This is not a show of force. This is a show of weakness and cluelessness,\" Maddow says. #MSNBC #news #ICE ",
        "view_count": 12097056,
        "comment_count": 30553,
        "create_time": 1749051113,
        "id": 7512117115969899822,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "region_code": "US",
        "view_count": 1346684,
        "like_count": 37343,
        "share_count": 2725,
        "username": "msnbc",
        "video_description": "Steve Rattner breaks down why Elon Musk’s budget cuts fell far short of promises — and the real-world consequences. “The President had talked during the campaign about cutting $2 trillion… the final number is probably less than $150 billion. And by the way, yes, people are dying because of that.” #politics  #elonmusk  #musk  #tax  #morningjoe ",
        "comment_count": 4164,
        "create_time": 1749047916,
        "id": 7512103268395404587
      },
      {
        "region_code": "US",
        "share_count": 44213,
        "video_description": "\"The alliance between the world's richest man and the world's most powerful Donald Trump is imploding right now in real time before our very eyes.\" Nicolle Wallace explains the feud between President Donald Trump and Elon Musk and why she says it affirms \"our deepest concerns and suspicions.\" Musk’s tweet on “the Epstein files” is part of a recent and broader dispute. Trump has denied any involvement and Musk offered no evidence to back up his claim. The White House responded saying “This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill because it does not include the policies he wanted.\"  #donaldtrump #elonmusk #doge #fued #politics #news ",
        "create_time": 1749164883,
        "like_count": 372986,
        "username": "msnbc",
        "view_count": 5161273,
        "comment_count": 12871,
        "id": 7512605769431469358
      },
      {
        "id": 7512591242384166190,
        "region_code": "US",
        "share_count": 605,
        "username": "msnbc",
        "comment_count": 790,
        "create_time": 1749161469,
        "view_count": 286288,
        "like_count": 19085,
        "video_description": "Rachel Maddow joins Nicolle Wallace on “The Best People” podcast and reveals what’s “very moving” and emotional in Trump’s second term and why she’s heartened, engaged and energized now more than ever. You can watch full episode on YouTube now.  Link in bio. #trump #maddow #thebestpeople "
      },
      {
        "create_time": 1749148947,
        "like_count": 166871,
        "region_code": "US",
        "share_count": 22341,
        "comment_count": 10085,
        "username": "msnbc",
        "video_description": "BREAKING: After President Donald Trump told reporters, in the Oval Office during a bilateral meeting with German Chancellor Friedrick Merz, “I’m very disappointed because Elon knew the inner workings of this bill,” Elon Musk fired back on X, claiming that Trump \"would have lost the election\" without his help. #breakingnews  #news  #trump  #elonmusk  #musk  #politics  #washington ",
        "view_count": 2628000,
        "id": 7512537463441657131
      },
      {
        "share_count": 27433,
        "username": "msnbc",
        "video_description": "President Trump breaks his silence on former DOGE advisor Elon Musk’s outspoken opposition to the Trump-backed GOP spending bill. Earlier this week, Musk posted on X calling the bill “pork-filled” and an “abomination.” Before today, the president has stayed silent on Musk’s opinions of the bill, but today expressed his disappointment saying, “People leave my administration and they love us... And some of them actually become hostile. I don’t know what it is. It’s sort of Trump derangement syndrome, I guess they call it.” #trump #elon #doge #whitehouse #government #news #politics",
        "view_count": 5570475,
        "create_time": 1749147464,
        "region_code": "US",
        "like_count": 168624,
        "comment_count": 11240,
        "id": 7512531077383261486
      },
      {
        "create_time": 1749144330,
        "share_count": 1497,
        "video_description": "Sen. John Kennedy joined Morning Joe to defend the GOP’s sweeping economic bill, calling concerns about rising debt “valid” but warning that without extending Trump-era tax cuts, the U.S. economy could be on a “journey to the center of the earth.” Kennedy said the country is in “uncharted waters” on tariffs and debt and cautioned that without action, Americans risk becoming “debt slaves.” #MSNBC #news #MorningJoe #GOP #Trump ",
        "comment_count": 7291,
        "id": 7512517632189484334,
        "like_count": 36824,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 1146612
      },
      {
        "view_count": 527147,
        "share_count": 451,
        "username": "msnbc",
        "video_description": "President Trump was asked about his recently announced travel ban on foreign nationals from a dozen countries and the cancellation of visa programs for seven more as he met with German Chancellor Friedrich Merz in the Oval Office. #MSNBC #news #Trump #politics ",
        "like_count": 7407,
        "region_code": "US",
        "comment_count": 727,
        "create_time": 1749143695,
        "id": 7512514913294683435
      },
      {
        "region_code": "US",
        "username": "msnbc",
        "video_description": "After Trump’s call with Vladimir Putin on Wednesday, Thomas Friedman criticized the former president’s response as lacking leverage and urgency: “Vladimir Putin wants victory. Zelenskyy wants to preserve his country, and until we understand that the war won't end. Until Putin is dissuaded from the prospect of any kind of victory, we're going to be spinning our wheels, and it's going to get more dangerous .” #MSNBC #news #politics #Trump #Putin #Ukraine #Russia ",
        "comment_count": 129,
        "create_time": 1749143189,
        "like_count": 1386,
        "id": 7512512725742947630,
        "share_count": 76,
        "view_count": 78251
      },
      {
        "like_count": 25898,
        "region_code": "US",
        "view_count": 1772904,
        "comment_count": 1918,
        "create_time": 1749138754,
        "username": "msnbc",
        "video_description": "President Donald Trump and Chinese President Xi Jinping held a phone call amid ongoing tensions between the two superpowers — with a new in-person meeting planned soon. In a Truth Social post, Trump said the call lasted about 90 minutes, but provided few details about it other than that it focused on trade. He said a meeting will now be held \"shortly\" between representatives from the two nations at a location to be determined. It’s the first known call between the two leaders in Trump’s second term, though the two spoke in January before Trump’s inauguration. #news  #trump  #breakingnews  #china ",
        "id": 7512493680553594158,
        "share_count": 1129
      },
      {
        "id": 7512484066961132843,
        "like_count": 10841,
        "username": "msnbc",
        "video_description": "BREAKING: In a unanimous decision, the Supreme Court revived a woman’s claim that she was discriminated against at work because she is straight. The unanimous ruling could make it easier in some parts of the country for people belonging to majority groups to bring such “reverse discrimination” claims. It overturns precedent in some lower courts that says someone from a majority group has to meet a higher bar than someone from a minority group for a case to move forward. Marlean Ames sued the Ohio Department of Youth Services under Title VII of the Civil Rights Act, which prohibits sex discrimination in the workplace, after a lesbian woman obtained a promotion she had applied for. She was later demoted, and her old position was taken by a gay man. #news #politics #supremecourt #scotus ",
        "comment_count": 850,
        "create_time": 1749136513,
        "view_count": 300001,
        "region_code": "US",
        "share_count": 675
      },
      {
        "like_count": 4517,
        "share_count": 191,
        "view_count": 138044,
        "comment_count": 876,
        "create_time": 1749135783,
        "username": "msnbc",
        "video_description": "BREAKING: The Supreme Court has unanimously sided with the firearms industry in ruling that Mexico’s novel lawsuit didn’t plausibly allege that gun companies had aided and abetted unlawful sales routing guns to Mexican drug cartels. #MSNBC #breaking #news #SCOTUS #supremecourt #breakingnews ",
        "id": 7512480920185031982,
        "region_code": "US"
      },
      {
        "comment_count": 45,
        "id": 7512468887322053930,
        "video_description": "President Trump’s proposed spending bill would cut taxes, slash spending, and drive up the deficit by $2.4 trillion while leaving nearly 11 million more people uninsured, according to the AP.  On Morning Joe, Joe Scarborough called it a “game changer” for Democrats and blasted House Republicans: “You’re adding trillions to the debt because you’re deciding you don’t want to do your job.” #MorningJoe  #news  #trump ",
        "view_count": 49975,
        "create_time": 1749132984,
        "like_count": 1176,
        "region_code": "US",
        "share_count": 26,
        "username": "msnbc"
      },
      {
        "share_count": 87,
        "username": "msnbc",
        "video_description": "GOP in a panic over Musk's split from Trump over spending bill Elon Musk, a major Republican donor in the 2024 election, has turned on the GOP—calling for the firing of every politician who supported the sweeping Republican bill backing Donald Trump’s agenda. Ari Melber breaks down the feud—and the pop culture references lighting up social media in its wake. #trump #elonmusk #news #socialmedia #gop #congress ",
        "comment_count": 113,
        "like_count": 1751,
        "region_code": "US",
        "create_time": 1749129732,
        "id": 7512454925675220270,
        "view_count": 39087
      },
      {
        "create_time": 1749125942,
        "like_count": 7291,
        "region_code": "US",
        "comment_count": 439,
        "id": 7512438653860187438,
        "share_count": 428,
        "username": "msnbc",
        "video_description": "Recent moves by the Trump administration are creating concerns about the reliability of official economic statistics.  @11th Hour MSNBC’s @Stephanie Ruhle breaks down why that's a problem for every American. #trump #news #economy #data #stocks ",
        "view_count": 144785
      },
      {
        "id": 7512280494973685034,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "President Donald Trump signed a proclamation that bans nationals from a dozen countries, including Afghanistan, Haiti and the Republic of Congo, from entering the United States, framing the travel ban as necessary to fortify national security and building upon one of the most contentious policies of his first term. Trump banned nationals from 12 countries from entering the United States: Afghanistan, Burma, Chad, Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. An additional seven countries came under partial travel restrictions, in which entrance into the country under several visa programs was suspended but an outright ban was not implemented: Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela. #travel #breakingnews #trump #politics ",
        "comment_count": 24301,
        "like_count": 1713918,
        "share_count": 159112,
        "view_count": 21351804,
        "create_time": 1749089130
      },
      {
        "share_count": 2210,
        "username": "msnbc",
        "video_description": "WATCH: Republican lawmakers react to Elon Musk slamming the Trump-backed megabill. Musk called it a \"disgusting abomination\" just days after a White House send-off. #elonmusk #republicans  #news ",
        "view_count": 2231808,
        "region_code": "US",
        "create_time": 1749087807,
        "id": 7512274745136663850,
        "like_count": 64684,
        "comment_count": 4478
      },
      {
        "id": 7512274020973284651,
        "view_count": 920187,
        "create_time": 1749087635,
        "like_count": 96401,
        "region_code": "US",
        "share_count": 2830,
        "username": "msnbc",
        "video_description": "A Navy vessel named after celebrated gay rights activist and Navy veteran Harvey Milk will no longer carry his name. Milk was the first openly gay politician in California and went on to become a celebrated civil rights pioneer in San Francisco. @Chris Hayes reports on this recent move from Defense Secretary Pete Hegseth and its timing during Pride Month on @All In with Chris Hayes. #harveymilk #hegseth #trump #pride #pridemonth",
        "comment_count": 1681
      },
      {
        "comment_count": 2509,
        "like_count": 102842,
        "share_count": 5112,
        "create_time": 1749084859,
        "id": 7512262117081353515,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "BREAKING: A Guatemalan man who was deported by the Trump administration and then was ordered to be returned by a judge because of due process concerns is back in the United States, his attorney said.  #immigration #trump #news ",
        "view_count": 1763382
      },
      {
        "comment_count": 2326,
        "like_count": 25448,
        "view_count": 546905,
        "share_count": 628,
        "username": "msnbc",
        "video_description": "Ari Melber explains Kilmar Abrego Garcia's return to the U.S. to face face federal criminal charges — and why he says this return goes against \"what some Trump officials brazenly threatened would not happen.\" #trump #politics #maryland ",
        "create_time": 1749253734,
        "id": 7512987437501664558,
        "region_code": "US"
      },
      {
        "comment_count": 409,
        "create_time": 1749250473,
        "id": 7512973365993524526,
        "like_count": 11816,
        "region_code": "US",
        "username": "msnbc",
        "share_count": 104,
        "video_description": "“This is a moment in American history when you’re seeing the most powerful man, the leader in many ways of the free world, Donald Trump, go head to head with the richest man in the world…two people absent any empathy or humility.” MSNBC’s Alex Wagner joins @Chris Hayes on @All In with Chris Hayes to discuss the escalating feud between Elon Musk and President Donald Trump this week. #trump #elonmusk #politics #news ",
        "view_count": 267292
      },
      {
        "comment_count": 1187,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 238118,
        "video_description": "The Supreme Court has granted the Trump administration’s urgent bid for Department of Government Efficiency personnel to access sensitive Social Security data. Nicolle Wallace reports. #scotus #doge #elonmusk ",
        "create_time": 1749249542,
        "id": 7512969520487648555,
        "like_count": 12403,
        "share_count": 881
      },
      {
        "video_description": "MSNBC political analyst @Molly Jong-Fast breaks down the IMPACT of President Trump and Elon Musk's falling out and what it could mean for the government and the Republican party. #trump #elonmusk #government #politics #news ",
        "comment_count": 119,
        "create_time": 1749243559,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 104282,
        "id": 7512943669658455342,
        "like_count": 2478,
        "share_count": 97
      },
      {
        "region_code": "US",
        "share_count": 92,
        "video_description": "Tensions between Donald Trump and Elon Musk burst into the open Thursday, with personal insults and political fallout playing out across social media.  On #MorningJoe, Jonathan Lemire called the rupture “seismic,” while @Ali Vitali warned the public feud could impact real lives: “These are two very powerful people… and a lot of people's lives are at stake here from a government policy perspective.” #trump #elonmusk #news #politics #aliontooearly ",
        "username": "msnbc",
        "view_count": 228735,
        "comment_count": 310,
        "create_time": 1749229203,
        "id": 7512881986919353643,
        "like_count": 7913
      },
      {
        "comment_count": 100,
        "id": 7512868955183418670,
        "share_count": 25,
        "view_count": 98524,
        "create_time": 1749226168,
        "like_count": 4357,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "After, Elon Musk and President Trump’s feud exploded publicly yesterday over Trump’s “big, beautiful bill”, Americans are reacting to the most powerful man in the world and the richest man in the world taking to social media to snap back at each other. #elonmusk #trump #news #politics #washington "
      },
      {
        "region_code": "US",
        "share_count": 1364,
        "username": "msnbc",
        "video_description": "A Russian missile and drone attack on Kyiv killed at least four people and injured 20 others, city mayor Vitali Klitschko said. It was part of a wider overnight assault that became the latest in a series of large-scale attacks targeting regions across Ukraine. NBC News' Chief International Correspondent Keir Simmons has the latest. #news  #russia  #ukraine ",
        "comment_count": 3377,
        "create_time": 1749224755,
        "id": 7512862898096590126,
        "like_count": 38537,
        "view_count": 901042
      },
      {
        "comment_count": 1578,
        "id": 7512850811500875054,
        "region_code": "US",
        "share_count": 289,
        "view_count": 794075,
        "create_time": 1749221947,
        "like_count": 15510,
        "username": "msnbc",
        "video_description": "The United States added 139,000 jobs in May, more than expected but pointing to a labor market that continues to slow. CNBC’s Dominic Chu joins Morning Joe to break down the report, calling it a “mixed picture” as growth slows, wages rise, and trade uncertainty clouds the outlook. #news  #breakingnews  #jobs  #economy "
      },
      {
        "like_count": 16388,
        "region_code": "US",
        "video_description": "Jason Bateman joins Nicolle Wallace on “The Best People” podcast and he gets very candid on the impact President Trump is having on America. Bateman talks about Trump”s “cynicism” and why he can’t stop watching the reality show that is playing out like a Hollywood script. You can watch full episode on YouTube now: www.msnbc.com/thebestpeople #MSNBC #thebestpeople ",
        "comment_count": 767,
        "id": 7512840663340174634,
        "share_count": 478,
        "username": "msnbc",
        "view_count": 438317,
        "create_time": 1749219589
      },
      {
        "id": 7512809075848072491,
        "username": "msnbc",
        "video_description": "Elon Musk absolutely ripped into Donald Trump and the breakup is getting very ugly. @Stephanie Ruhle breaks it down and thinks this feud is likely just getting started.  #elonmusk #trump #news #washington #socialmedia",
        "view_count": 1364924,
        "comment_count": 2879,
        "create_time": 1749212190,
        "like_count": 51210,
        "region_code": "US",
        "share_count": 3012
      },
      {
        "create_time": 1749174342,
        "id": 7512646474619145518,
        "region_code": "US",
        "view_count": 651703,
        "comment_count": 893,
        "like_count": 42421,
        "share_count": 1150,
        "username": "msnbc",
        "video_description": "@Chris Hayes shares his reaction to the split between Elon Musk and President Donald Trump. #trump #elonmusk #news @All In with Chris Hayes "
      },
      {
        "region_code": "US",
        "share_count": 480,
        "username": "msnbc",
        "video_description": "WATCH: House Speaker Mike Johnson, R-La., reacts to Elon Musk's social media tirade and says \"it's not helpful.\" #elonmusk #trump #news ",
        "comment_count": 2699,
        "id": 7512641294582271275,
        "like_count": 11917,
        "create_time": 1749173155,
        "view_count": 266331
      },
      {
        "id": 7512637969010953518,
        "share_count": 10449,
        "username": "msnbc",
        "create_time": 1749172374,
        "like_count": 96238,
        "region_code": "US",
        "video_description": "Here is what it looked like on social media. Musk’s tweet on “the Epstein files” is part of a recent and broader dispute. Trump has denied any involvement and Musk offered no evidence to back up his claim. The White House responded saying “This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill because it does not include the policies he wanted.” #trump #elonmusk #news #politics",
        "view_count": 3107164,
        "comment_count": 2617
      },
      {
        "share_count": 126,
        "view_count": 254145,
        "create_time": 1749332672,
        "id": 7513326391023242539,
        "like_count": 4504,
        "region_code": "US",
        "comment_count": 307,
        "username": "msnbc",
        "video_description": "President Donald Trump told NBC News' Kristen Welker that he has no desire to repair his relationship with Elon Musk after their public feud in the past week. \"I have no intention of speaking to him,\" Trump said. #donaldtrump #elonmusk #politics #news "
      },
      {
        "view_count": 45154,
        "comment_count": 248,
        "create_time": 1749316734,
        "id": 7513257966754123051,
        "like_count": 1356,
        "region_code": "US",
        "share_count": 33,
        "username": "msnbc",
        "video_description": "Actress and equal rights advocate Laverne Cox says that in the face of \"state sanctioned discrimination\" from the Trump administration, the LGBT+ community needs to \"rely on each other.\" #pride #worldpride #lgbt #lavernecox"
      },
      {
        "comment_count": 193,
        "create_time": 1749315048,
        "like_count": 4132,
        "video_description": "Rachel Maddow joins Nicolle Wallace's “The Best People” podcast and shares what's personally \"heartening\" to her among voters that seems to have engaged Americans about Trump's immigration crackdown. You can watch the full episode on YouTube now.",
        "id": 7513250799191936299,
        "region_code": "US",
        "share_count": 38,
        "username": "msnbc",
        "view_count": 105250
      },
      {
        "share_count": 18160,
        "view_count": 1932104,
        "create_time": 1749312449,
        "region_code": "US",
        "like_count": 219921,
        "username": "msnbc",
        "video_description": "\"Elon Musk seems to believe that cruelty is the antidote to empathy.\" MSNBC host of the Last Word Lawrence O'Donnell discusses the legacy Elon Musk leaves behind after leaving the White House. #elonmusk #trump #musk #donaldtrump ",
        "comment_count": 10155,
        "id": 7513239558922751278
      },
      {
        "create_time": 1749308479,
        "id": 7513222486582922538,
        "like_count": 8215,
        "region_code": "US",
        "share_count": 183,
        "username": "msnbc",
        "video_description": "@Briefing with Jen Psaki talks about the consequences of the “breakup” between Elon Musk and President Donald Trump. “The alliance of Trump and Musk did huge damage to the U.S. government… but their breakup could do huge damage as well.” #elonmusk #trump #musk #donaldtrump",
        "view_count": 156363,
        "comment_count": 264
      },
      {
        "id": 7513027786055912747,
        "share_count": 58839,
        "view_count": 12939069,
        "comment_count": 23514,
        "create_time": 1749263129,
        "username": "msnbc",
        "video_description": "NBC News' Jacob Soboroff reports from Los Angeles where federal immigration authorities raided three locations across the city. As federal agents — often wearing camouflage and bulletproof vests with their faces covered — burst into buildings, protesters and supporters soon showed up creating tense scenes throughout the city. “Today, ICE officers and agents alongside partner law enforcement agencies, executed four ​federal search warrants at three location in central Los Angeles,\" a statement from the Homeland Security Investigations said. This is a developing story.",
        "like_count": 1252507,
        "region_code": "US"
      },
      {
        "view_count": 548032,
        "comment_count": 568,
        "create_time": 1749419826,
        "id": 7513700801056034094,
        "like_count": 29057,
        "share_count": 479,
        "video_description": "Jen Psaki warns of the real cost to millions of Americans if Trump's megabill passes in the Senate. Calling it the \"big, ugly bill,\" Psaki says nearly 11 million Americans could lose access to their health insurance. #trump #congress",
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "region_code": "US",
        "share_count": 4378,
        "username": "msnbc",
        "video_description": "President Donald Trump has deployed 2,000 troops to Los Angeles as ICE raid protests continue to grow. While speaking to reporters, Trump said he doesn’t believe an “insurrection” is taking place, but added that the government will “have troops everywhere.” “We’re not going to let this happen to our country,” he said. “We’re not going to let this country be torn apart.” #donaldtrump #losangeles #protest #ice #politics #news ",
        "comment_count": 11115,
        "create_time": 1749419754,
        "like_count": 57321,
        "id": 7513700493030427946,
        "view_count": 2588886
      },
      {
        "create_time": 1749414803,
        "id": 7513679203053686062,
        "like_count": 10994,
        "region_code": "US",
        "share_count": 201,
        "video_description": "The White House is defending its decision to deploy the National Guard in Los Angeles, NBC News' Gabe Gutierrez reports. Homeland Security Secretary Kristi Noem told CBS News’ \"Face the Nation\" that President Trump is prioritizing the safety of both the community and law enforcement officers. #breakingnews #losangeles #la #california #ice #protests",
        "comment_count": 1920,
        "view_count": 435601,
        "username": "msnbc"
      },
      {
        "region_code": "US",
        "video_description": "President Donald Trump said there would be “serious consequences” if tech mogul Elon Musk funds Democratic candidates to run against Republicans who vote in favor of the GOP’s sweeping budget bill. “If he does, he’ll have to pay the consequences for that,” Trump told NBC News' Kristen Welker in a phone interview, but declined to share what those consequences would be. #doge #elonmusk #trump ",
        "share_count": 55,
        "username": "msnbc",
        "view_count": 117603,
        "comment_count": 449,
        "create_time": 1749410899,
        "id": 7513662467541716270,
        "like_count": 1901
      },
      {
        "like_count": 5221,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Jason Bateman joins Nicolle Wallace on “The Best People” podcast and talks about Trump's political strategy - highlighting his “cynicism” and how the president feeds into agitation already felt by voters by increasing it. You can watch full episode on YouTube now.  #podcast #trump #thebestpeople",
        "id": 7513640726811577646,
        "create_time": 1749405839,
        "share_count": 99,
        "view_count": 366347,
        "comment_count": 790
      },
      {
        "view_count": 329600,
        "create_time": 1749404746,
        "id": 7513636012434754859,
        "like_count": 7697,
        "region_code": "US",
        "comment_count": 566,
        "share_count": 1158,
        "username": "msnbc",
        "video_description": "In an interview with NBC News' Jacob Soboroff, White House border czar Tom Homan said large-scale immigration enforcement will continue \"every day\" across Los Angeles City and County.  \"We're going to be out there every day enforcing the laws of this country,\" Homan said. #politics #losangeles #california "
      },
      {
        "view_count": 965557,
        "create_time": 1749402458,
        "like_count": 28321,
        "share_count": 1223,
        "username": "msnbc",
        "video_description": "Members of the California National Guard arrived in Los Angeles early this morning in response to yesterday's protest against federal immigration raids.  NBC News' Steve Patterson has the latest. #losangeles #protests #nationalguard #ice #politics #news",
        "comment_count": 2155,
        "id": 7513626136941956398,
        "region_code": "US"
      },
      {
        "comment_count": 3086,
        "share_count": 556,
        "username": "msnbc",
        "video_description": "In an interview with NBC News’ Jacob Soboroff, White House border czar Tom Homan did not rule out arresting Mayor Karen Bass or Governor Gavin Newsom, asserting that anybody will face arrest if they \"impede law enforcement from doing their job.\" #california #losangeles #politics ",
        "view_count": 789621,
        "create_time": 1749400371,
        "id": 7513617170971004202,
        "like_count": 32985,
        "region_code": "US"
      },
      {
        "comment_count": 2055,
        "video_description": "President Donald Trump signed a memo late Saturday night federalizing 2,000 California National Guard troops to address what a White House official called the “lawlessness that has been allowed to fester” in Los Angeles. Gov. Gavin Newsom objected to the deployment, arguing that the Trump administration wants a \"spectacle\" in the area. #politics #california #losangeles",
        "share_count": 1727,
        "username": "msnbc",
        "view_count": 401217,
        "create_time": 1749393614,
        "id": 7513588152246783275,
        "like_count": 53500,
        "region_code": "US"
      },
      {
        "comment_count": 704,
        "create_time": 1749345771,
        "id": 7513382700636441902,
        "like_count": 18614,
        "region_code": "US",
        "share_count": 1006,
        "username": "msnbc",
        "video_description": "Jen Psaki reacts to the Supreme Court's ruling to has grant the Trump administration’s urgent bid for DOGE personnel to access sensitive Social Security data. \"Elon Musk is a man with a vendetta, even more so now ... And now his DOGE staff has obtained access to the most sensitive personal data of millions of Americans,\" Psaki says on @Briefing with Jen Psaki #elonmusk #doge #politics ",
        "view_count": 319876
      },
      {
        "create_time": 1749513272,
        "id": 7514102097344875818,
        "share_count": 1734,
        "username": "msnbc",
        "comment_count": 8970,
        "like_count": 82111,
        "region_code": "US",
        "video_description": "\"They should be ashamed of themselves. And these people have zero credibility, zero credibility on the other side of the aisle when it comes to issues of law and order.\" House Minority Leader Hakeem Jeffries, D-N.Y., said Trump and the current Republican Party are “intentionally trying to inflame” the situation in California amid federal ICE raids. #news  #politics  #trump ",
        "view_count": 1054124
      },
      {
        "create_time": 1749513225,
        "id": 7514101911000337707,
        "region_code": "US",
        "share_count": 684,
        "video_description": "WATCH: @Ari Melber 📺 🎤 breaks down the state of California's lawsuit against the Trump administration for deploying the state’s National Guard in Los Angeles amid protests against federal immigration raids. #california  #losangeles  #gavinnewsom  #trump  #news  #politics ",
        "comment_count": 1282,
        "like_count": 25104,
        "username": "msnbc",
        "view_count": 404550
      },
      {
        "comment_count": 5903,
        "id": 7514064680495631662,
        "like_count": 105468,
        "region_code": "US",
        "video_description": "BREAKING: Approximately 700 U.S. Marines have been mobilized to support the National Guard in protecting federal personnel and property in Los Angeles, according to two Department of Defense officials. The mobilization is temporary until more California National Guard troops arrive to L.A., the officials said. #la #losangeles  #trump #ice #marines #protests #news #immigration #border",
        "create_time": 1749504545,
        "share_count": 6217,
        "username": "msnbc",
        "view_count": 1584077
      },
      {
        "create_time": 1749501255,
        "id": 7514050519439002926,
        "like_count": 2095,
        "username": "msnbc",
        "video_description": "Kara Swisher joins Nicolle Wallace on “The Best People” podcast for a wide-ranging conversation about Donald Trump, including her surprise take on why she finds him “appealing.” You can watch the full episode on YouTube now. Link in bio. #trump #karaswisher  #election #politics #government #podcast #news",
        "view_count": 114254,
        "comment_count": 168,
        "region_code": "US",
        "share_count": 48
      },
      {
        "like_count": 2110,
        "username": "msnbc",
        "video_description": "As the threat of cuts to Medicaid looms, Americans with disabilities are among those most at risk.  Audrey Presby and Jeremy Fraser, co-hosts of “The Audrey and Jeremy Show” join Ali Vitali to share what these cuts could mean for them. #medicaid #trump #congress  #news ",
        "view_count": 64413,
        "comment_count": 51,
        "create_time": 1749498087,
        "id": 7514036832653577518,
        "region_code": "US",
        "share_count": 88
      },
      {
        "view_count": 736152,
        "comment_count": 2620,
        "like_count": 32966,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "President Trump said in brief remarks to reporters today that maybe Gavin Newsom should be arrested after the Democratic governor dared Trump's border czar Tom Homan to do so. \"I would do it if I were Tom,\" Trump said after landing back at the White House when asked about Newsom's dare. \"I like Gavin Newsom ... he's a nice guy, but he's grossly incompetent.\" #news  #trump  #newsom  #california ",
        "create_time": 1749495319,
        "id": 7514025048273931566,
        "share_count": 975
      },
      {
        "comment_count": 3561,
        "create_time": 1749494570,
        "id": 7514021750297120046,
        "like_count": 69664,
        "region_code": "US",
        "share_count": 7075,
        "username": "msnbc",
        "video_description": "After demonstrations erupted in response to federal immigration authorities raids across three locations in Los Angeles, President Donald Trump activated 2,000 California National Guardsmen without the consent of California Governor Gavin Newsom. About 500 Marines are also ready to deploy. Take a look at how Trump’s view of mobilizing the National Guard has changed over the years. #trump #california #immigration #border #ice #news #government #politics ",
        "view_count": 1364170
      },
      {
        "view_count": 340769,
        "username": "msnbc",
        "video_description": "On #MorningJoe, Trump’s border czar Tom Homan defended sending the National Guard to LA, saying officials “waited over two days while the city burned” and troops were needed “to protect life and property.” Homan also acknowledged that ICE agents often arrest undocumented immigrants who aren’t the intended targets, blaming “sanctuary cities” for forcing agents into neighborhoods. #news #losangeles #immigration #trump #california ",
        "id": 7513996720569634091,
        "like_count": 16939,
        "region_code": "US",
        "share_count": 555,
        "comment_count": 3041,
        "create_time": 1749488736
      },
      {
        "id": 7513991322978716974,
        "like_count": 18605,
        "share_count": 726,
        "comment_count": 1577,
        "create_time": 1749487483,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "President Trump is calling protesters in Los Angeles “insurrectionists” as he sends in up to 2,000 National Guard troops—despite objections from Gov. Gavin Newsom. On Morning Joe, NBC’s Courtney Kube discusses the legal limits of deploying federal troops on U.S. soil, warning the move raises red flags:  “The National Gaurd cannot make arrests… that’s a violation of Posse Comitatus — The question everyone should be asking here is, are they actually trained for any of the kinds of law enforcement?” #news  #trump  #la ",
        "view_count": 269884
      },
      {
        "like_count": 6034,
        "region_code": "US",
        "view_count": 228839,
        "username": "msnbc",
        "video_description": "After months of a legal and political battle over Kilmar Abrego Garcia’s deportation, he is back in the U.S. facing human smuggling charges. Sen. Van Hollen (D-MD) joins Ana Cabrera to react to Abrego Garcia receiving due process which Van Hollen and others have been fighting for. #news  #trump  #maryland  #politics  #immigration ",
        "comment_count": 987,
        "create_time": 1749485828,
        "id": 7513984179248385322,
        "share_count": 98
      },
      {
        "like_count": 6063,
        "username": "msnbc",
        "view_count": 665803,
        "video_description": "Starting today, nationals of 12 countries — including Afghanistan, Iran, Libya, Somalia, Sudan and Yemen — will be barred from entering the United States after a Trump administration executive order went into effect at 12:01 a.m. ET. NBC News' George Solis has the latest #news  #breakingnews  #trump  #travel ",
        "comment_count": 338,
        "create_time": 1749483981,
        "id": 7513976272205188398,
        "region_code": "US",
        "share_count": 1275
      },
      {
        "id": 7513958083224194350,
        "like_count": 1127407,
        "username": "msnbc",
        "video_description": "In an exclusive interview with NBC News' Jacob Soboroff, California Governor Gavin Newsom addressed White House border czar Tom Homan's threats of arrest. \"Tom, arrest me. Let's go,\" Newsom said. The governor also plans to sue the Trump administration over its deployment of the National Guard. #MSNBC #news #LA #politics ",
        "create_time": 1749479765,
        "region_code": "US",
        "share_count": 87009,
        "view_count": 10386022,
        "comment_count": 36195
      },
      {
        "id": 7513783504358870314,
        "like_count": 431256,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "EXCLUSIVE: California Gov. Gavin Newsom addresses immigration protests in Los Angeles. \"Donald Trump has created the conditions you see on your TV tonight ... His mess — we're trying to clean it up,\" Newsom tells NBC News' Jacob Soboroff.  #california #la #losangeles ",
        "comment_count": 11422,
        "share_count": 20328,
        "view_count": 4327726,
        "create_time": 1749439084
      },
      {
        "region_code": "US",
        "video_description": "Antonia Hylton, co-host of “The Weekend: Primetime,” spoke with the Harvard community about President Trump’s ongoing legal battle with the university over international student visas. A judge has temporarily blocked the president’s attempt to ban international student enrollment. #harvard #trump",
        "view_count": 88349,
        "share_count": 46,
        "username": "msnbc",
        "comment_count": 85,
        "create_time": 1749434444,
        "id": 7513763574779628846,
        "like_count": 3436
      },
      {
        "comment_count": 3403,
        "create_time": 1749429861,
        "region_code": "US",
        "share_count": 722,
        "username": "msnbc",
        "id": 7513743889090579755,
        "like_count": 39530,
        "video_description": "Los Angeles Mayor Karen Bass addressed the immigration protests in the city and criticized the Trump administration's move to send in National Guard troops. \"Our city does not need to be torn apart with a provocative measure from the federal government,\" Bass said. #losangeles #la #california",
        "view_count": 663644
      },
      {
        "video_description": "President Donald Trump’s National Intelligence Director Tulsi Gabbard is exploring ways to revamp his routine intelligence briefing in order to build his trust in the material and make it more aligned with how he likes to consume information. One idea that’s been discussed is possibly creating a video version of the PDB that’s made to look and feel like a Fox News broadcast. PDB is a digital document created daily for the president and key Cabinet members and advisers that includes written text, as well as graphics and images. @Briefing with Jen Psaki explains. #trump",
        "comment_count": 1803,
        "id": 7513742955455253806,
        "like_count": 63984,
        "username": "msnbc",
        "view_count": 745755,
        "create_time": 1749429645,
        "region_code": "US",
        "share_count": 3394
      },
      {
        "video_description": "“The most important story of our time is this one: What is this country going to allow him to do?” @The Rachel Maddow Show shares the stories of 3 individuals targeted by the Trump administration’s immigration actions and how their communities rallied to help them fight back against Trump’s “imposition of a dictatorial regime.” “The way we will find out whether or not it’s going to work is not going to be something that happens in the White House,” says Maddow, “It’s going to be something that happens in the streets, and in the courts, and in the states, and in Congress and in every other place that people are trying to say no.” #trump #ice #immigration #border #news #government #politics",
        "comment_count": 9431,
        "id": 7514460157850537262,
        "like_count": 652231,
        "share_count": 44593,
        "create_time": 1749596610,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 2473037
      },
      {
        "comment_count": 1084,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 741080,
        "create_time": 1749595954,
        "id": 7514457336065592622,
        "like_count": 61940,
        "share_count": 1438,
        "video_description": "MSNBC legal correspondent Lisa Rubin breaks down California's lawsuit against the Trump administration over sending National Guard members to L.A. — and why the location of where it has been filed matters more than you think. #california #newsom #trump #la #losangeles "
      },
      {
        "username": "msnbc",
        "video_description": "@Kara Swisher joins Nicolle Wallace on “The Best People” podcast for a wide-ranging conversation about “megalomaniac” Elon Musk and reveals the ways in which the tech billionaire has changed since amassing his fortune and fame. You can watch the full episode on YouTube. Link in bio. #podcast #elonmusk #karaswisher #news",
        "create_time": 1749587911,
        "region_code": "US",
        "like_count": 2863,
        "share_count": 33,
        "view_count": 80018,
        "comment_count": 116,
        "id": 7514422701625412910
      },
      {
        "id": 7514415584667340075,
        "username": "msnbc",
        "video_description": "Former U.S. Marine Corps Captain Timothy Kudo, who served in Iraq and Afghanistan, shares his concerns to the Trump administration sending Marines and National Guard troops to Los Angeles amid the protests over immigration raids. #news #LA  #politics ",
        "view_count": 5828740,
        "comment_count": 11032,
        "create_time": 1749586257,
        "like_count": 254241,
        "region_code": "US",
        "share_count": 8391
      },
      {
        "share_count": 709,
        "username": "msnbc",
        "video_description": "BREAKING: California Attorney General Rob Bonta and California Governor Gavin Newsom have asked the court to take immediate action to block President Donald Trump, Defense Secretary Pete Hegseth, and the U.S. Department of Defense to restrain the use of U.S. troops in L.A. NBC News' legal correspondent Lisa Rubin breaks it down. #news  #breakingnews  #LA  #california  #trump ",
        "comment_count": 3166,
        "create_time": 1749585001,
        "id": 7514410182626135342,
        "like_count": 23456,
        "region_code": "US",
        "view_count": 1055696
      },
      {
        "comment_count": 4499,
        "like_count": 76246,
        "region_code": "US",
        "video_description": "NBC News spoke with Sen. Chris Murphy (D-CT) about President Trump sending Marines and the National Guard to California, as widespread anti-ICE protests continue. In a speech on the Senate floor, Sen. Chuck Schumer (D-NY) denounced the president's actions, calling it \"deeply un-American.\" #MSNBC #news #politics #Trump #LA ",
        "view_count": 644562,
        "create_time": 1749583886,
        "id": 7514405407771839790,
        "share_count": 5255,
        "username": "msnbc"
      },
      {
        "like_count": 6256,
        "region_code": "US",
        "share_count": 114,
        "video_description": "TACO”— or “Trump always chickens out” — is a new slogan and an attempt for some Democrats to get under President Donald Trump’s skin. “Democrats appear to be playing chicken with Trump and seeing who will blink first is not particularly mature, and seems to make a mockery of the stakes before us,” MSNBC Opinion Writer/Editor Zeeshan Aleem writes. #news  #politics ",
        "comment_count": 3968,
        "create_time": 1749579928,
        "id": 7514388426800532779,
        "username": "msnbc",
        "view_count": 398034
      },
      {
        "comment_count": 16130,
        "create_time": 1749578124,
        "region_code": "US",
        "username": "msnbc",
        "id": 7514380623088258346,
        "like_count": 163984,
        "share_count": 8698,
        "video_description": "California Representative Pete Aguilar pressed Secretary of Defense Pete Hegseth on the cost and justification of deploying the National Guard to Los Angeles in response to ongoing demonstrations against ICE deportations in the city. The estimated cost of deploying the National Guard and the Marines to Los Angeles is $134 million, according to Bryn MacDonnell, who is serving as the department’s top financial officer. She said the costs are largely related to temporary duty travel costs such as travel, housing and food. #la #losangeles  #immigration #ice #protests #california  #hegseth #news #government",
        "view_count": 1676269
      },
      {
        "comment_count": 16255,
        "create_time": 1749575404,
        "like_count": 1531058,
        "region_code": "US",
        "share_count": 33875,
        "id": 7514368986478333226,
        "username": "msnbc",
        "video_description": "During four-time Grammy-nominated singer Doechii’s acceptance speech for Best Female Hip Hop Artist at the BET Awards on Monday, she called out the Trump administration’s actions towards protestors in California. #news #politics #doechii ",
        "view_count": 6902329
      },
      {
        "create_time": 1749575162,
        "id": 7514367897926454574,
        "like_count": 90906,
        "username": "msnbc",
        "view_count": 1479033,
        "comment_count": 17124,
        "region_code": "US",
        "share_count": 6555,
        "video_description": "House Speaker Mike Johnson, R-La., said today that California Gov. Gavin Newsom “ought to be tarred and feathered\" as punishment for his handling of protests in Los Angeles. Johnson stopped short of saying Newsom should be arrested — as Trump has suggested — saying he wouldn’t offer that analysis, but claiming Newsom was an “accomplice” in law enforcement agents being “assaulted.” #MSNBC #news #politics #LA "
      },
      {
        "comment_count": 918,
        "id": 7514363192278076714,
        "like_count": 2678,
        "view_count": 150448,
        "create_time": 1749574060,
        "region_code": "US",
        "share_count": 74,
        "username": "msnbc",
        "video_description": "Los Angeles Mayor Karen Bass joins Ana Cabrera to react to Secretary of Homeland Security Kristi Noem calling L.A. a “city of criminals” amid the protests against the Trump administration’s immigration raids. #news #losangeles #trump #california #immigration "
      },
      {
        "comment_count": 1137,
        "create_time": 1749571790,
        "region_code": "US",
        "username": "msnbc",
        "id": 7514353399656189226,
        "like_count": 3818,
        "share_count": 181,
        "video_description": "California Attorney General Rob Bonta sued the Trump administration Monday for deploying hundreds of National Guard members to Los Angeles over the weekend. AG Bonta joins Morning Joe to discuss the “unlawful” move, saying it violates federal law and disrespects the Guard by using them as “political pawns.” #MSNBC #morningjoe #news #politics #LA #Trump ",
        "view_count": 91797
      },
      {
        "like_count": 46629,
        "video_description": "Los Angeles Mayor Karen Bass react to President Trump’s deployment of the National Guard and now Marines to the city amid protests against immigration raids, saying “it was almost as though the administration wanted to see chaos.” #news  #la  #politics  #trump ",
        "view_count": 590321,
        "comment_count": 2452,
        "id": 7514350282910895406,
        "share_count": 3187,
        "username": "msnbc",
        "create_time": 1749571063,
        "region_code": "US"
      },
      {
        "id": 7514330884695395630,
        "like_count": 122279,
        "region_code": "US",
        "video_description": "On Morning Joe, retired Lt. Gen. Mark Hertling warned that deploying Marines to protest sites in Los Angeles is “very dangerous,” saying they’re not trained for domestic crowd control. While calling National Guard support legal under current conditions, he added that invoking the Insurrection Act would be the “tipping point.” #new  #trump  #la ",
        "comment_count": 3593,
        "create_time": 1749566564,
        "share_count": 6332,
        "username": "msnbc",
        "view_count": 2036297
      },
      {
        "comment_count": 2570,
        "username": "msnbc",
        "video_description": "Health and Human Services Secretary Robert F. Kennedy Jr. is removing all 17 members of the CDC’s vaccine advisory committee. On Morning Joe, Dr. Vin Gupta called the decision “dangerous,” saying, “No clinician likes what he’s doing… He’s undermining the very framework of how we get vaccines covered for the American people.” #news  #rfkjr  #cdc  #vaccine ",
        "view_count": 390385,
        "create_time": 1749566205,
        "id": 7514329370266193194,
        "like_count": 42800,
        "region_code": "US",
        "share_count": 5150
      },
      {
        "like_count": 80664,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "About 700 Marines from the Marine Corps base in Twentynine Palms, California, will deploy to Los Angeles to support the roughly 300 National Guard members already in the city to control protests against federal immigration raids, Defense Secretary Pete Hegseth said. NBC News’ David Noriega spoke to one protestor, Pastor Jamie Edwards-Acton, about the deployment. #MSNBC #news #politics #Trump ",
        "view_count": 1618828,
        "comment_count": 6317,
        "create_time": 1749565977,
        "id": 7514328407753166123,
        "share_count": 1066
      },
      {
        "id": 7514300196084305195,
        "video_description": "At least 8 people, including students, are dead after a school shooting in Austria’s second-largest city. Officials say the suspected shooter is also among the dead, and there is no ongoing threat.  Police said they deployed in force to a high school in the northwest of the city of Graz and added that they were working on the assumption that the alleged perpetrator acted alone. This is a developing story. #breakingnews #europe #austria #news ",
        "view_count": 592432,
        "comment_count": 535,
        "create_time": 1749559431,
        "like_count": 15869,
        "region_code": "US",
        "share_count": 901,
        "username": "msnbc"
      },
      {
        "comment_count": 693,
        "video_description": "Michael Cohen, former attorney to President Donald Trump, tells MSNBC’s Ali Velshi that the escalating war of words between Trump and Elon Musk is just getting started and will definitely escalate. “Trump craves relevance. Elon musk craves dominance…This is going to be a war like nobody has seen in maybe all of history.” #politics #trump #elonmusk #news ",
        "view_count": 687264,
        "create_time": 1749514976,
        "id": 7514109479865077038,
        "like_count": 20676,
        "region_code": "US",
        "share_count": 824,
        "username": "msnbc"
      },
      {
        "comment_count": 3635,
        "create_time": 1749684015,
        "id": 7514835410363764011,
        "username": "msnbc",
        "video_description": "Reports of ICE raids at agricultural farms in California have sparked fear in local communities, NBC News’ Jacob Soboroff reports. A video posted to Instagram on Tuesday shows ICE agents pursuing a man at a farm in Ventura County. The FBI’s Los Angeles office confirmed that “immigration enforcement” took place in the county on Tuesday. #ice #immigration #california ",
        "view_count": 1289712,
        "like_count": 101360,
        "region_code": "US",
        "share_count": 4861
      },
      {
        "comment_count": 1803,
        "create_time": 1749681194,
        "like_count": 99417,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 884929,
        "id": 7514823313009544490,
        "share_count": 2480,
        "video_description": "BREAKING: The federal judge presiding over Mahmoud Khalil’s case ruled that the Trump administration, for now, cannot deport or detain the Columbia University activist based on a determination by U.S. Secretary of State Marco Rubio. The judge's order will not take effect until Friday, allowing the government time to appeal. #columbia #breakingnews #politics "
      },
      {
        "id": 7514815049672936750,
        "share_count": 62,
        "view_count": 198017,
        "username": "msnbc",
        "video_description": "Harvey Weinstein is found guilty of sexually assaulting one woman and not guilty of assaulting another more than a decade ago. The jurors at Weinstein's retrial told the judge they were unable to reach a verdict on allegations he assaulted a third woman. The judge asked them to resume deliberating on Thursday. #harveyweinstein #trial #breakingnews ",
        "comment_count": 87,
        "create_time": 1749679268,
        "like_count": 1781,
        "region_code": "US"
      },
      {
        "comment_count": 208,
        "create_time": 1749678119,
        "like_count": 3751,
        "id": 7514810124859411755,
        "region_code": "US",
        "share_count": 138,
        "username": "msnbc",
        "video_description": "\"It's gratifying the president's ego. That's all it is.\" Senator Jack Reed (D-RI) pressed Secretary of Defense Pete Hegseth on the progress of the deal between the Trump administration and Qatar to send a luxury jet to the United States to be used as the new Air Force One. After Secretary Hegseth refused to answer specific questions surrounding the Qatari airplane saying, \"Any specifics about future aircraft that could be Air Force One can't be discussed here,\" Sen. Reed pressed back saying, \"This is the Appropriations Committee of the United States Senate. We appropriate the money that you will spend... And you cannot tell us how much the contract is for?\" #trump #plane #hegseth #news #government #politics",
        "view_count": 81730
      },
      {
        "like_count": 52572,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "“Kardashian’s public condemnation of the administration may come as a surprise to some, considering her prior work with Donald Trump on criminal justice reform,” MSNBC's Allison Detzel writes. Read more of this story in our link in bio. #trump  #news  #kimkardashian ",
        "comment_count": 3558,
        "create_time": 1749677048,
        "id": 7514805560563223851,
        "share_count": 1038,
        "view_count": 939806
      },
      {
        "id": 7514794324316622126,
        "username": "msnbc",
        "view_count": 39857,
        "comment_count": 200,
        "create_time": 1749674446,
        "like_count": 571,
        "region_code": "US",
        "share_count": 27,
        "video_description": "Elon Musk posted “I regret some of my posts about President Trump last week. They went too far.” President Trump told the New York Post he “thought it was very nice that he did that.” The Wall Street Journal reported that Vice President Vance and White House chief of staff Susie Wiles got on a call with Musk last Friday and “pushed Musk to repair his relationship with Trump” where they “urged Musk to put an end to the public feud.” It comes after Musk dropped explosive tweets going after Trump personally and torching his “Big, beautiful bill.” #trump  #musk  #elonmusk  #news "
      },
      {
        "id": 7514770102764473642,
        "video_description": "Kara Swisher joins Nicolle Wallace on “The Best People” podcast for a wide-ranging conversation on Donald Trump, his “carte blanche” relationship with tech billionaires and who Trump is in “The Godfather”. You can watch the full episode on YouTube. Link in bio. #MSNBC #TheBestPeople #Trump  ",
        "view_count": 38043,
        "create_time": 1749668792,
        "like_count": 936,
        "region_code": "US",
        "share_count": 15,
        "username": "msnbc",
        "comment_count": 26
      },
      {
        "video_description": "Sen. Jack Reed (D-R.I.) and Army veteran questioned Defense Secretary Pete Hegseth about the administration deploying the National Guard and the Marines to Los Angeles. Hegseth defends the operation while Reed calls it “illegal.” #MSNBC #news #politics #Senate #hearing #Hegseth #LA ",
        "comment_count": 6139,
        "create_time": 1749663062,
        "id": 7514745499031735595,
        "username": "msnbc",
        "view_count": 1659128,
        "like_count": 83345,
        "region_code": "US",
        "share_count": 1088
      },
      {
        "like_count": 56330,
        "region_code": "US",
        "share_count": 4366,
        "username": "msnbc",
        "video_description": "In Governor Gavin Newsom’s address to California, he warned of an assault on democracy. “California may be first – but it clearly won’t end here. Other states are next. Democracy is next. Democracy is under assault right before our eyes.” #gavinnewsom  #trump  #politics ",
        "view_count": 856089,
        "comment_count": 12783,
        "create_time": 1749661617,
        "id": 7514739240333413678
      },
      {
        "comment_count": 10046,
        "like_count": 24566,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "“This is very different. These are people out there hurting people in California right now.” Attorney General Pam Bondi denied a double standard in the Trump administration’s response towards demonstrations in Los Angeles and their day one pardoning of January 6th rioters. “These people are waving Mexican flags yet don’t want anyone to go back to Mexico,” said the attorney general, “They’re burning American flags. This is the United States of America and we’re going to protect Americans.” #la #losangeles  #protests #trump #bondi #news #politics #government",
        "create_time": 1749659190,
        "id": 7514728763448528174,
        "share_count": 1079,
        "view_count": 672987
      },
      {
        "like_count": 8514,
        "region_code": "US",
        "share_count": 277,
        "video_description": "Trump says China tariffs will stay high after two days of talks. The president said he and his Chinese counterpart, Xi Jinping, still need to sign off on a preliminary deal, even though he called it \"done.\" #news  #trump  #china ",
        "id": 7514703884275944750,
        "create_time": 1749653405,
        "username": "msnbc",
        "view_count": 493685,
        "comment_count": 2630
      },
      {
        "create_time": 1749648820,
        "like_count": 3256,
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 349,
        "id": 7514684147181374763,
        "share_count": 84,
        "video_description": "After another deadly night of Russian attacks, dozens of Ukrainian prisoners of war were returned in a major exchange. NBC’s Richard Engel reports from Kyiv, where newly freed POWs—gaunt and injured—described brutal conditions in Russian captivity. Ukraine also received the remains of more than 1,000 fallen soldiers. #news  #ukraine  #russia ",
        "view_count": 102875
      },
      {
        "create_time": 1749608543,
        "id": 7514511418499157291,
        "region_code": "US",
        "share_count": 2823,
        "comment_count": 2032,
        "username": "msnbc",
        "video_description": "“Authoritarian regimes begin by targeting people who are least able to defend themselves, but they do not stop there.” California Governor Gavin Newsom delivered an address that took aim at President Donald Trump’s federalization of the National Guard and use of Marines in Los Angeles and warned of what may come. #breakingnews #california #gavinnewsom #newsom #la #losangeles #trump #donaldtrump",
        "view_count": 436999,
        "like_count": 55301
      },
      {
        "view_count": 2418043,
        "create_time": 1749606034,
        "id": 7514500623518420270,
        "like_count": 204212,
        "username": "msnbc",
        "video_description": "WATCH: Republican Senators Rand Paul and John Kennedy speak out on President Donald Trump's upcoming Washington, D.C. military parade.",
        "comment_count": 5992,
        "region_code": "US",
        "share_count": 7451
      },
      {
        "share_count": 199,
        "username": "msnbc",
        "video_description": "MSNBC's @Ari Melber 📺 🎤 shares his take on Health and Human Services Secretary Robert F. Kennedy Jr.'s ousting of 17 members of the Centers for Disease Control and Prevention’s independent vaccine advisory committee. \"This is what the Trump administration is doing day in and day out against the backdrop of other admittedly important standoffs like whether the National Guard and Marines are in the streets...but in the background is the whittling away of medical expertise in science which affects everyone and especially children.\" #rfkjr",
        "like_count": 2373,
        "region_code": "US",
        "id": 7514487274676030766,
        "view_count": 56279,
        "comment_count": 203,
        "create_time": 1749602921
      },
      {
        "like_count": 38332,
        "video_description": "\"How could you say that you did not know who he was?\"  L.A. Mayor Karen Bass speaks out on the forced removal of California Sen. Alex Padilla from a DHS press conference. DHS claimed the senator \"interrupted a live press conference without identifying himself.\"  #losangeles #california #politicalnews ",
        "view_count": 335010,
        "create_time": 1749770582,
        "id": 7515207365902486830,
        "region_code": "US",
        "share_count": 1045,
        "username": "msnbc",
        "comment_count": 1618
      },
      {
        "id": 7515186747211337002,
        "video_description": "“I'm just disgusted by what I saw.” Sen. Adam Schiff, D-Calif., reacts colleague Sen. Alex Padilla's, D-Calif., forced removal from a DHS press conference. According to a statement from Padilla's office, \"He tried to ask the Secretary a question, and was forcibly removed by federal agents, forced to the ground and handcuffed. He is not currently detained.\" The White House condemned Padilla, describing his actions as a “theater-kid stunt.” #news  #breakingnews  #politics ",
        "region_code": "US",
        "share_count": 5517,
        "username": "msnbc",
        "view_count": 937608,
        "comment_count": 10422,
        "create_time": 1749765782,
        "like_count": 85127
      },
      {
        "comment_count": 4147,
        "like_count": 24830,
        "username": "msnbc",
        "view_count": 404775,
        "create_time": 1749765455,
        "id": 7515185341263875374,
        "region_code": "US",
        "share_count": 3468,
        "video_description": "“Every single person who was involved in manhandling Senator Padilla should be held accountable to the full extend of the law.” House Minority Leader Hakeem Jeffries, D-N.Y., speaks out after Senator Alex Padilla was forcibly removed and handcuffed during a DHS press conference. In a statement, the Department of Homeland Security said law enforcement “acted appropriately.” #ice #immigration #padilla #jeffries #noem #trump #la #losangeles"
      },
      {
        "create_time": 1749761284,
        "username": "msnbc",
        "view_count": 269347,
        "video_description": "\"Come this Saturday, I encourage everybody to please peacefully protest, just like I was calmly and peacefully listening in that press conference and preparing attempting to ask a question,\" he said. \"No violence, no vandalism.\" Sen. Alex Padilla, speaking shortly after he was removed from a Homeland Security news conference in Los Angeles, said he was handcuffed by law enforcement officers, but not arrested or detained. He also encouraged protesters to keep Saturday's upcoming rallies peaceful. In a statement, the Department of Homeland Security said law enforcement \"acted appropriately.\" #MSNBC #news #politics #DHS ",
        "comment_count": 2712,
        "id": 7515167423276895531,
        "like_count": 18851,
        "region_code": "US",
        "share_count": 567
      },
      {
        "id": 7515162678168522026,
        "like_count": 131696,
        "comment_count": 6044,
        "create_time": 1749760178,
        "username": "msnbc",
        "video_description": "Sen. Alex Padilla, D-Calif., speaks out after being forcibly removed from Homeland Security Secretary Kristi Noem's press conference in Los Angeles. Padilla said he was handcuffed by law enforcement officers, but not arrested or detained. \"If this is how this administration responds to a senator with a question, if this is how the Department of Homeland Security responds to a senator with a question, you can only imagine what they're doing to farm workers, to cooks, to day laborers out in the Los Angeles community and throughout California and throughout the country.\" In a statement posted to social media, DHS said “Senator Padilla chose disrespectful political theatre and interrupted a live press conference without identifying himself or having his Senate security pin on as he lunged toward Secretary Noem.” #alexpadilla #kristinoem #losangeles #dhs #politics #news ",
        "view_count": 806534,
        "region_code": "US",
        "share_count": 6848
      },
      {
        "create_time": 1749760044,
        "region_code": "US",
        "video_description": "\"I have never come this close to having tears in my eyes as I speak to both sides of the aisle about this horrendous incident that occurred.\" Sen. Patty Murray, D-Wash., reacts to Sen. Alex Padilla's, D-Calif., forced removal from Homeland Security Secretary Kristi Noem's press conference in Los Angeles. Padilla said he was handcuffed by law enforcement officers, but not arrested or detained. The Department of Homeland Security said law enforcement \"acted appropriately\" in a statement. \"Senator Padilla chose disrespectful political theatre and interrupted a live press conference without identifying himself or having his Senate security pin on as he lunged toward Secretary Noem,\" DHS said in a post on X. #california #politics #breakingnews ",
        "share_count": 9658,
        "username": "msnbc",
        "view_count": 1876131,
        "comment_count": 13273,
        "id": 7515162090143894827,
        "like_count": 178456
      },
      {
        "view_count": 825364,
        "like_count": 31232,
        "username": "msnbc",
        "video_description": "WATCH: Sen. Alex Padilla (D-CA) was forcibly removed from Homeland Security Secretary Kristi Noem's press conference in Los Angeles. Padilla's office shared a video of the incident with NBC News. The video shows Padilla being taken into a hallway outside and pushed face forward onto the ground as officers with FBI-identifying vests told the senator to put his hands behind his back. The officers then handcuffed him. According to a statement from Padilla's office, \"He tried to ask the Secretary a question, and was forcibly removed by federal agents, forced to the ground and handcuffed. He is not currently detained.\" In a statement posted to social media, DHS said “Senator Padilla chose disrespectful political theatre and interrupted a live press conference without identifying himself or having his Senate security pin on as he lunged toward Secretary Noem.” #news  #politics  #breakingnews ",
        "region_code": "US",
        "share_count": 6945,
        "comment_count": 7399,
        "create_time": 1749757104,
        "id": 7515149479918734638
      },
      {
        "username": "msnbc",
        "video_description": "Texas Gov. Greg Abbott announced that he has deployed more than 5,000 National Guard troops to quell protests throughout the state. In a news release, the governor said 2,000 Texas Department of Public Safety troopers have also been deployed ahead of expected weekend protests over Immigration and Customs Enforcement raids. \"Anyone engaging in acts of violence or damaging property will be arrested and held accountable to the full extent of the law. Don’t mess with Texas — and don’t mess with Texas law enforcement,\" Abbott said in the press release. #texas  #news  #politics ",
        "view_count": 1304882,
        "comment_count": 4048,
        "create_time": 1749751809,
        "id": 7515126738289085742,
        "like_count": 88537,
        "region_code": "US",
        "share_count": 6488
      },
      {
        "comment_count": 591,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "BREAKING: Indian media reports say that a British national survived the crash. NBC News has cross checked the flight manifest and confirmed the name of the man and the seat number match those reported by local media. Family members have confirmed to Sky News that British national Vishwash Kumar Ramesh survived the plane crash in Ahmedabad this morning. Family have not heard from another family member who they believe was on the flight. #breakingnews  #news  #india ",
        "create_time": 1749749617,
        "id": 7515117320499531054,
        "like_count": 19580,
        "share_count": 1573,
        "view_count": 687023
      },
      {
        "view_count": 314425,
        "create_time": 1749745826,
        "share_count": 358,
        "video_description": "After Sen. Rand Paul said on Wednesday he was uninvited from the White House picnic as “retribution” for opposing Trump’s agenda, calling the move “incredibly petty” — the president reversed course on Truth Social Thursday morning, saying Paul and his family were “of course” welcome.  The #MorningJoe panel reacts to the reversal: “Be careful what you ask for.” #news  #trump  #politics  #washington ",
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 1258,
        "id": 7515101038706249002,
        "like_count": 14595
      },
      {
        "view_count": 206456,
        "comment_count": 233,
        "create_time": 1749735402,
        "id": 7515056260799057194,
        "share_count": 896,
        "like_count": 4477,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "An Air India plane with 242 people on board crashed Thursday near a major international airport in the western Indian city of Ahmedabad, the airline and the country’s government said. The plane was carrying passengers and crew members. The commissioner, G.S. Malik, said that emergency crews had recovered 204 bodies from the crash site and did not rule out the possibility of survivors. #news  #breakingnews  #india "
      },
      {
        "create_time": 1749698735,
        "like_count": 26657,
        "share_count": 1074,
        "username": "msnbc",
        "video_description": "L.A. Police Chief Jim McDonnell said that the National Guard being deployed to Los Angeles in the midst of ICE protests are, “to facilitate what the federal agencies are doing on the immigration front,\" not to assist with the ongoing demonstrations. Jen Psaki highlights this statement and other reports that detail how the Trump administration is ramping up immigration enforcement.  @Briefing with Jen Psaki #losangeles #california #news ",
        "view_count": 394558,
        "comment_count": 810,
        "id": 7514898665002126634,
        "region_code": "US"
      },
      {
        "comment_count": 11576,
        "like_count": 205411,
        "region_code": "US",
        "share_count": 10171,
        "create_time": 1749695890,
        "id": 7514886422185200939,
        "username": "msnbc",
        "video_description": "Sen. Tammy Baldwin reacts on @The Weeknight on MSNBC to Defense Secretary Pete Hegseth's failure to cite which constitutional provision allows for President Trump to send the Marines into L.A. amid anti-ICE protests. \"I think he was just doing it because Donald Trump told him he should,\" Sen. Baldwin said in regards to the deployment. #trump #losangeles #california",
        "view_count": 2507795
      },
      {
        "username": "msnbc",
        "video_description": "The Trump-Musk saga continues, with Elon Musk expressing regret for inflammatory statements he made about President Donald Trump. @Stephanie Ruhle asks: Can the two really reconcile — and what would it mean for the rest of us? @11th Hour MSNBC #musk #trump",
        "create_time": 1749692000,
        "id": 7514869814213479723,
        "region_code": "US",
        "share_count": 53,
        "comment_count": 134,
        "like_count": 1666,
        "view_count": 59375
      },
      {
        "share_count": 780,
        "video_description": "Rep. Sydney Kamlager-Dove reacts to her viral presser comment, in which she said Trump “manufactured violence” in Los Angeles and called the president's deployment of the National Guard “illegal.” \"Keep it real for the people,\" the congresswoman said.",
        "view_count": 167512,
        "username": "msnbc",
        "comment_count": 1297,
        "create_time": 1749689726,
        "id": 7514860007528090926,
        "like_count": 14388,
        "region_code": "US"
      },
      {
        "id": 7515543471600471339,
        "region_code": "US",
        "video_description": "“We were warned that something like this could happen almost ten years ago.” MSNBC contributor Paola Ramos reacts to Senator Alex Padilla being forcefully removed from a press conference with Department of Homeland Security Secretary Kristi Noem. Ramos said Senator Padilla’s removal was preluded by her own father, former Univision anchor Jorge Ramos, who was removed by President Trump during a press conference in 2015. #trump #ice #padilla #immigration #border #news #politics #government #california #la #losangeles ",
        "create_time": 1749848857,
        "like_count": 64603,
        "share_count": 7116,
        "username": "msnbc",
        "view_count": 383872,
        "comment_count": 2649
      },
      {
        "share_count": 2082,
        "video_description": "The survivor of the Air India Flight 171 crash revealed he miraculously survived by escaping through a broken emergency exit. \"I can't believe myself how I came out of it alive, because for a while I thought I was going to die as well,\" Ramesh Viswashkumar, 40, told Indian national broadcaster DD News. \"But when I opened my eyes, I saw that I was alive. So I tried to open my seat belt, and I was able to get out.\" There were 242 people on board the Boeing 787-8 Dreamliner, bound for London, that crashed shortly after takeoff in the western Indian city of Ahmedabad, smashing in a fiery blast into a medical college hostel. #news  #plane  #india ",
        "view_count": 1411561,
        "comment_count": 994,
        "create_time": 1749844637,
        "like_count": 15779,
        "id": 7515525318195662126,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "comment_count": 422,
        "region_code": "US",
        "create_time": 1749844362,
        "id": 7515524131983576362,
        "like_count": 3375,
        "share_count": 205,
        "username": "msnbc",
        "video_description": "DEVELOPING: Iran launched \"hundreds of ballistic missiles\" toward Israel, according to Iran's Islamic Republic News Agency. Very intense explosions could be heard in Tel Aviv. #israel #iran #news ",
        "view_count": 137498
      },
      {
        "id": 7515521244683423022,
        "region_code": "US",
        "video_description": "DEVELOPING: \"I'm talking to you from a bomb shelter...it's not something that anyone should be experiencing to run this way for your life.\" Hen Mazzig, a senior fellow at the Tel Aviv Institute, shares his account on “MSNBC Reports” as Iran launches retaliatory missiles into Israel. #israel #iran #breakingnews ",
        "create_time": 1749843676,
        "like_count": 13280,
        "share_count": 512,
        "username": "msnbc",
        "view_count": 603826,
        "comment_count": 4582
      },
      {
        "username": "msnbc",
        "video_description": "BREAKING: Iran launches retaliatory attack on Israel, according to the Israel Defense Forces. \"Dozens of additional missiles were launched toward Israel,\" the IDF said. Earlier Iran's Islamic Republic News Agency said it launched hundreds of ballistic missiles at Israel. NBC News' Matt Bradley reporting from Tel Aviv. #news  #breakingnews  #iran  #israel ",
        "comment_count": 650,
        "create_time": 1749842909,
        "like_count": 13364,
        "region_code": "US",
        "share_count": 830,
        "id": 7515517906810260782,
        "view_count": 528036
      },
      {
        "create_time": 1749838360,
        "username": "msnbc",
        "video_description": "Four people detained at an immigration detention center in Newark, New Jersey have escaped, according to the Department of Homeland Security. The detainees were being held at the Delaney Hall facility, where Immigration and Customs Enforcement (ICE) has been holding individuals who are facing possible deportation. The four people were unaccounted for Thursday night, and federal authorities were looking into whether they were still on the grounds of the facility, or had somehow escaped, senior officials said. #MSNBC #news #politics #breakingnews #DHS ",
        "view_count": 292505,
        "share_count": 446,
        "comment_count": 781,
        "id": 7515498372447341866,
        "like_count": 9634,
        "region_code": "US"
      },
      {
        "share_count": 477,
        "video_description": "Sen. Chris Murphy condemned the treatment of Sen. Alex Padilla at a DHS news conference with Secretary Kristi Noem, saying Padilla “identified himself,” was “wearing a pullover that said United States Senate,” and had been “led into that room by members of the administration.” “This is what happens in dictatorships and authoritarian regimes.” #news #trump #alexpadilla  #california #immigration #politics ",
        "comment_count": 1979,
        "create_time": 1749837007,
        "region_code": "US",
        "view_count": 138136,
        "id": 7515492517358357803,
        "like_count": 11016,
        "username": "msnbc"
      },
      {
        "username": "msnbc",
        "video_description": "Rachel Maddow reacts to President Trump sending Marines and National Guard members in response to widespread L.A. anti-ICE protests. Maddow says Trump is \"flailing and panicking and literally calling in the troops to try to wage a physical war against his own people because the people are against him,\" adding, \"game over, big guy, you lose.\" #MSNBC #news #politics #Trump #LA ",
        "id": 7515484385425214766,
        "like_count": 1020727,
        "region_code": "US",
        "share_count": 43981,
        "view_count": 7365988,
        "comment_count": 34583,
        "create_time": 1749835106
      },
      {
        "comment_count": 32,
        "create_time": 1749833712,
        "share_count": 106,
        "username": "msnbc",
        "video_description": "Kara Swisher joins Nicolle Wallace on “The Best People” podcast for a wide-ranging conversation about politics, technology and parenting. You can watch the full episode on YouTube. Link in bio. #MSNBC #TheBestPeople ",
        "view_count": 32969,
        "id": 7515478346986327342,
        "like_count": 1272,
        "region_code": "US"
      },
      {
        "username": "msnbc",
        "video_description": "What in the world is happening at the DNC? @Symone Sanders Townsend breaks it down. #dnc #democrats #davidhogg #politics #government #news",
        "share_count": 109,
        "view_count": 100362,
        "comment_count": 398,
        "create_time": 1749831305,
        "id": 7515468055833529642,
        "like_count": 5871,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "video_description": "Hegseth dodged multiple questions from Rep. Ro Khanna, D-Calif. on Thursday, over whether he would abide by court decisions on whether President Trump can deploy troops to respond to protests in Los Angeles despite Newsom's objections. #news  #politics  #hegseth  #washington ",
        "like_count": 31381,
        "share_count": 740,
        "username": "msnbc",
        "view_count": 306288,
        "comment_count": 1887,
        "create_time": 1749829618,
        "id": 7515460761427135786
      },
      {
        "share_count": 6924,
        "video_description": "\"Buyer's remorse? I don't know. A little bit.\" Vincent Scardina, a Trump voter and small business owner, speaks out after he says ICE detained a third of his workers. While Vincent agrees with most of the president’s policies, he thought the Trump administration was going to focus solely on deporting criminals. This interview was conducted by NBC local affiliate channel NBC6 South Florida. #ice #trump #immigration #border #news #politics",
        "view_count": 1071050,
        "comment_count": 7522,
        "create_time": 1749828676,
        "id": 7515456700569128235,
        "region_code": "US",
        "like_count": 99928,
        "username": "msnbc"
      },
      {
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 547,
        "create_time": 1749826947,
        "id": 7515449450014330158,
        "like_count": 4583,
        "share_count": 208,
        "video_description": "A federal appeals court paused a lower court ruling that blocked Trump from deploying the National Guard in Los Angeles — for now.  On #MorningJoe, NBC News legal corresponent Lisa Rubin broke down the late-night legal whiplash: “Nothing is changed and won’t be changed, at least until next Tuesday.” #california #losangeles #law  #trump #immigration  #military ",
        "view_count": 220940
      },
      {
        "video_description": "In his first remarks since Israel’s strike on Iran, Trump warned Tehran of “more brutal” attacks ahead and claimed Iranian hardliners “didn’t know what was about to happen… they’re all dead now.”  The #MorningJoe panel discusses what this signals for U.S. involvement and diplomacy moving forward. #israel #iran #breakingnews #worldnews #trump",
        "view_count": 1924213,
        "like_count": 67925,
        "region_code": "US",
        "share_count": 6402,
        "username": "msnbc",
        "comment_count": 4281,
        "create_time": 1749822025,
        "id": 7515428318909320494
      },
      {
        "username": "msnbc",
        "video_description": "California Gov. Gavin Newsom reacts to a federal judge's ruling granting a temporary restraining order halting Trump's deployment of the California National Guard. \"Today was really about a test of democracy. And today we passed the test,\" Newsom said. #politics #losangeles #california ",
        "comment_count": 1709,
        "create_time": 1749783805,
        "id": 7515264152861035822,
        "like_count": 34960,
        "share_count": 718,
        "region_code": "US",
        "view_count": 310292
      },
      {
        "region_code": "US",
        "create_time": 1749781845,
        "id": 7515255740244921646,
        "share_count": 12372,
        "username": "msnbc",
        "video_description": "FIRST ON MSNBC: \"It's all BS coming from Trump.\" Sen. Padilla gets emotional talking to Jacob Soboroff about the treatment of immigrants from the Trump administration hours after being forcibly removed from a DHS press conference. #alexpadilla #kristinoem #donaldtrump #politics #dhs #news ",
        "view_count": 1383935,
        "comment_count": 5533,
        "like_count": 177764
      },
      {
        "video_description": "BREAKING: The Israeli military confirmed it launched airstrikes on Iran.  Prime Minister Benjamin Netanyahu said that Israel launched “a targeted military operation to roll back the Iranian threat\" and that the \"operation will continue for as many days as it takes to remove this threat.\"  This is a developing story. #breakingnews #israel #iran ",
        "comment_count": 1185,
        "id": 7515247756760468779,
        "region_code": "US",
        "share_count": 1261,
        "username": "msnbc",
        "view_count": 1184042,
        "create_time": 1749779986,
        "like_count": 25507
      },
      {
        "id": 7515233222759009582,
        "video_description": "In his first interview after the incident, Sen. Alex Padilla, D-Calif., disputes the Trump administration's account of his forcible removal at a DHS press conference. Padilla denied Secretary Noem's characterizations telling Jacob Soboroff: \"That's ridiculous. It's a lie but par for the course for this administration.\" #breakingnews #politics #padilla #california ",
        "view_count": 427125,
        "region_code": "US",
        "share_count": 1527,
        "username": "msnbc",
        "comment_count": 1511,
        "create_time": 1749776601,
        "like_count": 42253
      },
      {
        "share_count": 1372,
        "username": "msnbc",
        "video_description": "\"They wouldn't identify themselves, and I kept repeatedly asking themselves, why am I being detained?\" In a first on MSNBC interview, Sen. Alex Padilla, D-Calif., details to Jacob Soboroff what happened after he was forcibly removed and handcuffed from a DHS press conference.  #AlexPadilla #KristiNoem #DHS #politics #news ",
        "view_count": 726433,
        "create_time": 1749776417,
        "id": 7515232423714639146,
        "region_code": "US",
        "comment_count": 3568,
        "like_count": 23033
      },
      {
        "like_count": 16016,
        "share_count": 414,
        "username": "msnbc",
        "video_description": "FIRST ON MSNBC:  Sen. Padilla reveals meeting DHS Secretary Kristi Noem after being forcibly removed and cuffed from her DHS press conference. \"You know, you'd think she might have started the meeting with an apology for what happened.  Of course not.\" #california #losangeles #politics ",
        "view_count": 372782,
        "comment_count": 637,
        "create_time": 1749776081,
        "id": 7515230978831437098,
        "region_code": "US"
      },
      {
        "like_count": 4561,
        "username": "msnbc",
        "video_description": "Hundreds of people participated in a ‘No Kings’ protest in Newark, New Jersey. The protest is just one of thousands that are taking place throughout the country today in response to the Trump administration’s policies and President Trump’s military parade in Washington D.C. NBC News’ Maya Eaglin speaks to attendees who shared what motivated them to go protest. #news  #trump  #politics  #newark ",
        "comment_count": 263,
        "create_time": 1749945041,
        "share_count": 89,
        "view_count": 84538,
        "id": 7515956559671889198,
        "region_code": "US"
      },
      {
        "username": "msnbc",
        "like_count": 13076,
        "share_count": 182,
        "id": 7515954057031290158,
        "region_code": "US",
        "video_description": "NBC News correspondent David Noriega reports on the ground in Los Angeles, CA as citizens march in the 'No Kings' protests. \"There are a lot of people out here who are the children of immigrants... They feel personally that a lot is at stake for them with these protests,\" Noriega says. #NoKings #politics #losangeles ",
        "view_count": 149361,
        "comment_count": 421,
        "create_time": 1749944465
      },
      {
        "id": 7515936370901159214,
        "username": "msnbc",
        "video_description": "As President Donald Trump hosts a major military parade in Washington to mark the Army’s 250th anniversary, NBC News' Vaughn Hillyard is on the ground with a look at the scene and what’s unfolding. #donaldtrump #military #parade #politics #news ",
        "comment_count": 448,
        "create_time": 1749940330,
        "share_count": 64,
        "view_count": 239406,
        "like_count": 6208,
        "region_code": "US"
      },
      {
        "share_count": 120318,
        "video_description": "Actor and activist Mark Ruffalo joined “The Weekend: Primetime” co-anchor Antonia Hylton to discuss why he was among one of thousands of 'No Kings' protesters marching down Fifth Avenue in Manhattan. \"We love each other, and we realize that we love this country so much that we're leaving our homes today in the rain to express our friendship and love for the people here who made this place,\" Ruffalo said. #politics #news #protest  #trump #markruffalo ",
        "comment_count": 28955,
        "like_count": 1895139,
        "region_code": "US",
        "view_count": 12077006,
        "create_time": 1749938374,
        "id": 7515927947849616682,
        "username": "msnbc"
      },
      {
        "view_count": 744071,
        "comment_count": 2653,
        "like_count": 22099,
        "share_count": 2164,
        "username": "msnbc",
        "create_time": 1749933950,
        "id": 7515908934088068395,
        "region_code": "US",
        "video_description": "A massive search continued Saturday for a 57-year-old Minnesota man, hours after an early-morning attack that left a Democratic Minnesota lawmaker and her husband dead and a second Democratic lawmaker and his wife injured in separate “politically motivated” shootings, authorities said.  NBC News' Maggie Vespa has the latest. This is a developing story. #minnesota #breakingnews #suspect #shooting"
      },
      {
        "comment_count": 11768,
        "create_time": 1749933423,
        "like_count": 466224,
        "username": "msnbc",
        "view_count": 4453946,
        "id": 7515906640890187050,
        "region_code": "US",
        "share_count": 18479,
        "video_description": "NBC News' Jacob Soboroff reports from Los Angeles City Hall where thousands of protesters have gathered for a 'No Kings' protest against the Trump administration and ahead of the president's Washington D.C. military parade. #losangeles  #california #protest  #news "
      },
      {
        "comment_count": 9781,
        "create_time": 1749925343,
        "like_count": 58286,
        "region_code": "US",
        "video_description": "Lawmakers react to the killing of a Democratic Minnesota lawmaker and her spouse and the attempted assassination of another Democratic state lawmaker. Authorities said the suspect impersonated law enforcement and wore a badge to gain access to the legislators' homes. The suspect is still at large and a manhunt is underway.",
        "id": 7515871956206357806,
        "share_count": 994,
        "username": "msnbc",
        "view_count": 1713374
      },
      {
        "video_description": "Minnesota Gov. Tim Walz and state patrol are asking the public “not to attend\" today’s planned demonstrations across Minnesota. This comes amid an active manhunt for the suspect in the “politically motivated assassination” of a Democratic Minnesota lawmaker and her spouse. #minnesota #breakingnews #politics ",
        "view_count": 783637,
        "comment_count": 1482,
        "id": 7515854110843833643,
        "region_code": "US",
        "share_count": 397,
        "create_time": 1749921204,
        "like_count": 17263,
        "username": "msnbc"
      },
      {
        "like_count": 43180,
        "video_description": "President Trump released a statement on the shootings in Minnesota. “Such horrific violence will not be tolerated in the United States of America,\" Trump said, noting that AG Bondi and the FBI are investigating. #minnesota #trump",
        "comment_count": 5219,
        "create_time": 1749919025,
        "id": 7515844764932099371,
        "region_code": "US",
        "share_count": 988,
        "username": "msnbc",
        "view_count": 2083721
      },
      {
        "create_time": 1749917994,
        "like_count": 4075,
        "username": "msnbc",
        "view_count": 142154,
        "comment_count": 398,
        "id": 7515840354755595562,
        "region_code": "US",
        "share_count": 191,
        "video_description": "A large-scale manhunt is underway for the suspect in the fatal shooting of a Democratic Minnesota lawmaker and her spouse and the attempted assassination of another Democratic state lawmakers, officials said. Authorities said the suspect impersonated law enforcement and wore a badge to gain access to the legislators' homes. #breakingnews #minnesota"
      },
      {
        "comment_count": 7515,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 1707504,
        "create_time": 1749916448,
        "id": 7515833722436996398,
        "like_count": 272390,
        "share_count": 13962,
        "video_description": "Minnesota House Democratic Leader Melissa Hortman and her spouse, Mark, were fatally shot Saturday morning. A second lawmaker, State Sen. John Hoffman, and his spouse were also shot at their home in eastern Minnesota, officials said. Gov. Tim Walz said the attack appears to be \"targeted political violence.\" The assailant remains at large and reportedly impersonated a police officer with a uniform and a cruiser. A manhunt is underway. "
      },
      {
        "view_count": 1186648,
        "region_code": "US",
        "video_description": "BREAKING: There have been \"targeted shootings\" in eastern Minnesota, according to Gov. Tim Walz. \"I’ve been briefed this morning on an ongoing situation involving targeted shootings in Champlin and Brooklyn Park,\" he wrote on X Saturday morning. #breakingnews #minnesota ",
        "id": 7515814547408669998,
        "like_count": 57871,
        "share_count": 4795,
        "username": "msnbc",
        "comment_count": 4139,
        "create_time": 1749911989
      },
      {
        "comment_count": 220,
        "id": 7515802250594340139,
        "share_count": 81,
        "username": "msnbc",
        "video_description": "Ahead of the U.S. Army’s 250th anniversary parade in D.C., Meacham joins #MorningJoe to ask whether America is still living up to its founding ideals: “Are we fulfilling the implications of the Declaration, or pulling away from them?” What do you think? Post in the comments below. #trump #military #army #news #washington ",
        "create_time": 1749909143,
        "like_count": 4487,
        "region_code": "US",
        "view_count": 252014
      },
      {
        "comment_count": 3134,
        "create_time": 1749868113,
        "id": 7515626208307055918,
        "share_count": 5449,
        "like_count": 179370,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "@Chris Hayes shares his take on President Trump's military parade and how \"Trump has already promised 'very heavy force' against anyone who would choose to protest his special day.\" #donaldtrump #military #parade #politics #news ",
        "view_count": 1572416
      },
      {
        "id": 7515613593354849582,
        "like_count": 7239,
        "username": "msnbc",
        "view_count": 114845,
        "comment_count": 298,
        "create_time": 1749865165,
        "region_code": "US",
        "share_count": 306,
        "video_description": "NEW: Video from news agency Reuters appears to show a man being detained outside the Westwood Federal Building in Los Angeles. Reuters said it was the first detention by a U.S. Marine during the deployment for area protests over immigration enforcement. It's not clear why the man was detained. U.S. Northern Command confirmed the detention by U.S. Marines, saying it was temporary and justified under the assignment to protect federal assets, which include the property formally known as the 11000 Wilshire Federal Building. A spokesperson said the man was immediately transferred to the custody of local law enforcement, as allowed. #california #marines #losangeles "
      },
      {
        "comment_count": 263,
        "id": 7515596836200009006,
        "like_count": 6435,
        "region_code": "US",
        "username": "msnbc",
        "create_time": 1749861282,
        "share_count": 221,
        "video_description": "On “The Beat”, @Ari Melber 📺 🎤 outlines why recent incidents involving some Democratic politicians — including Sen. Alex Padilla, Newark Mayor Ras Baraka and Rep. LaMonica McIver — and the Trump administration may point to an \"alleged abuse of power.\" #alexpadilla #lamonicamciver #donaldtrump #dhs #ice #politics #news ",
        "view_count": 121294
      },
      {
        "create_time": 1749859313,
        "username": "msnbc",
        "video_description": "Rep. LaMonica McIver, D-N.J., joined @Ari Melber 📺 🎤 on “The Beat” after being indicted on federal charges stemming from a confrontation with law enforcement at an ICE facility in Newark. She responded to comments made by Trump's border czar, Tom Homan, on the case: \"All of the facts are gonna come out and they're gonna be on my side when it gets to that point,\" McIver said. The interim U.S. attorney for New Jersey, Alina Habba, said on X of the indictment that, “While people are free to express their views for or against particular policies, they must not do so in a manner that endangers law enforcement and the communities those officers serve. #NewJersey #politics #news ",
        "view_count": 1134647,
        "comment_count": 2808,
        "id": 7515588470874656043,
        "like_count": 49360,
        "region_code": "US",
        "share_count": 452
      },
      {
        "like_count": 131962,
        "share_count": 4111,
        "username": "msnbc",
        "video_description": "David Carlson, the roommate and best friend of the suspect in the assassination of a Minnesota lawmaker and the shooting another shared the last text message he received from him. The suspect is still at large as the manhunt for him continues. #minnesota #gunviolence #news ",
        "comment_count": 5359,
        "create_time": 1750025135,
        "view_count": 3184248,
        "id": 7516300587583950122,
        "region_code": "US"
      },
      {
        "comment_count": 246,
        "create_time": 1750023832,
        "like_count": 6133,
        "share_count": 58,
        "video_description": "On the new episode of \"The Best People with Nicolle Wallace,\" Nicolle Wallace sits down with NBA legend Doc Rivers. They talk about politics and why he refuses to just 'shut up and dribble.' The episode drops wherever you get your podcasts TOMORROW. You can also watch the full episodes on YouTube at the link in our bio. #nba #politics #podcast ",
        "id": 7516294990553697582,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 218854
      },
      {
        "region_code": "US",
        "share_count": 4300,
        "username": "msnbc",
        "video_description": "President Donald Trump rejected Israel's proposal to assassinate Iran’s Supreme Leader Ayatollah Ali Khamenei, a U.S. official told NBC News.  Vaughn Hillyard reports. #politics #israel #iran ",
        "view_count": 2164961,
        "id": 7516281272721771822,
        "like_count": 80740,
        "comment_count": 3737,
        "create_time": 1750020637
      },
      {
        "comment_count": 10408,
        "like_count": 1045149,
        "region_code": "US",
        "video_description": "People in all 50 states turned out on Saturday for the \"No Kings\" protests against Donald Trump, which were timed to coincide with the president's D.C. military parade. Here are some photos that defined the demonstrations. #trump #protest #breakingnews ",
        "create_time": 1749956438,
        "id": 7516005467496238379,
        "share_count": 12083,
        "username": "msnbc",
        "view_count": 8126766
      },
      {
        "id": 7516000062980246826,
        "like_count": 644534,
        "username": "msnbc",
        "create_time": 1749955160,
        "region_code": "US",
        "share_count": 12820,
        "video_description": "\"It may seem like a day to be fearful, and it's understandable. I woke up this morning and I felt scared...today, in the face of so many reasons to be anxious and so many reasons to be afraid — upwards of a million Americans showed just how fearless they are.\" @Briefing with Jen Psaki reports on the 'No Kings' protests nationwide in the face of the political violence in Minnesota. #news #minnesota #losangeles #washington #trump #politics #immigration",
        "view_count": 6379835,
        "comment_count": 10248
      },
      {
        "comment_count": 10184,
        "create_time": 1749953173,
        "id": 7515991479861398830,
        "like_count": 688395,
        "share_count": 14579,
        "username": "msnbc",
        "region_code": "US",
        "video_description": "NBC News’ Jacob Soboroff speaks with Ross Fuentes, a former Marine, about the military presence in Los Angeles. “It makes me feel sad because a lot of the people I see here, a lot of guys back here, a lot of Marines, they're all Hispanic...They are in a tough spot and I understand where they're coming from, too. Like I said, I was in their shoes at one point.\" #breakingnews #news #trump #losangeles #california #immigration ",
        "view_count": 6261532
      },
      {
        "share_count": 37,
        "comment_count": 134,
        "create_time": 1749951913,
        "region_code": "US",
        "video_description": "Despite rain and poor air quality, thousands gathered in Philadelphia for the \"No Kings\" protest, marching from Love Park to the Museum of Art. NBC News’ Erin McLaughlin asked attendees what motivated them to attend. #news  #trump  #philadelphia  #politics ",
        "view_count": 90240,
        "id": 7515986088809352494,
        "like_count": 4235,
        "username": "msnbc"
      },
      {
        "comment_count": 2876,
        "create_time": 1749946136,
        "id": 7515961274627362094,
        "video_description": "NBC News' Jacob Soboroff reports from L.A., as law enforcement on horses disperse crowds at the 'No Kings' protest. #california #losangeles #protest #news #politics  #breakingnews ",
        "like_count": 126999,
        "region_code": "US",
        "share_count": 4770,
        "username": "msnbc",
        "view_count": 861032
      },
      {
        "like_count": 44962,
        "video_description": "BREAKING: A federal jury finds MyPillow founder, Mike Lindell, defamed a former voting equipment firm employee after the 2020 presidential election.",
        "username": "msnbc",
        "view_count": 710403,
        "comment_count": 1666,
        "create_time": 1750118090,
        "id": 7516699822808649003,
        "region_code": "US",
        "share_count": 1274
      },
      {
        "username": "msnbc",
        "video_description": "WATCH: \"The fact that I'm able to practice my First Amendment right, which is what I signed up to go to the military for, is a beautiful thing.\" Former Marine Ross Fuentes shares his story about being arrested after attending protests against ICE raids in Los Angeles with Jacob Soboroff and Nicolle Wallace on “Deadline: White House.” #news #losangeles  #protest #politic ",
        "view_count": 143513,
        "comment_count": 288,
        "create_time": 1750114722,
        "id": 7516685318720949517,
        "like_count": 9244,
        "region_code": "US",
        "share_count": 212
      },
      {
        "username": "msnbc",
        "video_description": "Senate Minority Leader Chuck Schumer (D-N.Y.) slammed Sen. Mike Lee (R-Utah) over his social media posts mocking the attacks in Minnesota. \"I was deeply disappointed and sickened to see a member of this chamber use the tragedy in Minnesota to take cheap political shots at the other side on social media...what the senior senator from Utah posted after the shooting was reckless and beneath the dignity of his office,\" Schumer said.",
        "view_count": 1469229,
        "comment_count": 8905,
        "region_code": "US",
        "share_count": 1744,
        "create_time": 1750114506,
        "id": 7516684427603250445,
        "like_count": 185565
      },
      {
        "create_time": 1750108474,
        "like_count": 7164,
        "view_count": 89412,
        "comment_count": 543,
        "id": 7516658461275376939,
        "region_code": "US",
        "share_count": 268,
        "username": "msnbc",
        "video_description": "MSNBC political analyst @Molly Jong-Fast shares her take on the thousands who rallied at the nationwide 'No Kings' protests and why it proves \"that Americans can peacefully push back against the Trump administration.\" #trump #protest #news #politics"
      },
      {
        "comment_count": 1867,
        "create_time": 1750108285,
        "like_count": 23568,
        "share_count": 2710,
        "video_description": "President Donald Trump’s business organization has announced the creation of a new wireless phone service that will carry the president’s name. At the same time, the Trump Organization is also rolling out a $499 gold-colored phone, dubbed the T1, later this year as part of the service’s launch. MSNBC’s host of the @11th Hour MSNBC, @Stephanie Ruhle, breaks it all down. #trump #phone #tech #politics #news #apple #iphone",
        "view_count": 438139,
        "id": 7516657622846672142,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "comment_count": 11081,
        "share_count": 10401,
        "view_count": 1865296,
        "username": "msnbc",
        "video_description": "Nicolle Wallace reflects on the nationwide 'No Kings' protests, which organizers say drew millions of demonstrators. \"The American people, in historic numbers, have spoken up and said 'no'\" to President Donald Trump, Wallace said. #nokings #trump",
        "create_time": 1750107892,
        "id": 7516655978998238477,
        "like_count": 349571,
        "region_code": "US"
      },
      {
        "like_count": 1139,
        "username": "msnbc",
        "video_description": "This week, as the NBA Finals continue, NBA legend Doc Rivers joins Nicolle Wallace on \"The Best People\" podcast to talk about the dynamics of how Donald Trump won and why people move on too quickly from everything the president says. You can watch the full episode on YouTube. Link in bio. #MSNBC #TheBestPeople ",
        "region_code": "US",
        "share_count": 42,
        "view_count": 97629,
        "comment_count": 218,
        "create_time": 1750100019,
        "id": 7516622214309874987
      },
      {
        "create_time": 1750096039,
        "id": 7516605060713893162,
        "view_count": 292820,
        "comment_count": 1191,
        "like_count": 11150,
        "region_code": "US",
        "share_count": 572,
        "username": "msnbc",
        "video_description": "Acting U.S. Attorney for the District of Minnesota Joseph Thompson said Vance Boelter arrived at the Champlin home of state Sen. John Hoffman and his wife, Yvette Hoffman, in a black SUV with emergency lights turned on and a license plate that read \"police. \" Boelter was allegedly disguised as a police officer and dressed in a black tactical vest and body armor. Thompson said he was carrying a flashlight and a handgun and wearing a \"hyper realistic\" silicone mask. \"Sen. Hoffman had a security camera. I’ve seen the footage from that camera, and it is chilling,\" Thompson said. #news  #politics "
      },
      {
        "comment_count": 3289,
        "view_count": 998494,
        "create_time": 1750092910,
        "id": 7516591647493197069,
        "like_count": 21239,
        "region_code": "US",
        "share_count": 635,
        "username": "msnbc",
        "video_description": "Ahead of the G7 Summit in Alberta, Canada, President Trump told reporters that it was a “big mistake” for Russia to have been kicked out of the then-G8, which took place after Russia invaded Crimea. “[Putin] doesn’t even speak to the people that threw him out. And I agree with him,” Trump said. The president has previously criticized Russia’s removal from the group of leading industrialized nations. Trump said he did not believe there would have been a war between Russia and Ukraine if Russia were still part of the group. #trump #putin #russia #ukraine #g7 #politics #worldnews #news"
      },
      {
        "id": 7516581186152582442,
        "share_count": 166,
        "video_description": "The Hennepin County Attorney’s Office confirmed multiple charges have been filed against Minnesota shooting suspect Vance Boelter, and it will seek first-degree murder charges. Boelter was charged via a warrant issued nationwide with two counts of second-degree intentional murder and two counts of second-degree attempted intentional murder. #breakingnews  #news  #politics ",
        "create_time": 1750090483,
        "like_count": 12854,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 502565,
        "comment_count": 1131
      },
      {
        "id": 7516579994135563533,
        "view_count": 756557,
        "comment_count": 3290,
        "like_count": 54138,
        "region_code": "US",
        "share_count": 2265,
        "username": "msnbc",
        "video_description": "Sen. Mike Lee, R-Utah, is under fire for posting mocking images of the Minnesota shooting suspect, including one captioned, “This is what happens when Marxists don’t get their way.” Sen. Amy Klobuchar condemned the tweets on #MorningJoe, saying, “This is not a laughing matter, and certainly what we're seeing in increasing violence and this evil man who did this, this is not a joke.” #MSNBC #news #politics ",
        "create_time": 1750090210
      },
      {
        "like_count": 2756,
        "username": "msnbc",
        "video_description": "After what officials called the largest manhunt in state history, Vance Boelter was captured and charged with murdering Minnesota Rep. Melissa Hortman and her husband, and attempting to kill Sen. John Hoffman and his wife. Authorities say the attacks were politically motivated and that Boelter had a list of other lawmakers as potential targets. #news  #breakingnews  #minnesota  #politics ",
        "create_time": 1750079262,
        "id": 7516532781455904042,
        "region_code": "US",
        "share_count": 132,
        "view_count": 50535,
        "comment_count": 206
      },
      {
        "username": "msnbc",
        "view_count": 223915,
        "comment_count": 348,
        "id": 7516384459478928686,
        "like_count": 13467,
        "video_description": "DNC Chair Ken Martin, who formerly served as chair of the Minnesota Democratic-Farmer-Labor Party, mourns state Rep. Melissa Hortman and her husband Mark, who were shot and killed on Saturday. \"Melissa was a huge changemaker,\" Martin told Jen Psaki while fighting back tears.  #minnesota #breakingnews #gunviolence ",
        "create_time": 1750044671,
        "region_code": "US",
        "share_count": 129
      },
      {
        "view_count": 190471,
        "share_count": 213,
        "video_description": "“A confrontation in the hallways of Capitol Hill...is speaking volumes today about the toxic stew that permeates there. It's a mix of violent rhetoric and distrust and misinformation and right-wing information bubbles that is eating away at the foundations of the US Capitol and our democracy.\" MSNBC’s Nicolle Wallace shares her reaction to reports that Sen. Tina Smith, D-Minn., confronted Sen. Mike Lee, R-Utah, over controversial social media posts about the fatal attack on a Minnesota lawmaker and her husband. Sen. Lee later removed those posts on his personal X account. #minnesota #news ",
        "id": 7517070448274771213,
        "like_count": 13164,
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 550,
        "create_time": 1750204362
      },
      {
        "create_time": 1750200141,
        "like_count": 312,
        "region_code": "US",
        "view_count": 25313,
        "comment_count": 30,
        "id": 7517052328877231415,
        "share_count": 6,
        "username": "msnbc",
        "video_description": "Nicolle Wallace spoke with NBA legend Doc Rivers on her podcast \"The Best People\" where he compares the Republican and Democratic parties' current strategy, and how the Dems need to take a play out of the GOP's book \"if we want change.\" Click the link in bio to watch the full interview on YouTube or listen now, and subscribe to MSNBC Premium on Apple Podcasts for early access, ad-free listening, and bonus content. #docrivers #politics"
      },
      {
        "comment_count": 134,
        "video_description": "The American Bar Association, the country's largest organization of lawyers, filed a lawsuit against the Trump administration over what they call President Donald Trump's \"Law Firm Intimidation Policy.\" MSNBC legal correspondent Lisa Rubin explains the lawsuit and what she thinks is the most important takeaway. #lawyer #lawyer #trump",
        "view_count": 160651,
        "create_time": 1750200028,
        "id": 7517051823610449207,
        "like_count": 20589,
        "region_code": "US",
        "share_count": 915,
        "username": "msnbc"
      },
      {
        "share_count": 8490,
        "username": "msnbc",
        "video_description": "\"I believe it is important to show up and bear witness and accompany people and to do it in the tradition of nonviolent witness. We are not going to give Donald Trump and his goons any excuse for ratcheting up conflict or violence.\" New York City Comptroller Brad Lander speaks out after his arrest in connection with an episode at a federal courthouse in the city, where Lander and his wife said they were serving as advocates for defendants in immigration court. #breakingnews #newyork #nyc #newyorkcity #bradlander #immigration #politics #news",
        "view_count": 1573320,
        "id": 7517042932856278327,
        "region_code": "US",
        "like_count": 194779,
        "comment_count": 4561,
        "create_time": 1750197982
      },
      {
        "id": 7517006709672512799,
        "share_count": 141,
        "username": "msnbc",
        "video_description": "“He wants the spectacle, not just to distract, but to justify his undemocratic crackdowns and his authoritarian power grabs.” In remarks on the Senate floor this afternoon, Sen. Alex Padilla, D-Calif., addressed President Donald Trump’s handling of the Los Angeles protests. #news  #politics  #trump  #la ",
        "view_count": 103941,
        "comment_count": 846,
        "like_count": 4066,
        "region_code": "US",
        "create_time": 1750189524
      },
      {
        "region_code": "US",
        "view_count": 453259,
        "id": 7516998282451651870,
        "like_count": 23675,
        "share_count": 1771,
        "username": "msnbc",
        "video_description": "BREAKING: New York City Comptroller Brad Lander has been arrested for \"assaulting law enforcement and impeding a federal officer,\" the Department of Homeland Security said. The charges stem from an episode at a federal courthouse in the city, where Lander and his wife said they were serving as advocates for defendants in immigration court. Lisa Rubin has the latest with Katy Tur #breakingnews  #news  #nyc  #immigration  #politics ",
        "comment_count": 2473,
        "create_time": 1750187565
      },
      {
        "share_count": 121,
        "video_description": "Former Sen. Bob Menendez turned himself in Tuesday at a federal prison in Pennsylvania to begin serving an 11-year sentence on bribery charges. The former New Jersey senator was found guilty in July of taking part in a bribery scheme that rewarded him and his wife Nadine Menendez with hundreds of thousands of dollars in gold bars and stacks of cash. #menendez #newjersey #news #politics #trump",
        "create_time": 1750186951,
        "id": 7516995644607810847,
        "like_count": 5312,
        "view_count": 150936,
        "comment_count": 265,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "view_count": 4037853,
        "like_count": 558016,
        "username": "msnbc",
        "video_description": "Sen. Alex Padilla delivers an emotional speech on the Senate floor detailing his forced removal from DHS Secretary Kristi Noem's L.A. presser last week after he attempted to ask her a question. Padilla chokes up recounting telling his Senate colleagues, \"I pray you never have a moment like this.\" #MSNBC #news #politics #Senate #DHS ",
        "region_code": "US",
        "share_count": 20766,
        "comment_count": 20529,
        "create_time": 1750186370,
        "id": 7516993139773689119
      },
      {
        "share_count": 54,
        "video_description": "\"If what you saw happen can happen when the cameras are on, imagine not only what can happen but what is happening in so many places where there are no cameras.\" Sen. Alex Padilla, D-Calif., called Trump a \"tyrant\" in remarks on the Senate floor in which he recounted his forcible removal from Homeland Security Secretary Kristi Noem's news conference in Los Angeles. #california  #politics  #breakingnews ",
        "create_time": 1750185633,
        "id": 7516989991398952223,
        "like_count": 1825,
        "region_code": "US",
        "comment_count": 301,
        "username": "msnbc",
        "view_count": 40302
      },
      {
        "comment_count": 5197,
        "id": 7516985450897132830,
        "like_count": 62120,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 768099,
        "create_time": 1750184570,
        "share_count": 3572,
        "video_description": "At the G7, former President Trump claimed the war in Ukraine could have been avoided if Russia hadn’t been kicked out of the alliance—blaming Barack Obama and “a person named Trudeau.”  Joe Scarborough and Mika Brzezinski fact-check Trump’s claims on #MorningJoe, noting that Trudeau wasn’t even in office at the time, and Russia was expelled for its invasion of Crimea. #trump #factcheck #news #russia #ukraine "
      },
      {
        "like_count": 4934,
        "region_code": "US",
        "share_count": 420,
        "id": 7516985300048989470,
        "create_time": 1750184536,
        "username": "msnbc",
        "video_description": "BREAKING: New York City Comptroller Brad Lander was detained after an incident inside an immigration court in the city, a spokesperson for his mayoral campaign told NBC News. Lander’s press secretary, told NBC News in an email that “Brad was taken by masked agents and detained by ICE,” a reference to the U.S. Immigration and Customs Enforcement agency, after “escorting a defendant out of immigration court.”  NBC News’ Julia Ainsley has the latest with Chris Jansing. #news  #breakingnews  #nyc  #immigration ",
        "view_count": 121028,
        "comment_count": 630
      },
      {
        "username": "msnbc",
        "video_description": "While addressing the Senate for the first time since being forcibly removed from a press conference with Homeland Security Secretary Kristi Noem in Los Angeles last week, Senator Padilla called President Trump as a “tyrant” over his efforts to deploy the National Guard and federal law enforcement personnel to L.A. “Is that the precedent that we’re okay with setting?” Senator Padilla asked his colleagues on both sides of the aisle. #padilla #trump #la #losangeles  #ice #deportations #immigration #border #news #politics",
        "view_count": 43284,
        "create_time": 1750184131,
        "id": 7516983563091217695,
        "region_code": "US",
        "share_count": 46,
        "comment_count": 230,
        "like_count": 2264
      },
      {
        "like_count": 69401,
        "region_code": "US",
        "share_count": 5578,
        "video_description": "Rep. Greg Landsman (D-OH), who says his name was in the notes of the suspected Minnesota gunman who targeted lawmakers, shares his reaction to President Trump saying he will not call Minnesota Governor Tim Walz after the tragedy. #news  #politics  #trump  #minnesota ",
        "comment_count": 6461,
        "id": 7516959294391209229,
        "view_count": 788212,
        "create_time": 1750178520,
        "username": "msnbc"
      },
      {
        "create_time": 1750175478,
        "id": 7516946184452295950,
        "like_count": 3770,
        "region_code": "US",
        "share_count": 178,
        "username": "msnbc",
        "view_count": 149902,
        "comment_count": 489,
        "video_description": "As Israel escalates attacks on Iran, the White House scrambles to deny U.S. involvement and calls for an end to the conflict. Last night, Defense Secretary Pete Hegseth defended Trump’s approach as “peace through strength,” but critics—like Tucker Carlson—accused him of betraying “America First” ideals. #MorningJoe’s Joe Scarborough and Jonathan Lemire break down how Trump is caught between warring MAGA factions over U.S. engagement in the Middle East. #trump  #news  #politics  #washington "
      },
      {
        "view_count": 185148,
        "comment_count": 355,
        "id": 7516934744316202253,
        "like_count": 3287,
        "share_count": 60,
        "username": "msnbc",
        "video_description": "President Trump cut short his G7 trip, citing the escalating conflict in the Middle East and telling reporters, “Iran cannot have a nuclear weapon.” NBC’s Yamiche Alcindor reports that while Trump touted a new UK trade deal and met with other world leaders, his early departure—and a cryptic message telling people in Tehran to “stay safe”—sparked confusion and alarm. Despite initially resisting a joint G7 statement urging de-escalation, Trump now appears willing to sign, possibly with revised language. #trump  #middleeast  #news  #politics ",
        "create_time": 1750172809,
        "region_code": "US"
      },
      {
        "view_count": 1109486,
        "create_time": 1750165663,
        "id": 7516903860795968782,
        "like_count": 151957,
        "region_code": "US",
        "share_count": 7275,
        "video_description": "@The Rachel Maddow Show looks at the powerful movement building against Donald Trump and calls out how the president is losing some support among his base. \"He hasn't done anything as president that would win anyone over to his side. And the number of people who voted for him or supported him otherwise, who are now regretting it, grows by the day,\" Maddow says. #trump #news #politics #washington ",
        "comment_count": 5317,
        "username": "msnbc"
      },
      {
        "comment_count": 945,
        "like_count": 15233,
        "region_code": "US",
        "video_description": "@11th Hour MSNBC’s @Stephanie Ruhle calls out Sen. Mike Lee (R-Utah) for posting false claims to social media about the Minn. suspected shooter before he had any facts. #news #msnbc #utah #politics #socialmedia  ",
        "create_time": 1750162198,
        "id": 7516888964788243767,
        "share_count": 397,
        "username": "msnbc",
        "view_count": 186529
      },
      {
        "create_time": 1750123550,
        "like_count": 4063,
        "username": "msnbc",
        "comment_count": 239,
        "id": 7516723264153013546,
        "region_code": "US",
        "share_count": 52,
        "video_description": "Former Rep. Conor Lamb, D-Pa., joined @The Weeknight on MSNBC to discuss the escalating political rhetoric and violent threats, including the recent targeted shootings of two Minnesota state lawmakers. President Donald Trump has \"made politics about himself and his enemies,\" Lamb said. \"And you cannot claim to be either surprised or not responsible when people who are loyal to you and voted for you and believed in you then go off on their own in pursuit of those enemies.\" #trump ",
        "view_count": 146227
      },
      {
        "video_description": "NBA legend Doc Rivers sits down with Nicolle Wallace on her new podcast \"The Best People.\" They discuss the economy and why Rivers says \"what Republicans have done\" amounts to \"the greatest marketing coup in the history of marketing.\" Click the link in our bio to watch the full interview on YouTube. #nba #docrivers #politics #republicans #economy",
        "like_count": 8028,
        "create_time": 1750287855,
        "id": 7517428884887948558,
        "region_code": "US",
        "share_count": 736,
        "username": "msnbc",
        "view_count": 95219,
        "comment_count": 520
      },
      {
        "like_count": 12307,
        "username": "msnbc",
        "video_description": "@Katy Tur reacts to the viral clip of right-wing media personality Tucker Carlson clashing with Sen. Ted Cruz, R-Tex., in an interview — in which the senator was unable to answer questions about Iran. The clash underscores a broader split within the MAGA movement over U.S. involvement in the conflict between Israel and Iran. #trump #iran #tedcruz #tuckercarlson",
        "view_count": 313953,
        "comment_count": 984,
        "id": 7517427605969161485,
        "region_code": "US",
        "share_count": 499,
        "create_time": 1750287556
      },
      {
        "username": "msnbc",
        "video_description": "@Briefing with Jen Psaki shares her reaction to New York City Comptroller and mayoral candidate Brad Lander's arrest at a federal courthouse. \"The Trump administration is getting more aggressive about arresting or detaining these public officials. They are trying to normalize it, but with each new incident, people are learning how to stand up and fight back,\" Psaki said. #news  #politics  #trump ",
        "comment_count": 1764,
        "create_time": 1750278025,
        "like_count": 35320,
        "region_code": "US",
        "share_count": 1825,
        "id": 7517386752097520951,
        "view_count": 293935
      },
      {
        "region_code": "US",
        "share_count": 961,
        "username": "msnbc",
        "video_description": "A bipartisan group of lawmakers in the House and Senate are seeking to limit President Trump’s war powers as the conflict between Israel and Iran escalates. Sen. Chris Van Hollen (D-MD), a member of the Foreign Relations Committee, joins Chris Jansing to discuss. #news  #politics  #washington ",
        "comment_count": 1208,
        "id": 7517362778638781709,
        "like_count": 12084,
        "create_time": 1750272453,
        "view_count": 356253
      },
      {
        "id": 7517340671385161015,
        "like_count": 414920,
        "share_count": 11252,
        "username": "msnbc",
        "comment_count": 17396,
        "create_time": 1750267304,
        "region_code": "US",
        "video_description": "While testifying before the Senate Armed Services Committee, Defense Secretary Pete Hegseth defended his decision to restore the names of military bases that were originally named after Confederate leaders. Sen. Tim Kaine, D-Va., slammed Hegseth for not calling the families of relatives of the change. #news  #politics  #washington ",
        "view_count": 5102198
      },
      {
        "username": "msnbc",
        "video_description": "Senator Richard Blumenthal (D-CT) presses Secretary Hegseth on the use of active duty military troops in Los Angeles for law enforcement purposes and whether or not the Department of Defense has created contingency plans to deploy troops to other cities across the country.  “We can be alarmed by the attacks on ICE officers, yes,” said Sen. Blumenthal, “but, we ought ought to be equally alarmed by the illegal use of active duty Marines or other military.” #hegseth #ice #losangeles  #california #military #marines #government #news #politics",
        "comment_count": 1150,
        "like_count": 15078,
        "region_code": "US",
        "view_count": 234748,
        "create_time": 1750265634,
        "id": 7517333517194251533,
        "share_count": 378
      },
      {
        "comment_count": 228,
        "create_time": 1750265390,
        "id": 7517332390218370318,
        "region_code": "US",
        "share_count": 52,
        "username": "msnbc",
        "view_count": 46987,
        "like_count": 2704,
        "video_description": "New York City Comptroller and Mayoral Candidate Brad Lander joins Ana Cabrera to detail being detained by ICE agents while serving as an advocate for defendants in immigration court, saying “Trump is coming for our cities and for the rule of law.” #trump #bradlander  #nyc  #immigration #ice  #news "
      },
      {
        "create_time": 1750264216,
        "like_count": 18359,
        "video_description": "On #MorningJoe, John Heilemann and Joe Scarborough reacted to a new rift between Donald Trump and his intel chief, Tulsi Gabbard, after Gabbard released an unsanctioned video warning the U.S. is “on the brink of nuclear annihilation.”  Gabbard’s message, which criticized “political elite and warmongers,” reportedly caught the Trump White House off guard—and fueled a growing divide inside the MAGA base over U.S. involvement in Iran. #trump #tulsigabbard  #news #washington ",
        "view_count": 260380,
        "comment_count": 1177,
        "id": 7517327414326791479,
        "region_code": "US",
        "share_count": 1186,
        "username": "msnbc"
      },
      {
        "video_description": "The Supreme Court upheld a Tennessee law restricting gender transition care for minors, delivering a major blow to transgender rights . The 6-3 ruling is likely to have a broad impact as 24 other states have already enacted laws similar to the one in Tennessee, which bars gender transition surgery, puberty blockers and hormone therapy for youth. NBC News Legal Correspondent Lisa Rubin explains. #breakingnews  #news  #politics  #SCOTUS ",
        "comment_count": 547,
        "like_count": 2070,
        "share_count": 73,
        "username": "msnbc",
        "view_count": 60243,
        "create_time": 1750261422,
        "id": 7517315330197196046,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "share_count": 1628,
        "username": "msnbc",
        "video_description": "President Donald Trump declined to say whether he has made a decision on any U.S. military intervention in Iran. “I may do it. I may not do it,” Trump told reporters outside the White House. “Nobody knows what I’m going to do.” #news  #politics  #trump  #washington ",
        "view_count": 226267,
        "id": 7517308474766691597,
        "like_count": 17109,
        "comment_count": 1535,
        "create_time": 1750259803
      },
      {
        "comment_count": 240,
        "share_count": 98,
        "username": "msnbc",
        "video_description": "Reporting from just south of Tel Aviv, NBC News Chief Foreign Correspondent Richard Engel describes the aftermath of an Iranian ballistic missile strike that killed at least eight.  Engel details how Israel is systematically targeting Iran’s military infrastructure—and why most Israelis appear to support the conflict, despite no evacuation orders and rising tensions.  #news #trump #worldnews #middleeast",
        "view_count": 54657,
        "create_time": 1750258093,
        "id": 7517301104305032462,
        "like_count": 1716,
        "region_code": "US"
      },
      {
        "create_time": 1750211871,
        "like_count": 4396,
        "region_code": "US",
        "video_description": "“Even people who do what they’re supposed to can’t count on not being scooped up and deported.” In his first interview after being arrested at a federal court, New York City Comptroller Brad Lander speaks with @Chris Hayes on @All In with Chris Hayes about the Trump administration’s immigration policies. #trump #immigration #politics",
        "comment_count": 777,
        "id": 7517102680716758285,
        "share_count": 110,
        "username": "msnbc",
        "view_count": 137532
      },
      {
        "comment_count": 578,
        "create_time": 1750210887,
        "id": 7517098454754118925,
        "video_description": "\"There's no doubt they knew I was the comptroller.\" New York City Comptroller Brad Lander speaks with @Chris Hayes on @All In with Chris Hayes after his arrest in connection with an episode at a federal courthouse in the city, where Lander and his wife said they were serving as advocates for defendants in immigration court. The Department of Homeland Security said Lander, a mayoral candidate, had been arrested for \"assaulting law enforcement and impeding a federal officer.\" Lander denied assaulting law enforcement. #bradlander #nyc #newyork #immigration #news #politics",
        "view_count": 243231,
        "like_count": 16982,
        "region_code": "US",
        "share_count": 306,
        "username": "msnbc"
      },
      {
        "id": 7517073803688693006,
        "like_count": 3265,
        "video_description": "A federal court heard arguments over the Trump administration's use of the California National Guard in Los Angeles. NBC News' Jacob Soboroff joined @Katy Tur to discuss and to fact-check the government's argument. #trump #news #nationalguard #california ",
        "view_count": 53674,
        "comment_count": 144,
        "create_time": 1750205148,
        "username": "msnbc",
        "region_code": "US",
        "share_count": 120
      },
      {
        "share_count": 92,
        "view_count": 33333,
        "comment_count": 104,
        "create_time": 1750374805,
        "like_count": 1062,
        "region_code": "US",
        "id": 7517802355060968717,
        "username": "msnbc",
        "video_description": "“On this Juneteenth, let's think about freedom and what freedom really means as spelled out in our Constitution.” MSNBC Senior Contributing Editor Michele Norris reflects on the history of Juneteenth, drawing parallels to today’s widespread rollback of civil rights in America. #juneteenth #history #slavery #rights #dueprocess #politics #news "
      },
      {
        "username": "msnbc",
        "video_description": "NBC News’ Jacob Soboroff is on the ground outside of Dodgers Stadium where several anti-ICE protesters appear to be blocking federal agents from entering the sports venue. This is a developing story. #la #losangeles  #dodgers #dodgerstadium #ice #immigration #deportations #news ",
        "create_time": 1750366675,
        "share_count": 1979,
        "like_count": 25106,
        "region_code": "US",
        "view_count": 277595,
        "comment_count": 1036,
        "id": 7517767461031267598
      },
      {
        "comment_count": 621,
        "create_time": 1750361618,
        "share_count": 565,
        "username": "msnbc",
        "view_count": 232466,
        "id": 7517745715515264270,
        "like_count": 10057,
        "region_code": "US",
        "video_description": "President Donald Trump extended the deadline for TikTok’s parent company, ByteDance, to sell the short-form video app to an American owner by another 90 days. #politics  #news  #tiktok "
      },
      {
        "like_count": 5903,
        "share_count": 343,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Thursday, June 19 marks the Juneteenth holiday, the day in 1865 when enslaved African-Americans in Galveston, Texas learned they were free. Rev. Al Sharpton joined Morning Joe to reflect on the true history behind the holiday and warn against efforts to erase Black history from schools: “It’s not healthy for the country to show the progress this country made… and then try to eliminate the story from being told.” #news  #politics  #juneteenth  #washington ",
        "view_count": 74569,
        "comment_count": 247,
        "create_time": 1750358257,
        "id": 7517731355568901389
      },
      {
        "comment_count": 2607,
        "username": "msnbc",
        "view_count": 639508,
        "create_time": 1750356426,
        "id": 7517723422630219063,
        "like_count": 15377,
        "region_code": "US",
        "share_count": 1055,
        "video_description": "Trump will make a decision on whether the U.S. should get involved in the conflict between Israel and Iran within the next two weeks, White House press secretary Karoline Leavitt told reporters at the press briefing. Leavitt read aloud a message from Trump that said: \"Based on the fact that there's a substantial chance of negotiations that may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks.\" #breakingnews  #news  #politics  #trump "
      },
      {
        "share_count": 2536,
        "username": "msnbc",
        "video_description": "“What really makes America exceptional is that it’s the only big country on earth, and maybe the only real superpower in history, that is made up of people from every corner of the globe.” Speaking at an event in Hartford, Connecticut on Tuesday, former President Barack Obama shared his perspective on the current state of American politics and questioned the administration’s commitment to democracy. @Briefing with Jen Psaki  points out the contrasting view of the current and former president's vision for America. #news  #politics  #trump  #obama ",
        "view_count": 327265,
        "comment_count": 1952,
        "create_time": 1750350494,
        "region_code": "US",
        "id": 7517697920473287950,
        "like_count": 43992
      },
      {
        "username": "msnbc",
        "video_description": "A SpaceX Starship prototype exploded during a static-fire test late Wednesday night at the company’s Starbase facility in Boca Chica, Texas. SpaceX CEO Elon Musk said the cause may have been a nitrogen pressure vessel failure in the upper stage. No injuries were reported, and safety zones protected nearby communities. This marks the fourth Starship lost in 2025 as SpaceX continues rapid testing under FAA oversight. #news  #space  #spacex  #texas  #elonmusk ",
        "view_count": 1815232,
        "comment_count": 10245,
        "create_time": 1750347968,
        "id": 7517687079271222583,
        "like_count": 155913,
        "region_code": "US",
        "share_count": 18595
      },
      {
        "video_description": "@All In with Chris Hayes host @Chris Hayes reacts to clip of Tucker Carlson pressing Senator Ted Cruz (R-TX) on his knowledge of Iran. During the interview, Carlson asked Sen. Cruz if he knew the population of Iran.  When Sen. Cruz admitted that he didn’t know, Carlson responded, “You don’t know the population of the country you seek to topple?” #tuckercarlson #tedcruz #iran #maga #republicans #government #news #politics",
        "comment_count": 2477,
        "id": 7517685094971100429,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 684235,
        "create_time": 1750347500,
        "like_count": 76689,
        "share_count": 3005
      },
      {
        "comment_count": 1773,
        "region_code": "US",
        "share_count": 94,
        "video_description": "\"I was a student at Southern University, a historically Black university, when I learned the truth about Juneteenth and its correlation with our freedom,\" writes advocacy journalist and former Kennedy Center Citizen Artist Fellow Donney Rose. \"I may have heard of Juneteenth before then, but I couldn’t have told you that it fell on June 19 or that it celebrated the day after the Civil War when enslaved people in Galveston, Texas, learned they were free. I learned the truth because of the Afrocentric brothers and sisters on campus who more or less demanded that their schoolmates 'do the knowledge' about our history.\" \"We all know about Juneteenth now ... So why, just four short years after the recognition of a holiday commemorating freedom, does it feel like Black people are less free?\" Rose asks. Click the link in bio to read more.",
        "create_time": 1750344746,
        "id": 7517673207055387918,
        "like_count": 3238,
        "username": "msnbc",
        "view_count": 61492
      },
      {
        "id": 7517668910515195149,
        "region_code": "US",
        "video_description": "A woman who has been in the U.S. for more than 20 years, reported for an appointment at the South Loop immigration office after she received a text message. In response, her two sons, who are both serving in the National Guard, accompanied her, leaving with her when she departed three hours later. Andres Reyes said his mother has a work permit, and has lived in the Chicago area for decades. Chris Jansing shares more details. #ice #immigration #news #politics #trump #chicago ",
        "comment_count": 16288,
        "create_time": 1750343749,
        "like_count": 1233926,
        "share_count": 46352,
        "username": "msnbc",
        "view_count": 9414547
      },
      {
        "comment_count": 513,
        "username": "msnbc",
        "view_count": 257487,
        "create_time": 1750336894,
        "id": 7517639303015582990,
        "like_count": 15669,
        "region_code": "US",
        "share_count": 938,
        "video_description": "Former President Barack Obama, speaking at an event in Connecticut, said he's \"still optimistic\" about the future of the country. \"I don't think progress goes in a straight line. I think that there are times where you take two steps forward and you take one step back. There are times where you take one step forward and take two steps back. That's been true in the United States, that's been true around the world,\" Obama said. #obama #trump #news #washington #politics "
      },
      {
        "create_time": 1750332301,
        "id": 7517619416016719159,
        "like_count": 3409,
        "username": "msnbc",
        "video_description": "New York Times columnist Thomas L. Friedman joins #MorningJoe to discuss his latest piece, ‘The Smart Way for Trump to End the Israel-Iran War’ —  and warns that Trump is “now paying for the fact that he appointed a cabinet of knuckleheads… You know, you hire clowns, you get a circus, and who is in the room there giving him advice right now that is really scary.” #news #trump #middleeast #worldnews #politics",
        "comment_count": 331,
        "share_count": 261,
        "view_count": 108300,
        "region_code": "US"
      },
      {
        "id": 7517475856474787085,
        "like_count": 70967,
        "region_code": "US",
        "video_description": "Sen. Elissa Slotkin, D-Mich., questioned Defense Secretary Pete Hegseth at a Senate Armed Services Committee hearing about any orders he has given to the military in the deployment of troops to handle protests in Los Angeles in response to immigration actions by the administration. During the hearing, Slotkin said she was asking because Trump's defense secretary during his first term, Mark Esper, rejected such an order from Trump during protests after the death of George Floyd. She joined Nicolle Wallace on \"Deadline: White House\" to discuss her reaction to his response. #slotkin #hegseth #esper #donaldtrump #protests #news #politics ",
        "view_count": 510708,
        "comment_count": 2221,
        "create_time": 1750298776,
        "share_count": 3994,
        "username": "msnbc"
      },
      {
        "create_time": 1750291722,
        "like_count": 60585,
        "view_count": 670861,
        "video_description": "Former President Barack Obama issued a warning about the future of American democracy, cautioning that the country is “dangerously close” to normalizing behavior “consistent with autocracies.” Speaking at an event in Hartford, Connecticut, he offered thinly veiled criticism of President Donald Trump and questioned the administration’s commitment to democracy. “If you follow regularly what is said by those who are in charge of the federal government right now, there is a weak commitment to what we understood — and not just my generation, at least since World War II — our understanding of how a liberal democracy is supposed to work.\" #obama #news #politics #democrats #republicans ",
        "comment_count": 3845,
        "id": 7517445505438256439,
        "region_code": "US",
        "share_count": 2416,
        "username": "msnbc"
      },
      {
        "like_count": 55805,
        "region_code": "US",
        "share_count": 2897,
        "username": "msnbc",
        "video_description": "The City of Miami has agreed to partner with U.S. Customs and Immigration Enforcement. The federal program, known as 287(g), allows local police officers to perform certain federal immigration enforcement functions. Miami Commissioner Damian Pardo, who voted against the measure, joins Chris Jansing to discuss the large turnout of residents opposing the agreement. #miami #ice #deportation #immigrattion #politics #news ",
        "comment_count": 2564,
        "create_time": 1750291614,
        "id": 7517445084908965133,
        "view_count": 672357
      },
      {
        "like_count": 17510,
        "share_count": 240,
        "video_description": "“I was emotional for the first time.” NBA legend Doc Rivers sits down with Nicolle Wallace on her new podcast “The Best People” and recounts the moment he learned of former President Barack Obama’s first victory in 2008. Click the link in our bio to watch the full interview on YouTube or listen now, and subscribe to MSNBC Premium on Apple Podcasts for early access, ad-free listening, and bonus content. #docrivers #nba #obama #podcast #news #politics",
        "comment_count": 182,
        "create_time": 1750455848,
        "id": 7518150548403637518,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 176087
      },
      {
        "comment_count": 6507,
        "id": 7518133110903409934,
        "like_count": 71710,
        "share_count": 9536,
        "video_description": "While speaking to reporters, President Donald Trump said Tulsi Gabbard, his director of national intelligence, was \"wrong\" in suggesting that there is 'no evidence' Iran is building a nuclear weapon. #donaldtrump #tulsigabbard #iran #politics #news ",
        "view_count": 1299616,
        "create_time": 1750451783,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "comment_count": 293,
        "like_count": 4629,
        "share_count": 95,
        "video_description": "Mahmoud Khalil was granted release on bail by a federal judge after a hearing Friday, in the latest move in the pro-Palestinian activist's legal saga following his March arrest that spotlighted the Trump administration's deportation crackdown. #mahmoudkhalil #columbiauniversity #ice #donaldtrump #politics #news  ",
        "create_time": 1750445943,
        "id": 7518108011500522765,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 174159
      },
      {
        "video_description": "President Trump is weighing up his options for how he will address the conflict in the Middle East between Israel and Iran.  While he may not involve the U.S., the U.S. military has powerful options to use to strike Iranian nuclear sites if Trump chooses to act.  NBC's Courtney Kube joins Ana Cabrera to give an in-depth look at the 30,000 lb. \"bunker busting bomb\" the U.S. has at its disposal to strike the underground Fordo nuclear facility in Iran. #news #middleeast #trump #military ",
        "comment_count": 1765,
        "create_time": 1750443427,
        "id": 7518097215282253070,
        "like_count": 43020,
        "region_code": "US",
        "share_count": 2130,
        "username": "msnbc",
        "view_count": 653752
      },
      {
        "video_description": "BREAKING: The Supreme Court has ruled it will not fast track a challenge to President Trump’s tariffs that were brought by two toy companies, Learning Resources and Hands On. NBC News’ Gary Grumbach has the latest on the decision. #breakingnews  #news  #politics  #trump ",
        "comment_count": 195,
        "id": 7518096675227929911,
        "region_code": "US",
        "share_count": 28,
        "username": "msnbc",
        "view_count": 145828,
        "create_time": 1750443302,
        "like_count": 2897
      },
      {
        "comment_count": 1292,
        "share_count": 75,
        "username": "msnbc",
        "video_description": "The Supreme Court has upheld Tennessee’s ban on gender-affirming care for minors, in an opinion by Chief Justice John Roberts over dissent from the court’s Democratic appointees. Trans activist spoke about the impact for trans youth and how this decision may impact United States healthcare overall. For more information read the link in our bio. #politics  #news  #trans  #health  #supremecourt ",
        "view_count": 54825,
        "create_time": 1750440215,
        "id": 7518083416684907790,
        "like_count": 1260,
        "region_code": "US"
      },
      {
        "create_time": 1750439390,
        "id": 7518079860993035533,
        "region_code": "US",
        "share_count": 12353,
        "username": "msnbc",
        "video_description": "“We’re seeing every day there is no way to do this, what they want to do, mass deportations, that is not massively disruptive to the liberties of every American.” @All In with Chris Hayes breaks down the disruptive actions of ICE and Border Patrol agents who stop and demand proof of citizenship without just cause. #ice #immigration #deportation #trump #news #politics #government",
        "view_count": 674399,
        "comment_count": 4888,
        "like_count": 116303
      },
      {
        "video_description": "@Briefing with Jen Psaki points out the mistake some media outlets make in relaying Donald Trump's two-week deadline to make a decision on U.S. action on Iran, neglecting to also point out that Trump often promises to do things in two weeks, and seldom actually follows through. #news  #politics  #trump ",
        "comment_count": 5705,
        "id": 7518074388181257527,
        "share_count": 10149,
        "username": "msnbc",
        "view_count": 980979,
        "create_time": 1750438115,
        "like_count": 96259,
        "region_code": "US"
      },
      {
        "video_description": "Trump’s administration has introduced a wave of executive actions this year that critics say directly target LGBTQ+ rights— from banning gender-affirming care to eliminating DEI protections. Here’s what’s changed so far. #politics  #pride ",
        "view_count": 386662,
        "comment_count": 11446,
        "create_time": 1750434008,
        "share_count": 615,
        "username": "msnbc",
        "id": 7518056750390562061,
        "like_count": 16913,
        "region_code": "US"
      },
      {
        "like_count": 5997,
        "region_code": "US",
        "share_count": 361,
        "view_count": 126640,
        "comment_count": 1552,
        "create_time": 1750433447,
        "id": 7518054357300989239,
        "username": "msnbc",
        "video_description": "An appeals court ruled that Donald Trump acted within his authority when he federalized California’s National Guard during anti-immigration protests—despite Governor Gavin Newsom’s opposition.  But as NBC News’ legal correspondent Lisa Rubin explains on #MorningJoe, the decision raises broader questions about presidential power, with a potential “epical” Supreme Court fight ahead. #trump #immigration #california #losangeles  #news #law "
      },
      {
        "share_count": 3302,
        "username": "msnbc",
        "video_description": "In his Friday visit to Los Angeles, Vice President JD Vance accused California's top Democratic officials, including Gov. Gavin Newsom and Mayor Karen Bass, of \"encouraging\" violent protesters at the anti-ICE protests. Paola Ramos warns that the vice president's appearance and comments are an attempt to \"symbolically try to distort the reality\" of the protests. #losangeles #politics #news ",
        "view_count": 928427,
        "comment_count": 2283,
        "create_time": 1750541350,
        "region_code": "US",
        "id": 7518517683176951054,
        "like_count": 93253
      },
      {
        "comment_count": 190,
        "like_count": 5195,
        "region_code": "US",
        "share_count": 129,
        "video_description": "Puerto Rican rapper and singer Bad Bunny calls out ICE on Instagram. “Look, those motherf**kers are in these cars, RAV-4s. They’re here in Pontezuela. Sons of b***hes, instead of leaving the people alone and working there,” he said in Spanish in a video posted to his Instagram Stories. NPR reports that ICE has adopted more aggressive tactics in Puerto Rico under the current Trump administration. In an interview with the outlet, Rebecca González-Ramos, head of Homeland Security Investigations in Puerto Rico, said nearly 500 immigrants have been arrested for deportation on the island over the past four months. It’s unclear whether those filmed in Bad Bunny’s Instagram video were federal agents or if an ICE operation was underway. #badbunny #ICE #puertorico #politics #news ",
        "create_time": 1750536797,
        "id": 7518498100030311694,
        "username": "msnbc",
        "view_count": 51637
      },
      {
        "like_count": 3563,
        "share_count": 112,
        "username": "msnbc",
        "video_description": "A resurfaced video of RFK Jr. from 2023 shows him falsely linking the polio vaccine to other diseases. Ari Melber fact checks the heath secretary's claims.",
        "view_count": 39866,
        "comment_count": 260,
        "create_time": 1750532154,
        "id": 7518478188905843981,
        "region_code": "US"
      },
      {
        "comment_count": 126,
        "create_time": 1750527899,
        "id": 7518459875874098487,
        "region_code": "US",
        "share_count": 157,
        "username": "msnbc",
        "like_count": 7519,
        "video_description": "Mark Cuban revealed he was asked to submit vetting papers to be then-Vice President Kamala Harris' running mate in the 2024 presidential election. On \"The Best People,\" Kara Swisher told Nicolle Wallace that she's tried to get Cuban to run for president. Click the link in bio to listen to the full episode. #markcuban #kamalaharris #politics",
        "view_count": 204318
      },
      {
        "create_time": 1750522571,
        "like_count": 199485,
        "share_count": 3337,
        "username": "msnbc",
        "comment_count": 700,
        "id": 7518437006821608718,
        "region_code": "US",
        "video_description": "Former First Lady Michelle Obama and her brother, Craig Robinson, were guests on Wednesday’s episode of the Las Culturistas podcast with Matt Rogers and Bowen Yang. The siblings discussed their “I don’t think so, honey,” which is a trend of popular items they don’t support. Obama opened up about the one part of Washington, D.C. that she could live without.",
        "view_count": 1329337
      },
      {
        "view_count": 4265316,
        "comment_count": 11939,
        "like_count": 400310,
        "share_count": 9549,
        "video_description": "Vice President JD Vance called California Democratic Senator Alex Padilla by the wrong name during a visit to Los Angeles Friday. Padilla shares his reaction to Vance's error with @theweekendmsnbcam. \"He knows my name ... It's just an indicator of how petty and unserious this administration is,\" Padilla said. #jdvance #alexpadilla #politics #news",
        "create_time": 1750520534,
        "id": 7518428223244406030,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "create_time": 1750474435,
        "id": 7518230298040077582,
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 1448,
        "like_count": 23698,
        "share_count": 619,
        "video_description": "“What the Trump administration is currently doing day by day throughout American cities is so violent and indefensible, neighbors being chased and wrestled to the ground, folks being asked to show their papers, that Americans en masse are getting fed up.\" @Chris Hayes reports on the Vice President JD Vance's visit to L.A. amid the Trump administration's ongoing immigration raids on @All In with Chris Hayes. #news #immigration #trump #vance #politics ",
        "view_count": 348618
      },
      {
        "id": 7518218294118141198,
        "like_count": 293216,
        "share_count": 4553,
        "video_description": "During his visit to Los Angeles, Vice President JD Vance referred to Sen. Alex Padilla, as \"José Padilla,\" and accused him of engaging in \"political theater.\" Los Angeles Mayor Karen Bass condemned Vance for incorrectly naming the senator, saying he aimed to disrespect Padilla. #losangeles #karenbass #jdvance #alexpadilla #politics #news ",
        "view_count": 3409526,
        "comment_count": 12243,
        "create_time": 1750471630,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "username": "msnbc",
        "comment_count": 1299,
        "create_time": 1750470770,
        "id": 7518214583656434957,
        "video_description": "Vice President JD Vance bashed Democrats at the state, local and national levels during his visit to Los Angeles, accusing top California officials of encouraging violent protesters and Sen. Alex Padilla, whom he referred to as \"José Padilla,\" of engaging in \"political theater.\" Jacob Soboroff reports. #losangeles #alexpadilla #jdvance #protests #politics #news ",
        "view_count": 156933,
        "like_count": 13045,
        "region_code": "US",
        "share_count": 427
      },
      {
        "comment_count": 6450,
        "view_count": 764880,
        "username": "msnbc",
        "video_description": "The Trump administration will shut down the national LGBTQ youth suicide lifeline in 30 days. The agency said it will \"no longer silo LGB+ youth services\" — notably removing the \"T\" representing the trans community in the initialism.  MSNBC's Chris Jansing was joined by The Trevor Project's CEO, Jaymes Black, to discuss the impact. #lgbtq #trans #politics #trump ",
        "create_time": 1750470235,
        "id": 7518212324285648183,
        "like_count": 90342,
        "region_code": "US",
        "share_count": 6460
      },
      {
        "region_code": "US",
        "share_count": 875,
        "username": "msnbc",
        "video_description": "\"Whether you are a US citizen, an immigrant, or just a person on this land — doesn't mean that you are less of a human.\" Pro-Palestinian activist and Columbia University graduate Mahmoud Khalil was released from detention, ending more than three months of custody in a test of the executive branch's power to unilaterally act against legal U.S. residents. #columbia #trump #breakingnews ",
        "create_time": 1750466372,
        "id": 7518195688140721421,
        "view_count": 146897,
        "comment_count": 720,
        "like_count": 18122
      },
      {
        "create_time": 1750633654,
        "id": 7518914103935634702,
        "like_count": 64265,
        "region_code": "US",
        "share_count": 10741,
        "username": "msnbc",
        "video_description": "State Dept. advises American citizens abroad of \"potential for demonstrations against US citizens and interests abroad.\" Gabe Gutierrez has the latest. #iran #israel #politics #breakingnews ",
        "comment_count": 2471,
        "view_count": 1653614
      },
      {
        "video_description": "President Donald Trump raised the prospect of regime change in Iran in a Truth Social post, though he stopped short of explicitly saying the U.S. would pursue it. “It’s not politically correct to use the term ‘Regime Change,’ but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!” he wrote. The post marked a shift in tone from senior administration officials. @GabeGutierrez reports. #breaking  #iran  #news ",
        "view_count": 235673,
        "comment_count": 626,
        "region_code": "US",
        "share_count": 377,
        "username": "msnbc",
        "create_time": 1750632569,
        "id": 7518909486610795831,
        "like_count": 6242
      },
      {
        "create_time": 1750627630,
        "like_count": 43351,
        "share_count": 8006,
        "username": "msnbc",
        "view_count": 1828277,
        "comment_count": 1795,
        "id": 7518888263273254158,
        "region_code": "US",
        "video_description": "The Department of Homeland Security issued a new bulletin today warning of a \"heightened threat environment\" following the U.S. strikes on nuclear facilities in Iran. The bulletin warns that \"low-level cyber attacks against US networks by pro-Iranian hacktivists are likely, and cyber actors affiliated with the Iranian government may conduct attacks against US networks.\" DHS also warns of possible violence by independent actors. Gabe Gutierrez reports. #iran #trump #breakingnews "
      },
      {
        "video_description": "The Iranian parliament is moving to close the Strait of Hormuz following the U.S. attack on three of the country’s nuclear sites, according to Iranian state-owned media organization Press TV. About 20% of the world’s oil flows through the Strait of Hormuz, and any attempt to block it could have major global economic consequences. NBC News has not independently verified the closure of the waterway. #iran #trump #worldnews #politics",
        "view_count": 3040479,
        "create_time": 1750625162,
        "id": 7518877663277206797,
        "like_count": 93756,
        "username": "msnbc",
        "comment_count": 8439,
        "region_code": "US",
        "share_count": 7390
      },
      {
        "username": "msnbc",
        "video_description": "\"I think President Trump was wrong. He went against the Constitution.\" Rep. Adam Smith (D-Wash.), the top Democrat on the House Armed Services Committee, joined Chris Jansing on MSNBC Reports to discuss the legality of President Trump’s move to launch military strikes on Iran. #news  #politics  #iran  #washington ",
        "view_count": 291173,
        "region_code": "US",
        "share_count": 256,
        "comment_count": 2629,
        "create_time": 1750608390,
        "id": 7518805595072253239,
        "like_count": 12825
      },
      {
        "create_time": 1750601984,
        "id": 7518777976784293134,
        "like_count": 35752,
        "comment_count": 5678,
        "share_count": 1421,
        "username": "msnbc",
        "video_description": "Vice President JD Vance said during an interview on NBC News’ “Meet the Press,” that the U.S. is not at war with Iran, but with Tehran's nuclear weapons program. Council on Foreign Relations Edward R. Murrow Press Fellow Elise Labbot reacts on @theweekendmsnbcam. #breakingnews #iran #trump #middleeast #vance #jdvance",
        "view_count": 1167876,
        "region_code": "US"
      },
      {
        "comment_count": 456,
        "like_count": 2928,
        "region_code": "US",
        "view_count": 108387,
        "create_time": 1750600019,
        "id": 7518769564730133815,
        "share_count": 202,
        "username": "msnbc",
        "video_description": "Joint Chiefs Chairman Dan Caine states the military strikes against Iran, called Operation Midnight Hammer, was successful in that it appears Iran did not fire on the U.S. aircraft at any point in the attack. The U.S. is calling the mission the country’s largest B-2 operational strike in U.S. history and the second-largest B-2 mission ever flown, only exceeded by missions after 9/11. #breakingnews  #news  #politics  #iran #washington "
      },
      {
        "create_time": 1750598388,
        "share_count": 92,
        "username": "msnbc",
        "view_count": 68638,
        "comment_count": 653,
        "id": 7518762544186527031,
        "like_count": 1641,
        "region_code": "US",
        "video_description": "Defense Sec. Pete Hegseth says that following U.S. strikes on Iran, the country's \"nuclear ambitions have been obliterated.\" #iran #breakingnews #politics #middleeast #trump"
      },
      {
        "comment_count": 4036,
        "like_count": 71749,
        "region_code": "US",
        "video_description": "Iranian Foreign Minister Abbas Araghchi strongly condemned U.S. attacks on Iran, saying the Trump administration \"is solely and fully responsible for the dangerous consequences and far-reaching implications of its act of aggression.\"",
        "view_count": 1418788,
        "create_time": 1750596877,
        "id": 7518755936974982414,
        "share_count": 3766,
        "username": "msnbc"
      },
      {
        "share_count": 12117,
        "view_count": 3465461,
        "comment_count": 6621,
        "id": 7518623304354155790,
        "like_count": 118483,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "In addition to the U.S. bombs dropped on Iranian nuclear sites, U.S. Navy ships also launched 30 Tomahawks into Iran, according to two defense officials to NBC News. The Tomahawks were launched from Navy submarines. #breaking  #iran  #news ",
        "create_time": 1750565939
      },
      {
        "create_time": 1750562742,
        "id": 7518609567832476983,
        "like_count": 15752,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "BREAKING: In a post on Truth Social, President Trump warns that any Iran retaliation will be met with \"force far greater” than bombings. Monica Alba reports. #donaldtrump #iran #politics #news ",
        "comment_count": 2133,
        "share_count": 790,
        "view_count": 708211
      },
      {
        "create_time": 1750559167,
        "id": 7518594256399781134,
        "video_description": "President Donald Trump announced that U.S. forces bombed three nuclear sites in Iran, Rachel Maddow reports. #politics  #news  #breaking ",
        "view_count": 460285,
        "comment_count": 2017,
        "like_count": 22633,
        "region_code": "US",
        "share_count": 1819,
        "username": "msnbc"
      },
      {
        "view_count": 1299832,
        "comment_count": 3314,
        "id": 7518572738248822029,
        "share_count": 13765,
        "username": "msnbc",
        "video_description": "President Donald Trump said U.S. air forces dropped bombs on three nuclear sites in Iran today. \"We have completed our very successful attack on the three Nuclear sites in Iran, including Fordow, Natanz, and Esfahan,\" he said on Truth Social in a statement also distributed to media via email. #iran #donaldtrump #politics #news ",
        "create_time": 1750554164,
        "like_count": 45223,
        "region_code": "US"
      },
      {
        "video_description": "DEVELOPING: Qatar's Al Udeid Air Base was attacked by Iranian short-range and medium-range ballistic missiles today, two U.S. officials confirmed today. The Al Udeid Air Base is one of several U.S. military bases across the region and close to Iran. There are no reports of U.S. casualties at this time, they added. NBC News' Courtney Kube has the latest. #breakingnews  #news  #politics  #washington  #iran ",
        "create_time": 1750709648,
        "like_count": 8063,
        "share_count": 674,
        "username": "msnbc",
        "view_count": 478459,
        "comment_count": 526,
        "id": 7519240487669206285,
        "region_code": "US"
      },
      {
        "video_description": "\"I'm a veteran of the war in Iraq. I remember what that debate was — at least there was a debate. We've had no chance to have a debate to present evidence to the American people, to see the case the administration is making for why they should authorize these strikes.\" Rep. Chris Deluzio, D-Pa., a member of the House Armed Services Committee and a former Iraq War veteran, joins Ana Cabrera to discuss the U.S. strikes on Iran. #news  #politics  #washington  #trump #iran ",
        "view_count": 961777,
        "share_count": 1539,
        "username": "msnbc",
        "id": 7519192337436658958,
        "like_count": 54820,
        "region_code": "US",
        "comment_count": 10432,
        "create_time": 1750698427
      },
      {
        "create_time": 1750698061,
        "like_count": 10035,
        "region_code": "US",
        "share_count": 165,
        "username": "msnbc",
        "comment_count": 327,
        "video_description": "Ana Cabrera reports that President Trump and NATO leaders are set to meet for a two-day summit amid Middle East tensions. #breakingnews  #iran  #trump  #nato ",
        "view_count": 290466,
        "id": 7519190724810755341
      },
      {
        "create_time": 1750693457,
        "id": 7519170895714241805,
        "region_code": "US",
        "share_count": 47,
        "video_description": "New reporting from The Atlantic reveals that despite President Trump’s two‑week diplomacy window, military preparations were already in motion — even B‑2 bombers had taken off ahead of the public deadline. Jonathan Lemire joins Morning Joe to break down how the White House used the delay as a strategic cover for military action. #breakingnews  #iran  #trump ",
        "view_count": 130381,
        "comment_count": 296,
        "like_count": 2076,
        "username": "msnbc"
      },
      {
        "username": "msnbc",
        "view_count": 2855590,
        "create_time": 1750637070,
        "id": 7518928765901212941,
        "like_count": 90711,
        "region_code": "US",
        "share_count": 11869,
        "comment_count": 5261,
        "video_description": "Iran sent a communiqué to Trump in the days before last night's strikes on its nuclear facilities threatening to activate sleeper-cell terror inside the United States if it were attacked, sources said. The message got to Trump through an intermediary at the G7 summit in Canada last week, which Trump left early June 16 to consider his options amid the conflict between Israel and Iran, according to sources who include two U.S. officials and a person with knowledge of the threat. #iran #trump #breakingnews "
      },
      {
        "region_code": "US",
        "video_description": "“He’s 22-years-old, one year out of college with no evident national security experience whatsoever.” After the Department of Homeland Security warned that “the ongoing Israel-Iran conflict could contribute to US-based individuals plotting additional attacks,” @The Rachel Maddow Show shares her take on Trump’s pick in charge of overseeing the government’s main hub for terrorism prevention, Thomas Fugate. #trump #nationalsecurity #dhs #news #politics #government",
        "view_count": 835501,
        "id": 7519646380223204663,
        "create_time": 1750804122,
        "like_count": 92888,
        "share_count": 16459,
        "username": "msnbc",
        "comment_count": 8774
      },
      {
        "create_time": 1750803341,
        "like_count": 4113,
        "view_count": 139062,
        "comment_count": 174,
        "id": 7519643039283809549,
        "region_code": "US",
        "share_count": 177,
        "username": "msnbc",
        "video_description": "The FBI is reassigning some agents who focus on national security — and who had been pulled from their duties to work on immigration cases — back to their old jobs out of concern over potential Iran-related threats, four people with direct knowledge of the matter told NBC News. Ken Dilanian, NBC News' justice and intelligence correspondent, reports. #MSNBC #news #politics #Trump #exclusive #FBI "
      },
      {
        "create_time": 1750800920,
        "id": 7519632634394299703,
        "region_code": "US",
        "video_description": "During HHS Secretary Robert F. Kennedy Jr.’s hearing before a House Energy and Commerce Subcommittee on Health, RFK Jr. was asked to recant allegations he made about Rep. Frank Pallone (D-N.J.), saying Pallone received contributions from pharmaceutical companies. After an exchange, Subcommittee Chair Buddy Carter (R-Ga.) asked Kennedy to retract his words. #rfkjr  #news  #politics ",
        "view_count": 507392,
        "comment_count": 1655,
        "like_count": 12938,
        "share_count": 393,
        "username": "msnbc"
      },
      {
        "comment_count": 72,
        "like_count": 5309,
        "create_time": 1750800129,
        "id": 7519629093034380557,
        "region_code": "US",
        "share_count": 40,
        "username": "msnbc",
        "video_description": "\"First off, people who are 'alpha' don't go around calling themselves alpha.\" Nicolle Wallace sits down with the @MeidasTouch brothers in the latest episode of her podcast \"The Best People\" to discuss the MAGA manosphere and building resistance during Trump 2.0. Click the link in our bio to watch the full interview on YouTube or listen now, and subscribe to MSNBC Premium on Apple Podcasts for early access, ad-free listening, and bonus content. #trump #maga #podcast #politics",
        "view_count": 57324
      },
      {
        "create_time": 1750794819,
        "like_count": 56072,
        "username": "msnbc",
        "view_count": 946668,
        "comment_count": 6310,
        "id": 7519606366206430478,
        "region_code": "US",
        "share_count": 15213,
        "video_description": "In Florida, the state is moving ahead with plans to turn a field in the Everglades into “Alligator Alcatraz,” an immigration detention center. Officials say they are calling it that because the area is surrounded by alligators and pythons, among other things. #news  #politics  #trump  #florida  #everglades "
      },
      {
        "comment_count": 498,
        "create_time": 1750789529,
        "like_count": 21382,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "At Robert F. Kennedy Jr.’s hearing before the Congressional Commerce Health Subcommittee, the health secretary repeatedly stated 'radical transparency' during his opening statement. Later, ranking member Rep. Frank Pallone (D-NJ) called out and pressed Kennedy for his lack of 'radical transparency’ as RFK Jr. allegedly did not respond to any of his letters. #rfkjr  #news  #politics ",
        "id": 7519583608282107191,
        "share_count": 240,
        "view_count": 344106
      },
      {
        "comment_count": 116,
        "create_time": 1750784516,
        "id": 7519562026079833399,
        "like_count": 6885,
        "username": "msnbc",
        "video_description": "New York City voters head to the polls today to cast ballots in the Democratic mayoral primary and several other races. There are 11 candidates on the ballot for mayor. NBC News’ Vaughn Hillyard spoke with former New York Gov. Andrew Cuomo, Zohran Mamdani, a progressive state lawmaker and Brad Lander, New York City’s Comproller. #newyork #nyc #mayor  #news #election ",
        "view_count": 101149,
        "region_code": "US",
        "share_count": 64
      },
      {
        "comment_count": 412,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Erez Reuveni, a former DOJ lawyer who was dismissed after admitting the Trump administration made a mistake by deporting Kilmar Armando Abrego Garcia, is accusing Trump federal judge pick Emil Bove of being willing to defy court orders in order to advance the president’s agenda. According to a report by the New York Times, Reuveni said in meetings surrounding the use of the Alien Enemies Act by the administration to deport undocumented people, Bove proposed violating court orders, telling staff that the DOJ would need to consider telling courts “f— you.” NBC News’ Ken Dilanian has the latest. #trump #emilbove #deportations #ice #justice #news #politics #government",
        "view_count": 239652,
        "create_time": 1750781251,
        "id": 7519548042173828366,
        "like_count": 14848,
        "share_count": 544
      },
      {
        "username": "msnbc",
        "comment_count": 778,
        "id": 7519531851027844366,
        "region_code": "US",
        "share_count": 817,
        "create_time": 1750777491,
        "like_count": 9631,
        "video_description": "President Trump, before departing for the NATO summit in The Hague, had tough words for both Israel and Iran after an hours-old ceasefire appeared to collapse.  “They don’t know what the f--- they’re doing,” he said, criticizing both nations for escalating despite the agreement. #trump #news #iran #israel #middleeast ",
        "view_count": 193220
      },
      {
        "comment_count": 1147,
        "create_time": 1750773756,
        "like_count": 20739,
        "region_code": "US",
        "share_count": 1466,
        "video_description": "DEVELOPING: Israel has accused Iran of what it described as a “severe violation” of President Donald Trump’s ceasefire — a charge Iran denies. #news #breakingnews #middleeast  #israel #iran #trump ",
        "view_count": 572655,
        "id": 7519515718640094478,
        "username": "msnbc"
      },
      {
        "like_count": 16670,
        "username": "msnbc",
        "video_description": "\"Since President Donald Trump ordered the U.S. military to attack three of Iran’s nuclear sites, congressional Democrats have glommed on to one talking point — the president has violated the Constitution by taking the country to war,\" writes MSNBC Columnist Michael A. Cohen. \"Democrats have a point, but these arguments would be far more potent if Democratic presidents hadn’t repeatedly acted the same way,\" Cohen writes. \"For decades now, presidents of both parties have been unilaterally taking the country to war.\" \"At the heart of this dispute lies a fundamental and unresolved constitutional debate — which branch of government is responsible for initiating military action?\" Click the link to read more. #trump #obama #iran",
        "comment_count": 1168,
        "create_time": 1750890840,
        "id": 7520018741732609294,
        "region_code": "US",
        "share_count": 1081,
        "view_count": 217923
      },
      {
        "create_time": 1750887176,
        "id": 7520002985783594254,
        "username": "msnbc",
        "view_count": 726497,
        "comment_count": 2506,
        "like_count": 42372,
        "region_code": "US",
        "share_count": 950,
        "video_description": "“It seems to me that would be something you’d remember, unless that’s the kind of thing you say frequently.” Senator Adam Schiff (D-CA) pressed Emil Bove — a former Trump defense attorney and current DOJ official nominated for a circuit court judgeship — over allegations that he encouraged DOJ lawyers to ignore court orders to advance the president’s agenda. When asked about whistleblower claims that he told DOJ staffers to say “f— you” to the courts, Bove said he had “no recollection” of making such a statement. He acknowledged, however, that he has encouraged department litigators to “fight hard for valid positions that we have to take in defense of our clients.” #trump #government #politics #bove #schiff #justice #news"
      },
      {
        "share_count": 127,
        "username": "msnbc",
        "video_description": "On the newest episode of “The Best People with Nicolle Wallace,\" Ben, Brett, and Jordy Meiselas of  MeidasTouch talk about what Democrats can learn from how Rep. Alexandria Ocasio-Cortez and Sen. Bernie Sanders communicate. Watch full episodes on YouTube now #MSNBC #TheBestPeople #YouTube #news #politics ",
        "view_count": 145768,
        "comment_count": 321,
        "create_time": 1750882929,
        "id": 7519984745900543287,
        "like_count": 11120,
        "region_code": "US"
      },
      {
        "id": 7519979026627218702,
        "like_count": 5696,
        "region_code": "US",
        "view_count": 107591,
        "comment_count": 196,
        "create_time": 1750881596,
        "share_count": 157,
        "username": "msnbc",
        "video_description": "After six months of aggressive immigration enforcement and promises to focus on deporting violent criminals, the Trump administration has arrested and detained a small fraction of the undocumented immigrants already known to Immigration and Customs Enforcement as having been convicted of sexual assault and homicide, internal ICE data obtained by NBC News shows.  NBC News’ homeland security correspondent Julia Ainsley reports. #immigration #ice #trump #news #politics "
      },
      {
        "create_time": 1750871926,
        "id": 7519937604817538318,
        "like_count": 25014,
        "username": "msnbc",
        "comment_count": 828,
        "share_count": 5930,
        "video_description": "NATO Secretary General Mark Rutte affectionately referred to President Trump as “Daddy” during a meeting between the two, after the president slammed Israel and Iran for continuing strikes despite a fragile ceasefire agreement. Trump was asked later about the comment made by his \"friend\" Rutte. #MSNBC #Trump #NATO #natosummit #news #politics ",
        "view_count": 482315,
        "region_code": "US"
      },
      {
        "id": 7519935818954181901,
        "like_count": 83408,
        "region_code": "US",
        "share_count": 6959,
        "video_description": "A California landscaper was violently detained by CBP agents, striking him several times before putting him in an unmarked car.  His son Alejandro Barranco, who is a Marine Corps Veteran, joins Ana Cabrera to react and to share how his father is doing now, saying “he’s defeated.” #immigration #trump #california #news #marine ",
        "create_time": 1750871510,
        "username": "msnbc",
        "view_count": 752461,
        "comment_count": 5285
      },
      {
        "create_time": 1750869005,
        "like_count": 2920,
        "video_description": "Before leaving the NATO summit in the Netherlands, President Trump said he had a good meeting with Ukrainian President Zelenskyy about Ukraine's conflict with Russia. \"Couldn't have been nicer, actually,\" he said, \"I took from the meeting that he'd like to see it end.” #news  #politics  #trump  #russia  #ukraine ",
        "view_count": 104998,
        "comment_count": 318,
        "region_code": "US",
        "share_count": 62,
        "username": "msnbc",
        "id": 7519925068613291278
      },
      {
        "view_count": 130169,
        "comment_count": 317,
        "create_time": 1750857202,
        "id": 7519874356655197495,
        "share_count": 507,
        "username": "msnbc",
        "video_description": "State Assemblyman Zohran Mamdani is the leader as first-choice votes are tallied in the New York City Democratic mayoral primary, ahead of former New York Gov. Andrew Cuomo, who declared his rival the winner even though no candidate is set to secure a majority in the first round of the ranked choice election. #MorningJoe panel discusses.  #nyc #newyork #news #zohranmamdani  #andrewcuomo ",
        "like_count": 6806,
        "region_code": "US"
      },
      {
        "comment_count": 2419,
        "id": 7519710911112727821,
        "like_count": 67380,
        "share_count": 2894,
        "video_description": "Jen Psaki debunks House Speaker Mike Johnson's claim that Trump's budget bill would not cut Medicaid — and breaks down why she thinks some Republicans are 'freaking out' over those very same cuts. @Briefing with Jen Psaki #politics #news #trump ",
        "create_time": 1750819144,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 609091
      },
      {
        "region_code": "US",
        "share_count": 4299,
        "username": "msnbc",
        "id": 7519693679246724365,
        "create_time": 1750815129,
        "like_count": 56452,
        "video_description": "After Narciso Barranco, a landscaper in California, was pinned down and violently detained by federal immigration agents, his son — who has served in the U.S. Marine Corps — is speaking out about what happened to his father. NBC News' Jacob Soboroff spoke to Alejandro Barranco, who said he feels \"heartbroken\" and \"betrayed\" by what happened. In a statement, a spokesperson for the Department of Homeland Security said Barranco \"refused to comply every step of the way\" and that agents used \"the minimum amount of force necessary to resolve the situation.\"",
        "view_count": 871214,
        "comment_count": 2561
      },
      {
        "comment_count": 176,
        "create_time": 1750812904,
        "id": 7519684105852800270,
        "video_description": "An initial assessment by the Defense Intelligence Agency concludes that the U.S. airstrikes conducted over the weekend on Iran’s nuclear enrichment sites were not as effective as President Donald Trump said and only set the country's nuclear program back by three to six months, according to three people with knowledge of the report. The assessment’s conclusions were first reported by CNN. NBC News justice and intelligence correspondent, Ken Dilanian, breaks down the new reporting. #news #iran #trump #politics ",
        "like_count": 2843,
        "region_code": "US",
        "share_count": 89,
        "username": "msnbc",
        "view_count": 98979
      },
      {
        "comment_count": 8394,
        "like_count": 135857,
        "region_code": "US",
        "share_count": 4578,
        "username": "msnbc",
        "view_count": 1657384,
        "create_time": 1750977218,
        "id": 7520389832695221559,
        "video_description": "Defense Secretary Pete Hegseth told Jennifer Griffin, his former colleague and Fox News correspondent, that she has been \"about the worst\" when she asked whether Iran had moved uranium from the Fordo nuclear facility ahead of the Trump-backed strikes. Nicolle Wallace reacts, saying, “Why does the Trump administration respond to questions from reporters or lawmakers trying to ascertain the success of the mission in striking Iran’s nuclear program by attacking everybody asking those questions?” #iran #trump #politics "
      },
      {
        "comment_count": 2654,
        "create_time": 1750971950,
        "region_code": "US",
        "video_description": "Coming out of a classified briefing with top Cabinet officials, Sen. Chris Murphy (D-CT) said it \"still appears that we have only set back the Iranian nuclear program by a handful of months.\" \"I walk away from that briefing still under the belief that we have not obliterated the programs,\" he added. \"The president was deliberately misleading the public when he said the program was obliterated.\"",
        "id": 7520367200398593293,
        "like_count": 3938,
        "share_count": 133,
        "username": "msnbc",
        "view_count": 172003
      },
      {
        "video_description": "WATCH: On this day 10 years ago, President Barack Obama sang ‘Amazing Grace’ during a eulogy for the victims of the Charleston church shooting in 2015. Nine people were killed during the hate crime, including state senator Reverend Clementa Pinckney. #obama #amazinggrace #church #charleston  #politics",
        "share_count": 2917,
        "create_time": 1750969585,
        "id": 7520357049629183287,
        "like_count": 48896,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 447976,
        "comment_count": 1255
      },
      {
        "id": 7520344593758440759,
        "region_code": "US",
        "share_count": 630,
        "username": "msnbc",
        "video_description": "Sen. Richard Blumenthal (D-CT) called out Emil Bove, former Trump defense lawyer and who was nominated for a circuit court judge position, on his dodging of questions during his confirmation hearing. \"You have the opportunity to clear the air, to come clean with the American people as well as this committee,\" said Sen. Blumenthal, \"And you are evading and avoiding these questions.\" #trump #emilbove #hearing #justice #government #politics #news",
        "view_count": 480160,
        "comment_count": 1939,
        "create_time": 1750966684,
        "like_count": 31502
      },
      {
        "like_count": 13498,
        "share_count": 662,
        "view_count": 240890,
        "comment_count": 633,
        "create_time": 1750959691,
        "id": 7520314537468382519,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Senate Republicans hit a roadblock after the parliamentarian rejected a key Medicaid provision in their tax and spending plan. Sen. Dick Durbin joins #MorningJoe to respond, calling the ruling “a relief” and blasting GOP cuts to working-class health coverage: “We've got to make it clear to the American people that there's a choice ahead of us that's going to change the lives of many hard working families.” #news  #politics  #washington  #senate "
      },
      {
        "region_code": "US",
        "username": "msnbc",
        "video_description": "During a Pentagon briefing Thursday morning Defense Secretary Pete Hegseth and Chairman of the Joints Chiefs of Staff General Dan Caine, provided more details of the U.S. strike on Iran. Although, several questions still remain and no new details were given on the intelligence assessments of the damage that was caused by the U.S. NBC News' Courtney Kube breaks it all down. #news  #politics  #trump  #washington  #pentagon ",
        "comment_count": 312,
        "create_time": 1750958297,
        "id": 7520308553689664781,
        "like_count": 5126,
        "share_count": 90,
        "view_count": 160730
      },
      {
        "video_description": "Iranian Supreme Leader Ayatollah Ali Khamenei broke his weeklong silence, claiming in a televised speech that his country had secured a victory over Israel and delivered a \"slap in the face\" to Washington. #MSNBC #news #breakingnews #Trump #Iran #Israel #politics ",
        "comment_count": 1594,
        "like_count": 25709,
        "username": "msnbc",
        "share_count": 970,
        "view_count": 968628,
        "create_time": 1750954606,
        "id": 7520292719353138446,
        "region_code": "US"
      },
      {
        "video_description": "After being pressed on why his initial comments credited only “the boys” involved in the Iran strikes, Defense Secretary Pete Hegseth defends his phrasing and mocks the reporter’s question: “We don’t play your little games.”  #news #politics #military #washington #petehegseth ",
        "view_count": 1410431,
        "region_code": "US",
        "share_count": 4303,
        "username": "msnbc",
        "like_count": 69058,
        "comment_count": 9076,
        "create_time": 1750954362,
        "id": 7520291658685058359
      },
      {
        "view_count": 123644,
        "like_count": 5713,
        "region_code": "US",
        "share_count": 229,
        "username": "msnbc",
        "video_description": "When asked whether Iran moved enriched uranium before the U.S. strike, Defense Secretary Pete Hegseth offered no direct answer—accusing Fox News reporter and his former colleague Jennifer Griffin, of being someone who “misrepresents the most” what the president says. NBC News’ David Rohde and Jonathan Lemire react: “It was a successful mission. I salute the men and women who carried it out, but I think distracting people by blaming the press and not addressing the real issues… national security needs facts and honest debate, and that’s what’s so concerning.” #trump #news #iran #petehegseth #military #washington ",
        "comment_count": 843,
        "create_time": 1750952020,
        "id": 7520281600295210254
      },
      {
        "region_code": "US",
        "share_count": 57,
        "username": "msnbc",
        "view_count": 56843,
        "comment_count": 195,
        "create_time": 1750951572,
        "id": 7520279686962777358,
        "like_count": 1423,
        "video_description": "Supreme Court rules for South Carolina over its effort to defund Planned Parenthood, concluding that individual Medicaid patients cannot sue to enforce their right to pick a medical provider. The court held in a 6-3 ruling on ideological lines with the conservative justices in the majority that the federal law in question does not allow people who are enrolled in the Medicaid program to file such claims. #MSNBC #news #breakingnews #supremecourt #SCOTUS #politics #plannedparenthood #Medicaid "
      },
      {
        "comment_count": 2814,
        "create_time": 1750902910,
        "like_count": 94962,
        "username": "msnbc",
        "id": 7520070622760734007,
        "region_code": "US",
        "share_count": 1938,
        "video_description": "EXCLUSIVE: Zohran Mamdani tells Jen Psaki that Cuomo conceding the NYC mayoral race is a \"larger referendum\" on the Democratic Party. \"One of the hopes that we had from the very beginning of this campaign was to move our political instinct from lecturing to listening,\" Mamdani said. @Briefing with Jen Psaki #nyc #newyork #zohranmamdani #zohran ",
        "view_count": 984922
      },
      {
        "like_count": 211515,
        "share_count": 7328,
        "username": "msnbc",
        "video_description": "Sen. Bernie Sanders (I-Vt.) says Zohran Mamdani’s successful Democratic primary campaign for New York City mayor “showed that people are prepared to stand up and fight for change.” \"...will the Democratic leadership learn from his campaign? I doubt it,\" Sanders told Chris Hayes. \"I think they would rather go down with the Titanic than give up the fact that they are captains of the boat.\" @All In with Chris Hayes @Chris Hayes #nyc #newyork #zohranmamdani #zohran #berniesanders",
        "comment_count": 7193,
        "create_time": 1750901508,
        "view_count": 1977682,
        "id": 7520064583399116046,
        "region_code": "US"
      },
      {
        "video_description": "Nicolle Wallace breaks down Sen. Mitch McConnell's response to the proposed Medicaid cuts in the GOP's budget megabill. According to Punchbowl News, the senator said in a closed-door meeting that constituents will \"get over\" the cuts. Republicans are \"doubling and tripling down today on their naked callousness and public indifference to the suffering of their own constituents,\" Wallace said.  #politics #medicaid #trump ",
        "view_count": 594442,
        "create_time": 1750899875,
        "username": "msnbc",
        "like_count": 68300,
        "region_code": "US",
        "share_count": 2108,
        "comment_count": 3207,
        "id": 7520057532153466126
      },
      {
        "comment_count": 1686,
        "create_time": 1751065424,
        "like_count": 18922,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 317220,
        "id": 7520768555906829582,
        "share_count": 565,
        "video_description": "University of Virginia President James E. Ryan is resigning under pressure from the Trump administration amid a Justice Department investigation into the school’s diversity practices. The Justice Department reportedly demanded that Ryan step down to resolve its probe of the university’s diversity, equity and inclusion initiatives, according to The New York Times. Nicolle Wallace reports on this \"extraordinary new tactic to aggressively harass universities.\" #politics #college #virginia #trump "
      },
      {
        "create_time": 1751058058,
        "id": 7520736909996477709,
        "username": "msnbc",
        "video_description": "President Trump signaled he could order additional strikes on Iran if new intelligence indicates the country is enriching uranium at levels that \"concern\" him. “Without question. Absolutely,” he said. #trump #politics #iran ",
        "comment_count": 620,
        "region_code": "US",
        "share_count": 254,
        "view_count": 233226,
        "like_count": 8244
      },
      {
        "comment_count": 138,
        "create_time": 1751049820,
        "share_count": 76,
        "username": "msnbc",
        "video_description": "On the latest episode of “Can They Do That?” MSNBC legal correspondent Lisa Rubin sits down with three Democratic state attorneys general — Matthew Platkin, Keith Ellison and Kwame Raoul — to discuss their ongoing efforts to combat the Trump administration’s policies through litigation. Click the link in our bio to watch the full conversation on YouTube. #law #trump #politics  #government #news",
        "id": 7520701592161570061,
        "like_count": 3733,
        "region_code": "US",
        "view_count": 75876
      },
      {
        "id": 7520696101402332429,
        "like_count": 1522,
        "video_description": "New Jersey Attorney General Matthew Platkin, who helped lead the effort against President Trump’s birthright citizenship order, joins Chris Jansing to react to the Supreme Court's decision to not rule directly on Trump's executive order, but instead curb the power of lower courts to issue nationwide injunctions, calling it “unprecedented.” #birthrightcitizenhip #supremecourt #politics #news ",
        "comment_count": 157,
        "region_code": "US",
        "share_count": 68,
        "username": "msnbc",
        "view_count": 48101,
        "create_time": 1751048551
      },
      {
        "like_count": 75145,
        "comment_count": 3170,
        "create_time": 1751048414,
        "id": 7520695502795541815,
        "video_description": "MSNBC’s Chris Jansing explains the Supreme Court ruling curbing national injunctions on President Trump's effort to end automatic birthright citizenship. #news  #breakingnews  #politics  #trump  #SCOTUS ",
        "view_count": 743956,
        "region_code": "US",
        "share_count": 6410,
        "username": "msnbc"
      },
      {
        "id": 7520691662050495757,
        "like_count": 1145571,
        "video_description": "\"I strongly recommend that you do not try to cross the border with this meme on your phone.\" MSNBC's Catherine Rampell reports on a recent story of a Norwegian tourist who says he was detained and denied entry to the U.S. because immigration officials found on his phone a photo depicting Vice President JD Vance as a bald baby. U.S. Customs and Border Protection disputes the claim, saying that the tourist was denied entry because of his \"admitted drug use.\" #news  #politics  #JDvance  #vance  #washington ",
        "view_count": 9345831,
        "comment_count": 20075,
        "region_code": "US",
        "share_count": 120016,
        "username": "msnbc",
        "create_time": 1751047514
      },
      {
        "like_count": 52568,
        "username": "msnbc",
        "view_count": 785712,
        "comment_count": 1522,
        "create_time": 1751046276,
        "id": 7520686355572149559,
        "region_code": "US",
        "share_count": 1733,
        "video_description": "Part of Justice Sonia Sotomayor's blistering dissenting opinion in Trump v. CASA.   Sotomayor read her dissent from the bench, the second time this term she has done this. Read her entire dissent and the birthright citizenship ruling. #breakingnews  #supremecourt  #politics "
      },
      {
        "comment_count": 1971,
        "like_count": 11896,
        "region_code": "US",
        "view_count": 302675,
        "create_time": 1751038654,
        "id": 7520653519582514445,
        "share_count": 702,
        "username": "msnbc",
        "video_description": "“They have put one hand behind the backs of those who are trying to fight against this administration.” MSNBC legal analyst Melissa Murray reacts to the Supreme Court’s 6-3 decision siding with the Trump administration in curbing nationwide injunctions granted against his birthright citizenship order. The decision didn’t decide the underlying legality of President Donald Trump’s attempt to restrict birthright citizenship. Litigation will continue on the issue in the lower courts and individual plaintiffs can still bring additional challenges against the order. #supremecourt #scotus #birthrightcitizenship #trump #politics #immigration #border #migrants #news"
      },
      {
        "comment_count": 818,
        "create_time": 1751037634,
        "id": 7520649140708085005,
        "share_count": 949,
        "video_description": "The Supreme Court sided with the Trump administration in curbing nationwide injunctions granted against his birthright citizenship order, in a 6-3 ruling with the court’s Republican-appointees in the majority and the Democratic appointees dissenting. The administration appealed to the justices after several lower court judges blocked President Donald Trump’s executive order attempting to restrict birthright citizenship. #breakingnews  #trump #politics #supremecourt ",
        "like_count": 9723,
        "region_code": "US",
        "username": "msnbc",
        "view_count": 317717
      },
      {
        "video_description": "Trump promised his 'golden phone' would be 'Made-in-the-USA' but now they're dropping the label. Stephanie Ruhle wonders whether they realized a $499 phone just can't be made here. #news  #politics  #trump ",
        "view_count": 877653,
        "comment_count": 2858,
        "id": 7520603859866225934,
        "region_code": "US",
        "username": "msnbc",
        "create_time": 1751027136,
        "like_count": 67598,
        "share_count": 4864
      },
      {
        "video_description": "Ten years ago, President Barack Obama delivered a eulogy for Rev. Clementa Pinckney—the pastor and state senator killed, along with eight others, in the Emanuel AME Church shooting in Charleston, South Carolina. At the College of Charleston arena, Obama led attendees in a powerful chorus of “Amazing Grace.” Rev. Al Sharpton reflects on the moment, calling it one “that defined his presidency.” #politics #obama #news ",
        "comment_count": 3688,
        "id": 7520441432197385485,
        "like_count": 81940,
        "region_code": "US",
        "share_count": 5980,
        "username": "msnbc",
        "view_count": 568618,
        "create_time": 1750989258
      },
      {
        "like_count": 14310,
        "username": "msnbc",
        "comment_count": 230,
        "create_time": 1750987954,
        "share_count": 376,
        "video_description": "It’s been a decade since the Supreme Court’s historic Obergefell v. Hodges decision legalized same-sex marriage nationwide. Jen Psaki shares her story about that day when she worked in the Obama White House. #whitehouse #pride #marriageequality #obama #politics #news ",
        "view_count": 95122,
        "id": 7520435845501865230,
        "region_code": "US"
      },
      {
        "like_count": 31244,
        "share_count": 487,
        "username": "msnbc",
        "comment_count": 3509,
        "id": 7521090077183806734,
        "region_code": "US",
        "video_description": "California Gov. Gavin Newsom has filed a $787 million lawsuit against Fox News, accusing host Jesse Watters of defamation by falsely claiming that Newsom had lied about a phone call with President Donald Trump during a dispute over the use of the National Guard in Los Angeles. “Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him,\" Fox News said in a statement. \"We will defend this case vigorously and look forward to it being dismissed.\" Nicolle Wallace breaks down the lawsuit. #newsom #gavinnewsom #trump #foxnews #politics #california #news",
        "view_count": 376190,
        "create_time": 1751140293
      },
      {
        "like_count": 14987,
        "share_count": 335,
        "username": "msnbc",
        "video_description": "On the newest episode of “The Best People with Nicolle Wallace,” Ben, Brett and Jordy Meiselas of MeidasTouch discuss their level of optimism amid the growing Trump resistance. Watch full episodes on YouTube now. #MSNBC #news #politics #TheBestPeople #youtube ",
        "view_count": 159597,
        "comment_count": 697,
        "create_time": 1751130846,
        "id": 7521049526900116750,
        "region_code": "US"
      },
      {
        "id": 7521043774743661837,
        "like_count": 64542,
        "video_description": "President Trump's Department of the Interior earlier this month ordered national parks to post signs prompting visitors to report \"any signs or other information that are negative about past or living Americans.\" But visitors to the parks have been pushing back, Jen Psaki reports. \"In ways big and small, Americans are finding ways to use their voices, or in this case, character count, to push back against Trump and his agenda, even on their visits to national parks, it seems.\" @Briefing with Jen Psaki #trump #nationalpark #nationalparks #news #politics",
        "comment_count": 1170,
        "create_time": 1751129506,
        "region_code": "US",
        "share_count": 2025,
        "username": "msnbc",
        "view_count": 551361
      },
      {
        "share_count": 291,
        "username": "msnbc",
        "comment_count": 618,
        "id": 7520797853002779917,
        "region_code": "US",
        "video_description": "EXCLUSIVE: Palestinian activist Mahmoud Khalil joins The Weekend: Primetime alongside his wife Dr. Noor Abdalla in an exclusive interview following his release from immigration detention. They discuss the federal judge’s ruling going against the Trump administration to release him, and the impact his detainment has had on their family. Watch the full interview on The Weekend: Primetime, Saturday at 6 p.m. ET on MSNBC.  #mahmoudkhalil #exclusive #news ",
        "view_count": 284631,
        "create_time": 1751072232,
        "like_count": 11581
      },
      {
        "region_code": "US",
        "share_count": 3060,
        "video_description": "BREAKING: Senate rejects bid to curb Trump's Iran war powers The Senate voted against a war powers resolution that would've required congressional approval before further military action in Iran, roughly a week after the U.S. bombed nuclear sites there. The vote was 47-53. #breakingnews #trump #iran ",
        "comment_count": 5060,
        "create_time": 1751071433,
        "id": 7520794467088092430,
        "like_count": 62194,
        "username": "msnbc",
        "view_count": 1748817
      },
      {
        "comment_count": 169,
        "create_time": 1751239547,
        "id": 7521516393691385143,
        "region_code": "US",
        "like_count": 1876,
        "share_count": 65,
        "username": "msnbc",
        "video_description": "Rev. Al Sharpton calls out corporate America for scaling back on Pride festivities as President Trump cracks down on LGBTQ protections nationwide. \"You can't stand for Pride when it's popular and then run away when the going gets tough,\" Rev. Sharpton said. #lgbtq #pride #news #politics ",
        "view_count": 28868
      },
      {
        "like_count": 4767,
        "region_code": "US",
        "share_count": 189,
        "video_description": "The Supreme Court delivered a major win to the Trump administration, allowing it for now to move forward with its plan to end automatic birthright citizenship. MSNBC legal correspondent Lisa Rubin explains what this means and what you need to know. #birthrightcitizenhip #supremecourt #donaldtrump #politics #news ",
        "view_count": 216179,
        "comment_count": 232,
        "create_time": 1751228126,
        "id": 7521467297282739470,
        "username": "msnbc"
      },
      {
        "comment_count": 1882,
        "region_code": "US",
        "video_description": "Sen. Thom Tillis, R-N.C., announced that he would not run for re-election, one day after he drew President Donald Trump’s ire for opposing the party’s sweeping domestic policy package. NBC News' Sahil Kapur explains why this is a \"huge deal\" for the Senate. #congress #senate #politics #trump #northcarolina",
        "create_time": 1751223711,
        "id": 7521448409610423565,
        "like_count": 54647,
        "share_count": 1003,
        "username": "msnbc",
        "view_count": 1369257
      },
      {
        "share_count": 20,
        "username": "msnbc",
        "video_description": "The Republican-led Senate on Saturday night advanced a sweeping domestic policy package for President Donald Trump’s agenda, moving it one step closer to passage ahead of a self-imposed deadline of July 4. Trump told Fox Business this morning that he doesn't know if the bill will pass on time, NBC News' Vaughn Hillyard reports. #donaldtrump #bigbeautifulbill #agenda #congress #whitehouse #congress ",
        "view_count": 46763,
        "comment_count": 134,
        "create_time": 1751221795,
        "like_count": 1088,
        "id": 7521440176644705591,
        "region_code": "US"
      },
      {
        "like_count": 5433,
        "username": "msnbc",
        "view_count": 91104,
        "id": 7521431609438965005,
        "create_time": 1751219806,
        "region_code": "US",
        "share_count": 102,
        "video_description": "Defense Secretary Pete Hegseth has announced that the Navy vessel named after celebrated gay rights activist and Navy veteran Harvey Milk will no longer carry his name. The hosts of @theweekendmsnbcam react. #navy #hegseth #trump #harveymilk #lgbt ",
        "comment_count": 493
      },
      {
        "create_time": 1751212273,
        "region_code": "US",
        "username": "msnbc",
        "comment_count": 464,
        "id": 7521399226316655886,
        "like_count": 2146,
        "share_count": 54,
        "video_description": "Mahmoud Khalil 'absolutely' still wants to obtain U.S. citizenship EXCLUSIVE: Mahmoud Khalil said he \"absolutely\" still wants to obtain U.S. citizenship, and that he doesn't have \"any regrets\" over his protests over Gaza. \"Protesting is the very American thing you would do in this country,\" Khalil said on The Weekend: Primetime. #mahmoudkhalil #politics #news ",
        "view_count": 71516
      },
      {
        "view_count": 108633,
        "comment_count": 274,
        "share_count": 101,
        "username": "msnbc",
        "video_description": "Former Minnesota House Speaker Melissa Hortman and her husband Mark Hortman were laid to rest at a private funeral on Saturday, weeks after the two were killed in what authorities have called a \"politically motivated assassination.\" Former President Joe Biden, former Vice President Kamala Harris and Minnesota Gov. Tim Walz were among the attendees. #minnesota ",
        "create_time": 1751207337,
        "id": 7521377932296703246,
        "like_count": 6015,
        "region_code": "US"
      },
      {
        "comment_count": 240,
        "create_time": 1751326927,
        "like_count": 5945,
        "share_count": 106,
        "username": "msnbc",
        "video_description": "Weeks after saying he would step back from politics to focus on his businesses, Elon Musk returned to bashing the GOP policy bill on social media. He also threatened once again to support primary challenges to lawmakers who vote for the bill. @Ari Melber 📺 🎤 breaks it down on The Beat. #MSNBC #thebeat #Musk #Trump #GOP #bill #news #politics ",
        "view_count": 195943,
        "id": 7521891717939842359,
        "region_code": "US"
      },
      {
        "comment_count": 115,
        "create_time": 1751316914,
        "id": 7521848819181440270,
        "like_count": 880,
        "share_count": 19,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "The monthlong celebration of LGBTQ Pride reached its peak this past weekend as huge crowds gathered from New York to San Francisco for all-day festivities. MSNBC spoke with attendees at the WorldPride celebration in Washington, D.C., about why Pride matters now — and what message they have for politicians pushing anti-LGBTQ policies. #lgbtq #pride #politics #news ",
        "view_count": 48134
      },
      {
        "share_count": 1105,
        "like_count": 12773,
        "region_code": "US",
        "id": 7521811420581842189,
        "username": "msnbc",
        "video_description": "Lara Trump is reportedly eyeing North Carolina’s Senate seat in the wake of Republican Sen. Thom Tillis’ retirement announcement.  A source close to the Trump family told NBC News. the president’s daughter-in-law — Fox News host and former Republican National Committee co-chair — is “strongly considering” jumping into the contest. #news  #politics  #trump  #northcarolina  #laratrump ",
        "view_count": 426139,
        "comment_count": 1815,
        "create_time": 1751308212
      },
      {
        "comment_count": 22,
        "id": 7521806811662486839,
        "like_count": 424,
        "username": "msnbc",
        "video_description": "“I’ve never felt so frozen... I’m living at the intersection of fascism and menopause, so I never know which one it is.” Nicolle Wallace sits down with Glennon Doyle and Abby Wambach for the latest episode of her podcast “The Best People” to discuss the current political environment and how they’re living through it. Click the link in our bio to watch the full interview on YouTube or listen now, and subscribe to MSNBC Premium on Apple Podcasts for early access, ad-free listening, and bonus content. #trump #politics #womenshealth #abbywambach #glennondoyle #podcast",
        "view_count": 25249,
        "create_time": 1751307137,
        "region_code": "US",
        "share_count": 15
      },
      {
        "id": 7521793336869473549,
        "region_code": "US",
        "comment_count": 14014,
        "create_time": 1751303996,
        "username": "msnbc",
        "video_description": "MSNBC’s Weekend Prime co-host Catherine Rampell presses New York mayoral candidate Zohran Mamdani about his plans to raise taxes on the wealthiest people living in the city. “The reason that I believe that we need to increase taxes on the 1% of the most profitable corporations is because of the fact that those are taxes that would then pay for a better quality of life for all,” Mamdani responded. #zohran #mamdani #newyork #nyc #money #taxes #economy #politics #news",
        "view_count": 3422087,
        "like_count": 230450,
        "share_count": 3193
      },
      {
        "comment_count": 4593,
        "share_count": 445,
        "username": "msnbc",
        "video_description": "House Minority Leader Hakeem Jeffries, a New York Democrat, is not ready to endorse Zohran Mamdani, for mayor of New York. Jeffries said he does not know Mamdani well. He also said Mamdani needs to “clarify” his position on using the phrase \"Globalize the intifada.” #politics  #mamdani  #jeffries  #news ",
        "view_count": 335389,
        "create_time": 1751303279,
        "id": 7521790256660679949,
        "like_count": 8366,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "username": "msnbc",
        "view_count": 133962,
        "create_time": 1751299270,
        "like_count": 3438,
        "share_count": 189,
        "video_description": "On Meet the Press, NYC mayoral candidate Zohran Mamdani declined multiple times to condemn the phrase “globalize the intifada,” saying, “That’s not language that I use” and arguing mayors shouldn’t “police speech.” Donny Deutsch weighed in on Morning Joe, calling the mayoral candidate’s stance “reckless and offensive”: “Let me tell you what it means to a Jew. It means violence. It means October 7. It means firebombing people in Colorado. It means violence.” #news #politics  #mamdani ",
        "comment_count": 1385,
        "id": 7521773028603137294
      },
      {
        "create_time": 1751298019,
        "share_count": 834,
        "comment_count": 925,
        "id": 7521767641141333262,
        "like_count": 20845,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "The Supreme Court has taken up a new challenge to campaign finance restrictions in a case brought by Republicans seeking to overturn limits on party committees spending money in coordination with individual candidates. The Supreme Court, which has a 6-3 conservative majority, has long been skeptical of campaign finance restrictions on free speech grounds, with its most notable ruling being the 2010 Citizens United v. FEC decision that paved the way for unlimited independent expenditures by outside groups. #breakingnews  #law #campaign  #politics  #washington ",
        "view_count": 785245
      },
      {
        "comment_count": 400,
        "like_count": 6443,
        "share_count": 242,
        "video_description": "Two firefighters were shot and killed while responding to a brush fire near Coeur d’Alene, Idaho, according to authorities. A third firefighter was out of surgery and in stable condition late Sunday. Investigators believe the suspected gunman — found dead on Canfield Mountain — intentionally set the fire to lure first responders before opening fire. The motive remains under investigation. NBC News’ Andrew Blankstein joins #MorningJoe with the latest. #news  #idaho ",
        "view_count": 175129,
        "create_time": 1751296063,
        "id": 7521759270203837709,
        "region_code": "US",
        "username": "msnbc"
      },
      {
        "view_count": 1389776,
        "comment_count": 8167,
        "create_time": 1751294687,
        "region_code": "US",
        "username": "msnbc",
        "video_description": "Zohran Mamdani, the presumptive Democratic nominee in New York City's mayoral race, sidestepped an opportunity to condemn the phrase \"globalize the intifada\" on Sunday, saying that mayors shouldn't \"police speech.\" \"That's not language that I use,\" Mamdani said when asked if he condemns the phrase, which is widely viewed by Jewish groups as offensive and antisemitic, on NBC News' \"Meet the Press.\" #news  #politics  #nyc  #mamdani ",
        "id": 7521753335066627341,
        "like_count": 88478,
        "share_count": 3241
      },
      {
        "share_count": 1752,
        "create_time": 1751292986,
        "region_code": "US",
        "like_count": 68630,
        "username": "msnbc",
        "video_description": "The Senate launched a marathon voting session on President Trump’s massive tax bill, racing to pass the legislation before the July 4 deadline. The measure—estimated to add over $3 trillion to the deficit—includes major cuts to Medicaid and SNAP, prompting backlash from Democrats and even some Republicans. Sen. Thom Tillis, who voted against advancing the bill, announced he won’t seek reelection, warning: “Republicans are about to make a mistake on health care.” NBC News’ Ryan Nobles breaks down the bill and what's at stake. #trump #news #senate #washington #politics ",
        "view_count": 816881,
        "comment_count": 1412,
        "id": 7521746027683138829
      }
    ]
  }
}