{
  "data": {
    "videos": [
      {
        "region_code": "US",
        "username": "npr",
        "video_description": "“Let this serve as a warning…” is part of a line from a Department of Homeland Security statement blocking Harvard University from enrolling international students because it says “Harvard’s leadership has created an unsafe campus environment by permitting anti-American, pro-terrorist agitators to harass and physically assault individuals, including many Jewish students, and otherwise obstruct its once-venerable learning environment.” The warning is “to all universities and academic institutions across the country.” per DHS. “Well, they said it and I have to believe it and I've repeated it myself, and that is how it's understood by the other leaders of other universities that I've spoken to. It is a warning. They see this as a message that if you don't comply with what we're demanding, these will be the consequences,” Harvard President Alan Garber told Morning Edition host  #NPR ",
        "create_time": 1748877958,
        "like_count": 4995,
        "share_count": 88,
        "view_count": 65244,
        "comment_count": 111,
        "id": 7511373435038108974
      },
      {
        "view_count": 5953,
        "comment_count": 9,
        "id": 7511372051823807787,
        "username": "npr",
        "share_count": 9,
        "video_description": "Have you ever gotten 'the ick'? Listen to It’s Been A Minute at the link in our bio.⁠ #NPR ",
        "create_time": 1748877642,
        "like_count": 452,
        "region_code": "US"
      },
      {
        "video_description": "From last August to this April, Elon Musk interacted with one particular X account on a near-daily basis: Mario Nawfal’s.⁠ ⁠ The Australian crypto entrepreneur mostly posts about current affairs, including false claims and unverified information. Stories from Nawfal’s account have catapulted into President Trump’s feed via Musk – who, despite a step back from his official goverment role, had a big influence on the Trump administration.⁠ ⁠ Nawfal told NPR that he doesn’t write his own posts, his team does. And, he says, they don’t vet the claims they post.⁠ ⁠ “How the hell can I know? It’s impossible to know,” Nawfal said. “Even if I had a reporter on the ground, they probably wouldn't be able to find out the truth.”⁠ ⁠ To read the the full story, click the link in our bio.⁠ #NPR ",
        "view_count": 14886,
        "create_time": 1748877408,
        "id": 7511371072982224174,
        "like_count": 1431,
        "share_count": 35,
        "username": "npr",
        "comment_count": 41,
        "region_code": "US"
      },
      {
        "comment_count": 9,
        "like_count": 965,
        "share_count": 15,
        "view_count": 15398,
        "create_time": 1748785510,
        "id": 7510976283392707886,
        "region_code": "US",
        "username": "npr",
        "video_description": "Experts gathered at the World Health Assembly in Geneva this month to talk about a problem that’s often hidden: The roughly 140,000 people who die every year from snake bites. Venomous snake bites aren’t often at the top of the global health agenda, but each year, millions of people get bitten — often far away from antivenom treatment. To raise awareness, a new initiative called \"Strike Out Snakebite\" scattered human-sized snake statues throughout Geneva. Going forward, David Lalloo, the vice chancellor of the Liverpool School of Tropical Medicine, says the initiative aims to boost funding for antivenom research and help bolster health systems so they can get bitten people to treatment before it’s too late. Tap the link in our bio to read the full story."
      },
      {
        "share_count": 418,
        "username": "npr",
        "view_count": 45710,
        "comment_count": 184,
        "id": 7512120469693287722,
        "like_count": 3527,
        "region_code": "US",
        "create_time": 1749051907,
        "video_description": "When reading, do audiobooks count? What does the science say? NPR’s Book of the Day host Andrew Limbong reached out to an expert to find out. #NPR "
      },
      {
        "create_time": 1749044574,
        "region_code": "US",
        "username": "npr",
        "video_description": "As enrollment in online college grows, students wonder: Why does it cost more? #NPR ",
        "view_count": 19107,
        "comment_count": 53,
        "id": 7512088923925925166,
        "like_count": 1803,
        "share_count": 69
      },
      {
        "comment_count": 295,
        "like_count": 7659,
        "region_code": "US",
        "create_time": 1749044278,
        "id": 7512087673893408046,
        "share_count": 101,
        "username": "npr",
        "video_description": "In the wake of the 2019 Christchurch mass shooting that killed 51 people, New Zealand Prime Minister Jacinda Ardern vowed to change gun laws. And a few weeks later, the government banned semi-automatic and military style weapons. “I just instinctively felt that New Zealanders would support a change because they would have that same mentality we had, which is never again, let's do everything we can,” Ardern told All Things Considered host Mary Louise Kelly. Watch the full interview at the link in bio. #NPR ",
        "view_count": 123005
      },
      {
        "create_time": 1749148781,
        "username": "npr",
        "video_description": "The Trump administration announced on Tuesday that it plans to revoke guidance directing hospitals to provide emergency abortions to women whose lives are in danger. That also included states where abortion is outlawed. But there’s a federal law that’s still on the books requiring hospitals to provide emergency reproductive care, so it’s not clear if the Trump administration is instructing hospitals to turn away women in medical emergencies. #NPR ",
        "view_count": 994041,
        "comment_count": 958,
        "like_count": 69337,
        "region_code": "US",
        "share_count": 6288,
        "id": 7512536738749959470
      },
      {
        "comment_count": 49,
        "like_count": 1142,
        "region_code": "US",
        "username": "npr",
        "video_description": "New Zealand legislators voted Thursday to enact suspensions from Parliament for three lawmakers who performed a Māori haka to protest a proposed law. Hana-Rāwhiti Maipi-Clarke received a seven-day ban and the leaders of her political party, Debbie Ngarewa-Packer and Rawiri Waititi, were barred for 21 days. Three days had been the longest ban for a lawmaker from New Zealand's Parliament. The lawmakers from Te Pāti Māori, the Māori Party, performed the haka, a chanting dance of challenge, last November to oppose a widely unpopular bill, now defeated, that they said would reverse Indigenous rights. The protest drew global headlines and provoked months of debate among lawmakers about what the consequences for the lawmakers' actions should be and whether New Zealand's Parliament welcomed or valued Māori culture — or felt threatened by it. Tap the link in our bio to read the full story. #NPR ",
        "create_time": 1749148733,
        "id": 7512536521304739118,
        "share_count": 16,
        "view_count": 18907
      },
      {
        "comment_count": 5,
        "create_time": 1749148688,
        "like_count": 183,
        "video_description": "Orville Peck says his childhood loneliness has come in handy. Peck is full of apparent contradictions. As a kid in South Africa, he went from dancing ballet to playing drums in a punk band. He loves musical theater but made a name for himself as a country singer. He sings about vulnerability but covers his face with a mask. Peck talks to Rachel about embracing those contradictions and about starring in “Cabaret” on Broadway. Watch the full interview at the link in bio. #NPR ",
        "view_count": 5899,
        "id": 7512536345416584494,
        "region_code": "US",
        "share_count": 5,
        "username": "npr"
      },
      {
        "id": 7512536245902478638,
        "share_count": 30,
        "view_count": 10437,
        "comment_count": 47,
        "like_count": 1315,
        "region_code": "US",
        "username": "npr",
        "video_description": "In testimony before the House Foreign Affairs Committee in May, Secretary of State Marco Rubio declared that no one has died because of cuts to USAID  — the cutoff of billions of dollars of U.S. support for global health programs. One mother from Nigeria begs to differ. Mariam Mohammed, a widowed mother of two, says her younger son — 7-year-old Babagana Bukar Mohammed — died as a result of the disruptions to U.S. foreign aid. #NPR ",
        "create_time": 1749148666
      },
      {
        "create_time": 1749134716,
        "share_count": 1,
        "video_description": "Is politics a dealbreaker? For Gen Z - Seems like a yes. #NPR ",
        "username": "npr",
        "view_count": 3975,
        "comment_count": 10,
        "id": 7512476333746998574,
        "like_count": 171,
        "region_code": "US"
      },
      {
        "share_count": 5,
        "username": "npr",
        "video_description": "Jacinda Ardern, former prime minister of New Zealand, was the second person to give birth while holding elected office. So, who did she turn to for advice? Queen Elizabeth. “She just completely straight-faced said, ‘Well, you just get on with it,’” Ardern told All Things Considered host Mary Louise Kelly. Listen to the full interview on NPR.org. #NPR ",
        "comment_count": 10,
        "create_time": 1749087000,
        "id": 7512271326275620142,
        "like_count": 723,
        "region_code": "US",
        "view_count": 12401
      },
      {
        "username": "npr",
        "view_count": 11315,
        "share_count": 69,
        "create_time": 1749233981,
        "id": 7512902596466642219,
        "like_count": 1290,
        "region_code": "US",
        "video_description": "Lizards are evolving at hyper speed in Puerto Rican cities. These turbocharged genetic adaptations mean they can run and move faster than their countryside cousins. But why? Evolutionary biologists Shane Campbell-Staton and Kristin Winchell are studying how the urban environment is spurring rapid genetic adaptations in this lizard species. This video includes footage from an episode of the PBS docuseries Human Footprint PBS: “The Urban Jungle”, Season 1. #NPR ",
        "comment_count": 14
      },
      {
        "region_code": "US",
        "username": "npr",
        "comment_count": 8,
        "create_time": 1749227206,
        "share_count": 2,
        "video_description": "Today is the 81st anniversary of D-Day, the start of the Allied operation in 1944 to land troops on the French shore of Normandy and the final assault on Nazi Germany. The operation had been kept secret until hundreds of thousands of Allied troops stormed the shore. Defense Secretary Pete Hegseth commemorated the anniversary with veterans at the American Cemetery overlooking the shore in the village of Colleville-sur-Mer.",
        "view_count": 6902,
        "id": 7512873480426212650,
        "like_count": 530
      },
      {
        "id": 7513580347402112299,
        "like_count": 4318,
        "region_code": "US",
        "view_count": 120519,
        "comment_count": 276,
        "create_time": 1749391816,
        "share_count": 310,
        "username": "npr",
        "video_description": "Federal agents conducted a series of immigration sweeps across Los Angeles on Friday, prompting anger and resistance from onlookers and immigrant rights groups that have braced for this type of action for months. By Saturday, tensions were rising between state and local authorities and Trump administration officials, who said they were calling up the National Guard in response to what they said were \"violent mobs\" attacking \"ICE Officers and Federal Law Enforcement Agents carrying out basic deportation operations in Los Angeles.\" Gov. Gavin Newsom called the plan to take over deployment from the state \"purposefully inflammatory\" adding that it \"will only escalate tensions.\""
      },
      {
        "share_count": 10071,
        "view_count": 469973,
        "comment_count": 256,
        "id": 7513975961331748138,
        "region_code": "US",
        "username": "npr",
        "video_description": "Officials in central Tennessee have finally caught a runaway pet zebra. Ed the zebra was picked up in a pasture in central Tennessee. Authorities literally picked him up — Tennessee officials wrapped up the zebra in a net and a helicopter team airlifted him to a waiting animal trailer. Ed escaped from his owner last month — he arrived in the Christiana community in central Tennessee, on May 30, and his owner reported him missing the next day. He gained fame by running in and out of Interstate 24 traffic. No injuries were reported. The pursuit came one month after a runway kangaroo shut down a section of Alabama interstate. Tap the link in our bio to read the full story.",
        "create_time": 1749483906,
        "like_count": 38967
      },
      {
        "username": "npr",
        "video_description": "Orville Peck paused his music career to get sober. Peck is full of apparent contradictions. As a kid in South Africa, he went from dancing ballet to playing drums in a punk band. He loves musical theater but made a name for himself as a country singer. He sings about vulnerability but covers his face with a mask. Peck talks to Rachel about embracing those contradictions and about starring in “Cabaret” on Broadway. Watch the full interview at the link in bio. #NPR ",
        "comment_count": 12,
        "create_time": 1749578750,
        "id": 7514383353987009838,
        "like_count": 1219,
        "share_count": 21,
        "region_code": "US",
        "view_count": 41801
      },
      {
        "like_count": 2216,
        "region_code": "US",
        "video_description": "In July of 2011, more than 5 inches of rain fell on Copenhagen in the matter of hours, flooding the Danish capital and filling its streets with raw sewage. Now the city has created a 1.3 billion-dollar investment to try and make Copenhagen floodproof. #NPR ",
        "comment_count": 47,
        "create_time": 1749564510,
        "id": 7514322103374630190,
        "share_count": 71,
        "username": "npr",
        "view_count": 26717
      },
      {
        "view_count": 19998,
        "create_time": 1749659106,
        "region_code": "US",
        "share_count": 44,
        "username": "npr",
        "video_description": "It began Monday, after two Romanian-speaking teens were arraigned in court for an alleged sexual assault. Angry neighbors then began hunting for other eastern europeans or foreign-born people to attack. Hundreds of masked rioters have thrown molotov cocktails, smashed windows and set fire to cars. Police have deployed water cannons in response. Authorities say five people have been arrested and more than 30 police officers have been injured. Residents have been posting flags and signs on their doors with their nationalities — to try to discourage rioters from targeting them.",
        "comment_count": 34,
        "id": 7514728456530201899,
        "like_count": 1368
      },
      {
        "share_count": 3,
        "username": "npr",
        "id": 7514725844867108142,
        "region_code": "US",
        "like_count": 402,
        "video_description": "What does your book say about you? #NPR",
        "view_count": 6113,
        "comment_count": 4,
        "create_time": 1749658494
      },
      {
        "video_description": "Pam Beasley walked so Helly could run. Listen to It’s Been A Minute at the link in our bio.⁠ #NPR ",
        "view_count": 11923,
        "comment_count": 17,
        "region_code": "US",
        "like_count": 594,
        "share_count": 3,
        "username": "npr",
        "create_time": 1749751590,
        "id": 7515125797473062187
      },
      {
        "create_time": 1749735008,
        "like_count": 1298,
        "region_code": "US",
        "share_count": 330,
        "username": "npr",
        "video_description": "An Air India flight with 242 passengers and 12 crew aboard crashed shortly after departure in India's northwestern city of Ahmedabad today. It’s not yet clear how many people have been killed or injured. The chairman of the group that operates Air India said in a statement that flight AI171, which was bound for London's Gatwick Airport, was involved in a “tragic incident.” It’s the first ever crash of a Boeing 787 Dreamliner aircraft, according to the Aviation Safety Network database. Reuters says the aircraft gave a \"Mayday\" call, signaling an emergency before it crashed. Local media say the jet crashed into a building that houses medical doctors. Tap the link in our bio to read the full story.",
        "comment_count": 55,
        "id": 7515054573040504110,
        "view_count": 77146
      },
      {
        "comment_count": 308,
        "create_time": 1749773987,
        "id": 7515221994145680682,
        "region_code": "US",
        "view_count": 55837,
        "like_count": 10311,
        "share_count": 1298,
        "username": "npr",
        "video_description": "Jason Reynolds is proud to be a crybaby. Reynolds writes stories that don’t talk down to kids. In young adult books like “Long Way Down,” “Ghost” and two Miles Morales Spider-Man novels, there is a clear understanding: kids are complicated people, and Jason treats them that way. His newest audio-only book is called “Soundtrack.” He talks with Rachel about the value of being a crier and the advice about rest he got from LeVar Burton. Watch the full interview at the link in bio. #NPR "
      },
      {
        "like_count": 1067,
        "create_time": 1749931966,
        "id": 7515900420242361646,
        "region_code": "US",
        "share_count": 21,
        "username": "npr",
        "video_description": "Sirens blared throughout Tel Aviv as Iran launched retaliatory strikes against Israel on Friday night into Saturday morning, killing at least 3 people and injuring dozens of others.⁠ The strikes were in response to a major Israeli attack on Iranian nuclear sites which killed more than 70 people, including three top Iranian military leaders.",
        "view_count": 29002,
        "comment_count": 83
      },
      {
        "username": "npr",
        "view_count": 6697,
        "comment_count": 12,
        "create_time": 1749910211,
        "id": 7515806763309075758,
        "like_count": 519,
        "share_count": 11,
        "region_code": "US",
        "video_description": "Researchers say that the number of emperor penguins in Antarctica may be declining faster than feared. Writing in the journal \"Nature,\" researchers say they tracked the penguins using satellite data between 2009 and 2024, seeing declines of more than 20%."
      },
      {
        "create_time": 1750017791,
        "id": 7516269058191265066,
        "region_code": "US",
        "username": "npr",
        "video_description": "Iran fired hundreds of missiles at Israel overnight Friday, setting off sirens and sending people to bomb shelters in Tel Aviv and Jerusalem. It was Iran’s response to an Israeli attack that targeted nuclear facilities and killed top Iranian security officials. Most Iranian missiles were intercepted by Israel’s powerful air defense system, but some hit neighborhoods around Tel Aviv. Reporter: Hadeel Al-Shalchi/NPR Videographer: @itay.stern • Itay Stern/NPR Producer: Catie Dull/NPR",
        "comment_count": 8333,
        "like_count": 25878,
        "share_count": 1122,
        "view_count": 635634
      },
      {
        "id": 7516188011059629354,
        "region_code": "US",
        "username": "npr",
        "video_description": "A rare military parade rolled through the streets of Washington, D.C. in celebration of the 250th anniversary of the Army. Meanwhile, hundreds of protests against the Trump administration took place across the country.⁠",
        "comment_count": 2146,
        "create_time": 1749998933,
        "view_count": 838040,
        "like_count": 33842,
        "share_count": 500
      },
      {
        "id": 7516561734350474538,
        "region_code": "US",
        "view_count": 11068,
        "comment_count": 50,
        "create_time": 1750085955,
        "like_count": 973,
        "share_count": 12,
        "username": "npr",
        "video_description": "Homeland Security Secretary Kristi Noem is blaming California Democratic Sen. Alex Padilla for interrupting her news conference yesterday. She and Padilla were in the same federal building in Los Angeles. She was talking about federal immigration raids in LA. Padilla says he moved toward Noem to ask a question when he was forcibly removed from the room by federal agents, forced to the ground and then handcuffed. But Secretary Noem says Padilla lunged toward her. She says he never identified himself, although several recordings of the incident show Padilla identifying himself in the room before he is taken away. Tap the link in our bio to read the full story. #NPR "
      },
      {
        "like_count": 892,
        "username": "npr",
        "region_code": "US",
        "share_count": 70,
        "video_description": "Minecraft is helping science! Researchers are using it to study how people learn.⁠⁠ #Minecraft #GamingForGood #MinecraftResearch #NPR ",
        "view_count": 12637,
        "comment_count": 7,
        "create_time": 1750173956,
        "id": 7516939587378351373
      },
      {
        "video_description": "Russia's latest attack on Ukraine is again one of its largest, lasting more nine hours and killing at least 15 civilians and injuring nearly 100 others in Kyiv. Ukrainian Air Defense units spent hours trying to shoot down drones and missiles. At least a dozen sites were hit — many of them residential buildings. Videos posted by Ukrainian authorities showed the collapse of part of an apartment complex. Emergency crews are working to pull survivors from the rubble. The strikes come as Ukrainian President Volodymyr Zelenskyy is attending the G7 summit in Canada, pushing for stronger sanctions on Russia. Tap the link in our bio to read the full story.",
        "comment_count": 10,
        "like_count": 367,
        "share_count": 3,
        "username": "npr",
        "view_count": 7542,
        "create_time": 1750172590,
        "id": 7516933830834425101,
        "region_code": "US"
      },
      {
        "create_time": 1750172213,
        "region_code": "US",
        "video_description": "Palestinians have been killed almost daily trying to reach food distribution sites built in Israeli military red zones. NPR’s Anas Baba was at Gaza City’s Al-Shifa Hospital where he documented the aftermath of Israeli tank fire and shelling on what witnesses say were crowds of desperately hungry people. #NPR ",
        "comment_count": 36,
        "id": 7516932166278810935,
        "like_count": 2103,
        "share_count": 56,
        "username": "npr",
        "view_count": 16364
      },
      {
        "region_code": "US",
        "share_count": 6,
        "username": "npr",
        "view_count": 9777,
        "comment_count": 21,
        "create_time": 1750265707,
        "id": 7517333734941592846,
        "like_count": 617,
        "video_description": "New York City Comptroller and mayoral candidate Brad Lander was arrested yesterday outside an immigration court as immigration officers were trying to take a migrant into custody. Video shows Lander being led away in handcuffs by two men who appear to be masked law enforcement officials, typical of recent practices of the U.S. Immigration and Customs Enforcement. Lander said he was escorting a migrant from court and asked to see the person’s arrest warrant. \"They would not show me the warrant,\" Lander said, \"and I said I would let go of his arm as soon as they showed it to me and you saw what happened.\" A spokesperson for the Department of Homeland Security said Lander was arrested for assaulting law enforcement and impeding a federal court officer. Tap the link in our bio to read the full story."
      },
      {
        "create_time": 1750206700,
        "share_count": 3951,
        "video_description": "Jason Reynolds on the part of his life that feels like prayer. Reynolds writes stories that don’t talk down to kids. In young adult books like “Long Way Down,” “Ghost” and two Miles Morales Spider-Man novels, there is a clear understanding: kids are complicated people, and Jason treats them that way. His newest audio-only book is called “Soundtrack.” He talks with Rachel about the value of being a crier and the advice about rest he got from LeVar Burton. Watch the full interview at the link in bio. #NPR ",
        "view_count": 136121,
        "username": "npr",
        "comment_count": 717,
        "id": 7517080463714962743,
        "like_count": 26077,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "view_count": 38348,
        "like_count": 2434,
        "share_count": 55,
        "username": "npr",
        "video_description": "At least half a million people in Gaza are starving and the territory risks being plunged into famine, according to a UN-backed report issued by dozens of experts on hunger. NPR spent time with a starving single mother in Gaza City to document the family's struggles for survival. Israel is severely restricting food supplies into Gaza and trying to control its distribution, saying it's to prevent Hamas from benefiting. International aid groups say it amounts to collective punishment. Gaza's Health Ministry says more than 400 people have been killed by Israeli fire trying to reach food aid since late March.",
        "comment_count": 52,
        "create_time": 1750339815,
        "id": 7517651850749955383
      },
      {
        "comment_count": 28,
        "create_time": 1750337406,
        "id": 7517641636998876429,
        "video_description": "Sabrina Carpenter has joined the race to score this year’s “unofficial song” of the summer. 2024 gave pop fans a crowded race for the year’s unofficial song of the summer, as major stars and new faces flooded the market with massive pop hits. This year's been slower, as the pop charts have been loaded with last year’s hits alongside new ones from the country star Morgan Wallen and the ever-present hit “Ordinary,” by the singer Alex Warren. This week, the song-of-the-summer sweepstakes finally gets a rowdy pop contender: Sabrina Carpenter’s “Manchild,” which debuted on this week’s \"Billboard\" Hot 100 at No. 1. Tap the link in our bio to read the full story.",
        "view_count": 36766,
        "like_count": 1882,
        "region_code": "US",
        "share_count": 16,
        "username": "npr"
      },
      {
        "video_description": "In an interview with NPR, Israeli president Isaac Herzog is calling for international support in destroying Iran’s main nuclear facilities. President Trump says he has not made a decision whether to take part in attacking Iran. NPR’s Daniel Estrin spoke with Herzog in Jerusalem. Herzog told NPR that any decision about U.S. military strikes on Iran should be made by President Trump and his team. He also said Israel decided to attack days ago after sharing intelligence with the U.S. about Iran’s nuclear plans. The U.S. National Intelligence Director testified in March that U.S. intelligence officials did not think Iran was building a nuclear weapon. Trump has dismissed the assessment.",
        "comment_count": 634,
        "like_count": 719,
        "region_code": "US",
        "share_count": 14,
        "username": "npr",
        "view_count": 31440,
        "create_time": 1750299302,
        "id": 7517478097256500535
      },
      {
        "username": "npr",
        "video_description": "A dual U.S.-Israeli citizen — the last surviving American hostage in Gaza — has returned to the United States. Edan Alexander had been held by Hamas militants until his release in May. Crowds lined the streets in Tenafly, N.J., waving Israeli and U.S. flags and cheering as an SUV brought the 21-year-old back home. Alexander was captured while on duty serving as an Israeli soldier during the Hamas-led attacks on southern Israel in October of 2023. He was released last month, in a standalone deal negotiated between President Trump’s administration and Hamas, who said it had been holding secret talks with the U.S. in the days leading up to his release. Hamas said Alexander’s release was meant as part of “steps taken to establish a ceasefire” with Israel, but a ceasefire has still not come. Deadly Israeli bombardment of Gaza continues daily while 53 hostages remain in captivity there, more than half of whom are believed to be dead. #NPR ",
        "comment_count": 34,
        "create_time": 1750434850,
        "id": 7518060367180860727,
        "share_count": 2,
        "like_count": 246,
        "region_code": "US",
        "view_count": 9208
      },
      {
        "create_time": 1750517145,
        "view_count": 6875,
        "comment_count": 7,
        "id": 7518413655948446990,
        "like_count": 331,
        "region_code": "US",
        "share_count": 10,
        "username": "npr",
        "video_description": "110 high schoolers from across the country descended on Times Square last week for their first taste of fame. The National High School Musical Theatre Awards, better known as the Jimmy Awards, bring some of Broadway’s rising stars to New York City each year to put on a show unlike any other– in just 10 days. The competition starts with about 150,000 kids from schools across the nation. After regional competitions, a select few make it to New York City to perform in the awards show at the Minskoff Theatre. The top two awards of the night – best actor and best actress in a musical – are named after Broadway legend Jimmy Nederlander. #NPR "
      },
      {
        "like_count": 609,
        "share_count": 35,
        "video_description": "Defense Secretary Pete Hegseth said that Iran's nuclear ambitions were \"obliterated\" after President Trump ordered strikes on three nuclear sites across the country Saturday. \"The order we received from our commander in chief was focused, it was powerful, and it was clear,\" Hegseth said Sunday morning at a press conference at the Pentagon. \"We devastated the Iranian nuclear program. But it's worth noting the operation did not target Iranian troops or the Iranian people.\" The U.S. attack on Iran's nuclear sites involved seven B-2 Stealth Bombers and also included at least one submarine, according to Gen. Dan Caine, chairman of the Joint Chiefs of Staff at the Pentagon press conference.Caine said the mission, dubbed \"Operation Midnight Hammer,\" represented the largest B-2 strike in U.S. history, involving more than 125 aircraft — including decoy flights — and saw 75 precision guided weapons dropped on the sites.  \"Final battle damage will take some time, but initial battle damage assessments indicate that all three sites sustained extremely severe damage and destruction,\" Caine said.Very few people knew details of the mission, Caine said, which began midnight Friday with B-2 bombers leaving from Kansas City, Mo.  Some of the bombers flew west into the Pacific as a decoy, while the main set of bombers flew 18 hours into Iran to carry out the attack.\"Once over land, the B-2s linked up with escort and support aircraft in a complex, tightly timed maneuver requiring exact synchronization across multiple platforms in a narrow piece of airspace, all done with minimal communications,\" Caine said. Around 5 p.m. Eastern time Saturday, a submarine launched more than two dozen Tomahawk missiles at a nuclear site in Isfahan as the bombers entered Iranian airspace. From approximately 6:40 p.m. to 7:05 p.m. Eastern time, the B-2s dropped 14 bunker-buster bombs on multiple targets at the Fordo and Natanz nuclear sites. The planes did not come under fire before, during or after the attack, Caine said.",
        "create_time": 1750606201,
        "id": 7518796190427647287,
        "region_code": "US",
        "username": "npr",
        "view_count": 25677,
        "comment_count": 123
      },
      {
        "like_count": 1408,
        "region_code": "US",
        "share_count": 67,
        "comment_count": 51,
        "create_time": 1750601565,
        "id": 7518776178669407501,
        "username": "npr",
        "video_description": "The Trump administration is ending funding for specialized suicide-prevention services for LGBTQ+ youth. The option on the 988 suicide and crisis lifeline is being eliminated on July 17. When someone contacts 988, they can press 3 if they identify as LGBTQ+ youth. That connects the person to specialized counseling services tailored for such youth, who’re at a higher risk of suicide than their peers. Mark Henson is with The Trevor Project, one of several organizations contracted to provide those services: \"In less than a month, the program that has bipartisan backing and has had 1.3 million LGBTQ+ young people use ... It would no longer be available for those who need it most.\" He says, more recently, nearly 60,000 individuals have used the service every month. Tap the link in our bio to read the full story. #NPR ",
        "view_count": 10726
      },
      {
        "create_time": 1750561883,
        "id": 7518605877595688247,
        "video_description": "The U.S. military has joined with Israel to launch military strikes against Iran, a dramatic escalation in the years-long effort by both nations to prevent Tehran from acquiring a nuclear weapon. \"We have completed our very successful attack on the three Nuclear sites in Iran, including Fordow, Natanz, and Esfahan,\" President Trump wrote on Truth Social on Saturday. Late Saturday evening, President Trump addressed the nation from the White House, joined by Vice President JD Vance, Secretary of State Marco Rubio and Defense Secretary Pete Hegseth. He confirmed the U.S. had launched “massive precision strikes” against three nuclear facilities within Iran. He originally announced the strikes in a post on Truth Social earlier Saturday evening. “Our objective was the destruction of Iran’s nuclear enrichment capacity and a stop to the nuclear threat,” Trump said. “Tonight I can report to the world that the strikes were spectacular military success. Iran’s key nuclear enrichment facilities have been completely and totally obliterated.” U.S. involvement comes amid an escalating conflict after Israel launched its own airstrikes against Iran a little over a week ago. The U.S. had moved additional military equipment and ships into the region in recent days. On Thursday, the president said he would decide “within two weeks” whether to strike Iran and clarified further on Friday that two weeks was the “maximum” he needed to make that call. Trump has also had multiple meetings with military and national security officials in the Situation Room as he weighed what move – if any – the U.S. should take.",
        "view_count": 74358,
        "comment_count": 222,
        "like_count": 2247,
        "region_code": "US",
        "share_count": 349,
        "username": "npr"
      },
      {
        "comment_count": 77,
        "region_code": "US",
        "share_count": 20,
        "username": "npr",
        "view_count": 27993,
        "create_time": 1750781407,
        "id": 7519548652717755662,
        "like_count": 1313,
        "video_description": "Expressing frustration with apparent violations of a ceasefire between Israel and Iran overnight, President Trump lashed out at both countries Tuesday morning, saying he wasn't happy with either of them and using an expletive U.S. presidents simply do not say on camera: \"They don’t know what the f*** they’re doing.\" The comment came hours after Israel and Iran agreed to stop their war, followed by accusations from Israel that Iran had broken the ceasefire. Trump told reporters outside the White House Tuesday, \"I think they both violated it.\" A short time later, from Air Force One, he posted on Truth Social that Israel would not attack Iran and that “Nobody will be hurt, the Ceasefire is in effect!” Tap the link in our bio to read the latest."
      },
      {
        "like_count": 421,
        "region_code": "US",
        "share_count": 7,
        "username": "npr",
        "video_description": "Swipe to catch up on today’s news.  Tap the link in our bio for more. ",
        "comment_count": 35,
        "create_time": 1750776066,
        "id": 7519525703268797751,
        "view_count": 8207
      },
      {
        "create_time": 1750887944,
        "id": 7520006356040944951,
        "username": "npr",
        "view_count": 15626,
        "comment_count": 116,
        "like_count": 907,
        "region_code": "US",
        "share_count": 16,
        "video_description": "Sen. Lisa Murkowski, a moderate Republican from Alaska, tells NPR that if you want change, you cannot stay silent. \"Don't assume that anybody else is going to speak up for you,\" she told All Things Considered host Juana Summers. \"It's when you stop speaking up that those of us who are in a position to listen start to think that, well, maybe maybe your silence means you think everything is OK.\" Watch the full interview at the link in bio."
      },
      {
        "username": "npr",
        "video_description": "Doing “the robot” will look very different in the future. Catie Cuan is teaching robots to move more gracefully through choreography. #NPR ",
        "like_count": 138,
        "region_code": "US",
        "share_count": 13,
        "view_count": 3121,
        "comment_count": 10,
        "create_time": 1750881641,
        "id": 7519979251433475341
      },
      {
        "create_time": 1750869908,
        "like_count": 1761,
        "region_code": "US",
        "comment_count": 52,
        "share_count": 24,
        "username": "npr",
        "video_description": "Swipe to catch up on today’s news. Tap the link in our bio for more.",
        "view_count": 53192,
        "id": 7519928934327192887
      },
      {
        "comment_count": 45,
        "create_time": 1750865617,
        "region_code": "US",
        "share_count": 5,
        "view_count": 17760,
        "id": 7519910510280723725,
        "like_count": 1578,
        "username": "npr",
        "video_description": "New York state assemblyman Zohran Mamdani, a 33-year-old democratic socialist, is set to win Tuesday's Democratic primary for New York City mayor with about 44% of the vote, toppling former Gov. Andrew Cuomo and nine other candidates. The most left-leaning candidate in a crowded field, Mamdani campaigned on raising taxes on the city’s billionaires to fund initiatives like free MTA buses and expanding mental health outreach teams as his rivals pledged to hire more police officers. Mamdani came in well ahead of Cuomo, who has already conceded defeat in the race. Incumbent Mayor Eric Adams is running as an independent in November's general election, and Cuomo could still run as a third-party candidate. Tap the link in our bio to read the full story."
      },
      {
        "create_time": 1750861356,
        "like_count": 3098,
        "share_count": 155,
        "video_description": "Our big mid-year list of Books We Love is here, and we’re highlighting 10 of those books that NPR staff have loved this year — so far. Tap the link in our bio for more. #NPR ",
        "view_count": 40465,
        "comment_count": 57,
        "id": 7519892211408915743,
        "region_code": "US",
        "username": "npr"
      },
      {
        "create_time": 1750861324,
        "region_code": "US",
        "like_count": 333,
        "share_count": 12,
        "username": "npr",
        "video_description": "The famous Paris opera house known as the Opera Garnier is celebrating its 150th anniversary this year. Emperor Napoleon III commissioned the building in the 1850s but would never see its completion. Charles Garnier, the architect, wanted to create a building that was about celebrating the citizens of Paris -- not those born into wealth, but people who strived to succeed in society. #NPR ",
        "view_count": 5420,
        "comment_count": 8,
        "id": 7519892071436619039
      },
      {
        "like_count": 1404,
        "region_code": "US",
        "video_description": "There's ADHD and then there's #ADHD. Listen to It’s Been A Minute at the link in our bio. Host: @bmluse • Brittany Luse/NPR Producer: @abiinman • Abi Inman/NPR",
        "share_count": 85,
        "username": "npr",
        "view_count": 20027,
        "comment_count": 28,
        "create_time": 1750857018,
        "id": 7519873559104113975
      },
      {
        "id": 7520385074424974605,
        "username": "npr",
        "video_description": "Swipe to catch up on today’s news. Tap the link in our bio for more.",
        "view_count": 27122,
        "comment_count": 11,
        "create_time": 1750976110,
        "like_count": 1005,
        "region_code": "US",
        "share_count": 5
      },
      {
        "create_time": 1750970381,
        "id": 7520360455521553677,
        "like_count": 103268,
        "video_description": "Michelle Obama's mother taught her daughter something important about living right before she died. Obama says she’s never truly been able to realize her own ambition. But now she’s changing that. She’s saying “no” to what’s expected of her and “yes” to what she wants to do, including starting a podcast with her brother, “IMO with Michelle Obama and Craig Robinson.” She reflects with Rachel on owning her decisions and what saves her from despair. Watch the full interview at the NPR Podcasts YouTube. #NPR ",
        "comment_count": 2038,
        "share_count": 10381,
        "username": "npr",
        "view_count": 695048,
        "region_code": "US"
      },
      {
        "comment_count": 9,
        "id": 7520262456074145037,
        "region_code": "US",
        "username": "npr",
        "video_description": "Iranians are streaming across the border into the Van region of eastern Turkey, seeking safety amid a shakey ceasefire between Israel and Iran. Other Iranians are returning home from vacations and expressing more optimism. #NPR ",
        "create_time": 1750947561,
        "like_count": 668,
        "share_count": 5,
        "view_count": 16760
      },
      {
        "video_description": "Long-time American “Vogue” editor-in-chief Anna Wintour has announced that she’s moving away from her position, but she’ll continue in her roles at Condé Nast and for “Vogue.” Wintour’s plate has been full in recent years. In addition to the day-to-day editing of American “Vogue,” she oversees almost all of Conde Nast’s other brands including “Wired,” “Vanity Fair” and “GQ.” Wintour joined “Vogue” as editor-in-chief in 1988. She went on to launch “Teen Vogue” and “Men’s Vogue.”",
        "id": 7520774928824651063,
        "like_count": 577,
        "share_count": 26,
        "username": "npr",
        "comment_count": 5,
        "create_time": 1751067900,
        "region_code": "US",
        "view_count": 13073
      },
      {
        "id": 7520744468463521038,
        "username": "npr",
        "comment_count": 0,
        "create_time": 1751059809,
        "like_count": 773,
        "region_code": "US",
        "share_count": 32,
        "video_description": "We rounded up the final decisions in one place. Swipe to read.",
        "view_count": 40146
      },
      {
        "video_description": "In 1994, New York's Pride festivities focused on human rights violations affecting gay, lesbian, bisexual and transgender communities around the world. NPR's Jim Zarroli was there in 1994 and interviewed one of the original participants in the Stonewall riots. Today, NPR's Korva Coleman explores how Pride may have evolved over the years but in many ways the goals of the LGBTQ community have remained the same. Host: @korva_coleman • Korva Coleman/NPR Producer: @graceraver • Grace Raver/NPR Editor: @z2thomp • Zach Thompson/NPR",
        "like_count": 1025,
        "region_code": "US",
        "username": "npr",
        "share_count": 17,
        "view_count": 9580,
        "comment_count": 9,
        "create_time": 1751054107,
        "id": 7520720055533964599
      },
      {
        "comment_count": 1441,
        "create_time": 1751049076,
        "like_count": 5540,
        "username": "npr",
        "id": 7520698332751121677,
        "region_code": "US",
        "share_count": 242,
        "video_description": "The number of people detained by Immigration and Customs Enforcement has been rapidly growing. More than 55,000 people are now held in ICE custody, according to data from the administration, numbers that now surpassed the administration's previous high of those detained, which was reached during Trump's first term in 2019. Historical data collected by The Marshall Project suggest that the number — met just this month — is the highest ever recorded. What’s more, it is nearly 15,000 more people than what ICE is currently funded for. Immigration experts say a big driver of the growth in how many people are detained comes from a shift in priorities: The Trump administration is arresting more people who haven’t committed any crimes beyond their civil immigration violation. Nearly three out of four people currently in ICE custody have no criminal record — and that includes minor offenses like traffic violations.",
        "view_count": 81738
      },
      {
        "comment_count": 16,
        "video_description": "Swipe to catch up on today’s news. Tap the link in our bio for more.",
        "view_count": 49995,
        "create_time": 1751041428,
        "id": 7520665485122293006,
        "like_count": 1124,
        "region_code": "US",
        "share_count": 39,
        "username": "npr"
      },
      {
        "id": 7520636744019021111,
        "share_count": 229,
        "video_description": "This month, a new president took office in South Korea, promising to reduce tensions and resume dialogue with North Korea. His first move was to unilaterally call a halt to psychological warfare operations along the inter-Korean border. #NPR ",
        "username": "npr",
        "view_count": 209600,
        "comment_count": 63,
        "create_time": 1751034744,
        "like_count": 12139,
        "region_code": "US"
      },
      {
        "view_count": 172744,
        "create_time": 1751111100,
        "id": 7520774702453804343,
        "region_code": "US",
        "share_count": 354,
        "username": "npr",
        "video_description": "The Pentagon has announced that the U.S. Navy is changing the name of one of its ships. The USNS Harvey Milk will be renamed the Oscar V. Peterson. Defense Secretary Pete Hegseth says the decision was made to take the politics out of ship naming. Oscar V. Peterson was awarded the medal of honor for heroism during the Battle of the Coral Sea in 1942. The USNS Harvey Milk was originally named in honor of Harvey Milk, a pioneering gay rights activist and Navy veteran.",
        "comment_count": 891,
        "like_count": 11267
      },
      {
        "comment_count": 38,
        "like_count": 1923,
        "region_code": "US",
        "share_count": 37,
        "username": "npr",
        "create_time": 1751144400,
        "id": 7520771216517418254,
        "video_description": "Michelle Obama received scrutiny for not attending President Trump’s inauguration and former President Jimmy Carter’s funeral. On this week’s Wild Card with Rachel Martin, the former first lady talks about having the ambition to say “no.”",
        "view_count": 17724
      },
      {
        "username": "npr",
        "video_description": "The genius of this rare prototype MingKwai typewriter comes from the way Lin Yutang, its creator, decided to break down Chinese pictographs by their shapes, not by sounds.",
        "comment_count": 39,
        "create_time": 1751214900,
        "like_count": 3667,
        "region_code": "US",
        "share_count": 251,
        "id": 7520775105476103438,
        "view_count": 27814
      },
      {
        "video_description": "This summer's most talked-about performance on London's West End doesn't require a ticket. The latest production of the musical Evita — about Eva Perón, Argentina's first lady in the 1940s and early 1950s — is playing at London's Palladium theater through early September. But it's what the star does offstage that's creating lots of buzz.",
        "view_count": 186275,
        "id": 7520773854260776205,
        "like_count": 27523,
        "region_code": "US",
        "share_count": 668,
        "comment_count": 140,
        "create_time": 1751222400,
        "username": "npr"
      },
      {
        "like_count": 2030,
        "region_code": "US",
        "share_count": 12,
        "username": "npr",
        "comment_count": 32,
        "create_time": 1751202000,
        "id": 7520771687269338381,
        "video_description": "Michelle Obama responds to rumors about her and former President Barack Obama’s marriage. On this week’s Wild Card with Rachel Martin, the former first lady talks about owning her narrative and doing the things she wants to do – not what she feels she has to do.Watch the full interview at the link in bio.",
        "view_count": 19938
      },
      {
        "comment_count": 18,
        "id": 7521749565297429774,
        "like_count": 559,
        "username": "npr",
        "create_time": 1751293808,
        "region_code": "US",
        "share_count": 9,
        "video_description": "Swipe to catch up on today's news. Tap the link in our bio for more.",
        "view_count": 13312
      }
    ]
  }
}