{
  "data": {
    "videos": [
      {
        "id": 7511481811470519598,
        "like_count": 799,
        "region_code": "US",
        "share_count": 86,
        "username": "nytimes",
        "view_count": 68391,
        "comment_count": 16,
        "video_description": "Tourists on the Italian island of Sicily were forced to flee on Monday from the slopes of Mount Etna, one of Europe’s largest and most active volcanoes, after an eruption sent clouds of gas, rock and ash billowing into the sky. #etna #sicily #eruption #volcano",
        "create_time": 1748904600
      },
      {
        "video_description": "If you missed the northern lights on Sunday, here's your chance: This time-lapse video shows how streaks of colorful light painted the night sky across parts of the U.S. as a geomagnetic storm made the northern lights, or aurora borealis, visible. #northernlights #auroraborealis",
        "view_count": 12550,
        "id": 7511404138169683246,
        "like_count": 408,
        "region_code": "US",
        "share_count": 16,
        "username": "nytimes",
        "comment_count": 8,
        "create_time": 1748885274
      },
      {
        "share_count": 12,
        "username": "nytimes",
        "comment_count": 23,
        "like_count": 783,
        "region_code": "US",
        "view_count": 17416,
        "create_time": 1748883763,
        "id": 7511398343336267054,
        "video_description": "Presidential threats. Onerous investigations. Extensive funding cuts. The Trump administration has wielded all three against Harvard University, and the battle has continued to escalate. Tap the link for a full look at all the actions Trump has taken against Harvard so far. #harvard #trump #donaldtrump"
      },
      {
        "view_count": 127962,
        "comment_count": 150,
        "create_time": 1748853011,
        "id": 7511265826079804718,
        "like_count": 2637,
        "region_code": "US",
        "share_count": 336,
        "username": "nytimes",
        "video_description": "Eight people were hospitalized, and two of them were in serious condition, after a man in Boulder, Colorado, used a “makeshift flamethrower” on Sunday to attack a crowd of peaceful demonstrators honoring Israeli hostages in Gaza. The authorities said they were investigating the attack as an act of terrorism. #Boulder #Colorado"
      },
      {
        "comment_count": 97,
        "share_count": 312,
        "username": "nytimes",
        "region_code": "US",
        "video_description": "Creatine has long been a popular supplement among athletes and body builders. But on social media, claims about creatine go beyond the weight room. Julia Calderone, an editor for Well, explains. #creatine #wellness #supplements #muscles #exercise #health  ",
        "view_count": 78952,
        "create_time": 1748829417,
        "id": 7511164998735908142,
        "like_count": 3043
      },
      {
        "comment_count": 19,
        "share_count": 14,
        "username": "nytimes",
        "create_time": 1748820335,
        "id": 7511126040069147950,
        "like_count": 375,
        "region_code": "US",
        "video_description": "Ukraine launched on Sunday one of its broadest aerial assaults of the war against air bases inside Russia, a coordinated operation that targeted sites from eastern Siberia to Russia’s western border. Russia also struck a Ukrainian military training base on Sunday, killing at least 12 soldiers. Read the latest at the link in our bio. #russia #ukraine ",
        "view_count": 19967
      },
      {
        "username": "nytimes",
        "view_count": 90344,
        "create_time": 1748802488,
        "id": 7511049335207939370,
        "like_count": 4646,
        "region_code": "US",
        "share_count": 113,
        "video_description": "Miley Cyrus said we could ask her anything. In an in-depth conversation with The New York Times, she discussed stardom, rage, therapy, Dolly Parton, her new album and more. Watch our full conversation with @Miley Cyrus for “The Interview” on YouTube at the link in our bio. Video by Eddie Costas, Alfredo Chiarappa, Pat Gunther, Felice León and Brooke Minters/The New York Times #mileycyrus #somethingbeautiful #tattoos ",
        "comment_count": 33
      },
      {
        "comment_count": 141,
        "create_time": 1748797954,
        "id": 7511029844432407850,
        "username": "nytimes",
        "like_count": 2140,
        "region_code": "US",
        "share_count": 132,
        "video_description": "For the first time in Mexico’s history, voters will elect more than 2,600 judges and magistrates, including those who will sit on the Supreme Court and hundreds of other federal, state and local tribunals. Our reporter breaks down why the new approach is so controversial. Learn more about the election at the link in our bio. Video by Emiliano Rodriguez Mega, Christina Thornell, David Seekamp and Laura Salaberry/The New York Times #mexico #elections  ",
        "view_count": 31408
      },
      {
        "create_time": 1748789170,
        "share_count": 1,
        "view_count": 12034,
        "comment_count": 8,
        "id": 7510992011504241966,
        "like_count": 166,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "The Pacers came in as the returning Eastern Conference finalist most had forgotten about. After ousting the Knicks and booking their first Finals ticket in 25 years, all of New York, and the basketball world, remembers them now. Read more from @The Athletic at the link in our bio. #pacers #knicks #nba #playoffs"
      },
      {
        "comment_count": 24,
        "like_count": 964,
        "share_count": 52,
        "create_time": 1748994600,
        "id": 7511869351494946094,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "The governing coalition in the Netherlands collapsed on Tuesday after the populist leader Geert Wilders withdrew his party over a dispute about migration policy, ending a rocky 11-month rule by the country’s first far-right government and triggering early elections. #netherlands",
        "view_count": 29550
      },
      {
        "create_time": 1748970845,
        "username": "nytimes",
        "video_description": "Raw milk. Vaccine skepticism. Natural births. The so-called \"Make America Healthy Again\" movement, associated with Health Secretary Robert F. Kennedy Jr., is changing the kind of information parents see on their social media feeds, including misinformation. Emma Goldberg, a reporter covering societal change for The New York Times, talks with a mom about how MAHA ideas are resonating and how the trend is changing the way parents raise their kids. Video by Emma Goldberg, Melanie Bencosme, Karen Hanley, Gabriel Blanco, David Jouppi, James Surdam, Shivani Khattar/The New York Times #maha #healthy #rfk",
        "view_count": 17164,
        "comment_count": 22,
        "id": 7511772325214735662,
        "like_count": 683,
        "region_code": "US",
        "share_count": 29
      },
      {
        "like_count": 1481,
        "share_count": 119,
        "video_description": "Israeli soldiers opened fire Tuesday morning near crowds of Palestinians walking toward a new food distribution site in southern Gaza, the Israeli military said. The Red Cross and Gaza health ministry said at least 27 people had been killed. This is the second large-scale deadly shooting in three days near the distribution site in the southern city of Rafah, where thousands of Palestinians have tried to secure aid. #Gaza #GazaAid #IsraeliMilitary",
        "username": "nytimes",
        "view_count": 27772,
        "comment_count": 97,
        "create_time": 1748966217,
        "id": 7511752413469183278,
        "region_code": "US"
      },
      {
        "create_time": 1749056588,
        "id": 7512140642085096747,
        "like_count": 252,
        "region_code": "US",
        "comment_count": 20,
        "username": "nytimes",
        "video_description": "At least 10 people were killed and dozens were injured on Wednesday in a crowd crush outside a stadium in the Indian city of Bengaluru as tens of thousands celebrated a Premier League cricket championship, officials said. #Cricket #India #PremierLeague",
        "view_count": 11551,
        "share_count": 4
      },
      {
        "create_time": 1749053867,
        "id": 7512129040568864031,
        "username": "nytimes",
        "view_count": 910030,
        "comment_count": 36,
        "like_count": 29926,
        "region_code": "US",
        "share_count": 320,
        "video_description": "As a child, Shamsa Sharawe was brutally cut. As an adult, she underwent hours of reconstruction surgery. As a mother, she vowed to protect her daughter from female genital cutting. And now as a social media influencer, she is persuading others to do the same. @Official Araweelo Photos by Nariman El-Mofty "
      },
      {
        "comment_count": 8,
        "like_count": 166,
        "username": "nytimes",
        "view_count": 11707,
        "create_time": 1749030325,
        "id": 7512027351157574958,
        "region_code": "US",
        "share_count": 7,
        "video_description": "Smoke from Canadian wildfires is expected to shroud parts of the Northeast on Wednesday, creating airborne pollution and hazy skies that had passed through sections of the Upper Midwest on Tuesday."
      },
      {
        "id": 7511794221658115374,
        "like_count": 6876,
        "video_description": "Lee Jae-myung has won South Korea's presidential election by a wide margin, after the country faced months of political turmoil. Lee’s campaign has ridden a wave of anger against former President Yoon Suk Yeol after he tried to impose martial law in December. Video by Choe Sang-Hun and Nikolay Nikolov/The New York Times. #SouthKorea #Elections #LeeJaemyung",
        "view_count": 80953,
        "comment_count": 100,
        "create_time": 1749007800,
        "region_code": "US",
        "share_count": 297,
        "username": "nytimes"
      },
      {
        "share_count": 5,
        "username": "nytimes",
        "comment_count": 4,
        "id": 7512586416782691626,
        "region_code": "US",
        "video_description": "Elon Musk and President Trump’s unlikely alliance deteriorated in a remarkably swift and public fashion over the course of a few hours on Thursday, with each posting about the other from their own social media platforms, escalating their feud with attacks over matters significant and petty. #Trump #Musk",
        "view_count": 2733,
        "create_time": 1749160347,
        "like_count": 44
      },
      {
        "comment_count": 1355,
        "create_time": 1749157031,
        "region_code": "US",
        "share_count": 3844,
        "username": "nytimes",
        "video_description": "The Nintendo Switch 2 is out now — and the company is relying on 90’s nostalgia and celebrity power to market its new console. Zachary Small, a culture reporter for The New York Times, analyzes Nintendo’s marketing over the years and what it tells us about the company. Video by Zachary Small, Claire Hogan and David Jouppi/The New York Times #nintendo #switch2 #videogames",
        "id": 7512572188357266734,
        "like_count": 115624,
        "view_count": 1134290
      },
      {
        "create_time": 1749155287,
        "id": 7512564698307464490,
        "like_count": 3148,
        "share_count": 102,
        "video_description": "In the first debate of the New York City mayoral primary, former Gov. Andrew Cuomo faced a barrage of attacks from his Democratic rivals. The two-hour debate descended into chaos on more than one occasion, as the candidates shouted at one another, the cacophony worsening when the moderators jumped in to interrupt. #nyc #nycmayoraldebate #nycmayor ",
        "comment_count": 104,
        "region_code": "US",
        "username": "nytimes",
        "view_count": 148157
      },
      {
        "id": 7512524966877908270,
        "share_count": 4,
        "username": "nytimes",
        "video_description": "Before Addison Rae became part of TikTok’s first wave of superstars, she remembers promoting popular songs on the app for $20 a video. Watch or listen to the full interview on @popcast at the link above where @addisonre talks about redefining her public image, finding her artistic voice, and the long road from viral fame to debut album. Video by Pat Gunther, Jamie Hefetz, Mark Zemel, Dave Mayers and Sophie Erickson #AddisonRae #Popcast #music",
        "comment_count": 6,
        "create_time": 1749146037,
        "like_count": 395,
        "region_code": "US",
        "view_count": 12852
      },
      {
        "region_code": "US",
        "comment_count": 1294,
        "create_time": 1749142276,
        "like_count": 36540,
        "video_description": "New Zealand’s Parliament on Thursday suspended three opposition lawmakers over their performance of the haka, a traditional Māori dance, as a protest while the body was considering a contentious bill last year. #NewZealand #Parliament #Haka",
        "view_count": 1264923,
        "id": 7512508817976905003,
        "share_count": 1826,
        "username": "nytimes"
      },
      {
        "comment_count": 5098,
        "region_code": "US",
        "share_count": 19244,
        "create_time": 1749132330,
        "id": 7512466081882180907,
        "like_count": 175081,
        "username": "nytimes",
        "video_description": "Video of a child escaping a burning building after an Israeli airstrike garnered widespread attention online. We found her in a hospital in Gaza and pieced together what had happened. Video by Nader Ibrahim, Saher Alghorra, Bilal Shbair, Axel Boada, Sanjana Varghese, Laura Salaberry, Jon Hazell and Monika Cvorak/The New York Times",
        "view_count": 983503
      },
      {
        "comment_count": 112,
        "region_code": "US",
        "share_count": 508,
        "create_time": 1749245172,
        "id": 7512950693741759790,
        "like_count": 3846,
        "username": "nytimes",
        "video_description": "An interstate has been closed. A drone has been deployed. Professional tracking groups and trained dogs have been dispatched. They’re all on the case of this missing zebra that has been running wild in Tennessee. #zebra #wildlife #tennessee",
        "view_count": 90194
      },
      {
        "create_time": 1749226923,
        "like_count": 10802,
        "region_code": "US",
        "share_count": 362,
        "video_description": "Ryan Mac has covered Elon Musk for years and was co-author of a book about him, but he’s never seen anything quite like this. He describes what set off the meltdown in Musk and President Trump’s relationship, and its potential effects. Video by Ryan Mac, Gabriel Blanco and Nikolay Nikolov/The New York Times #trump #elonmusk",
        "comment_count": 376,
        "username": "nytimes",
        "view_count": 206889,
        "id": 7512872250429672750
      },
      {
        "like_count": 589,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Hamed Aleaziz, who covers the Department of Homeland Security and immigration policy for The New York Times, explains the new travel ban President Trump signed this week — and how it differs from the one from Trump's first term. #trump #travel #travelban",
        "view_count": 20397,
        "comment_count": 12,
        "create_time": 1749224759,
        "id": 7512862971979124014,
        "share_count": 40
      },
      {
        "comment_count": 7,
        "create_time": 1749219972,
        "like_count": 171,
        "region_code": "US",
        "username": "nytimes",
        "id": 7512842276960439598,
        "share_count": 5,
        "video_description": "From @theathletic: Tyrese Haliburton, the new king of the playoff winner, hit a jumper with 0.3 seconds left to give the Indiana Pacers an improbable win over the Oklahoma City Thunder in Game 1 of the NBA Finals. #NBA #Playoffs #TyreseHaliburton #NBAFinals",
        "view_count": 9432
      },
      {
        "username": "nytimes",
        "video_description": "Before Addison Rae’s rise to fame on TikTok, she got her start on social media creating fan pages for One Direction and a “Dance Moms” star, Brooke Hyland. Read, watch or listen to the full interview on \"Popcast\" at the link above. Video by Pat Gunther, Jamie Hefetz, Mark Zemel, Dave Mayers and Sophie Erickson/The New York Times #AddisonRae #Popcast #DanceMoms",
        "view_count": 9427,
        "create_time": 1749214191,
        "id": 7512817451243949354,
        "region_code": "US",
        "share_count": 2,
        "comment_count": 6,
        "like_count": 430
      },
      {
        "comment_count": 288,
        "create_time": 1749204059,
        "id": 7512773867127967018,
        "region_code": "US",
        "video_description": "Russia on Friday launched one of the largest barrages of missiles and drones of the war at targets across Ukraine, killing at least four people and damaging buildings in Kyiv, two days after Moscow vowed retaliation for Ukraine’s recent audacious assault on Russian strategic bomber bases. #Ukraine #Kyiv #Russia",
        "like_count": 2246,
        "share_count": 35,
        "username": "nytimes",
        "view_count": 53241
      },
      {
        "comment_count": 14,
        "create_time": 1749175774,
        "id": 7512652584998653230,
        "like_count": 255,
        "username": "nytimes",
        "region_code": "US",
        "share_count": 16,
        "video_description": "Miley Cyrus’s new album, “Something Beautiful,” is her attempt to reclaim and reimagine what “beautiful” means. To watch @Miley Cyrus’s full conversation with Lulu Garcia-Navarro and see more clips, follow “The Interview” on YouTube: youtube.com/@theinterviewpodcast. Video by Eddie Costas, Alfredo Chiarappa, Pat Gunther, Felice León and Brooke Minters/The New York Times #mileycyrus #somethingbeautiful  ",
        "view_count": 6847
      },
      {
        "create_time": 1749327640,
        "video_description": "The mayor of Kharkiv, Ukraine, described an overnight Russian air assault as “the most powerful attack” since the beginning of the war. At least four people were killed on Saturday, according to the local authorities. #kharkiv #ukraine #russia",
        "comment_count": 505,
        "id": 7513304863405542698,
        "like_count": 4083,
        "region_code": "US",
        "share_count": 61,
        "username": "nytimes",
        "view_count": 128756
      },
      {
        "create_time": 1749310862,
        "id": 7513232756646612267,
        "share_count": 4,
        "video_description": "Misty Copeland is retiring from American Ballet Theatre after a groundbreaking career. In an in-depth conversation with The New York Times, she discussed preparing for her final performance, her unstable childhood, after-parties with Prince and more. Watch our full conversation with @mistycopeland for “The Interview” at the link in our bio. Video by Pat Gunther, Eddie Costas, Alfredo Chiarappa, Abhita Austin, Felice León and Brooke Minters #mistycopeland #americanballettheater #ballet",
        "view_count": 8382,
        "comment_count": 5,
        "like_count": 427,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "create_time": 1749394885,
        "id": 7513593628242070830,
        "share_count": 401,
        "username": "nytimes",
        "view_count": 156514,
        "comment_count": 493,
        "like_count": 11546,
        "region_code": "US",
        "video_description": "Kilmar Abrego Garcia, who was wrongly deported to El Salvador, was flown back to the U.S. on Friday to face federal criminal charges. Devlin Barrett, who covers the Justice Department, explains the charges and what may come next for Garcia. Video by Devlin Barrett, Laura Bult, Alexandra Ostasiewicz #kilmarabregogarcia #trump "
      },
      {
        "video_description": "Federal immigration officials on Saturday squared off with hundreds of protesters in Paramount, California, using tear gas, rubber bullets and flash-bang grenades to disperse people. The standoff followed a series of immigration raids that swept through Los Angeles on Friday. #losangeles #immigration #ice #california",
        "comment_count": 9041,
        "create_time": 1749343168,
        "like_count": 117757,
        "region_code": "US",
        "share_count": 10375,
        "username": "nytimes",
        "id": 7513371552210095406,
        "view_count": 2104090
      },
      {
        "id": 7514081774553828654,
        "username": "nytimes",
        "video_description": "Brianna Vargas, 24, stood on an overpass above a highway in Los Angeles with a megaphone in hand. She said she was protesting against recent federal immigration raids for her parents, who had emigrated from Mexico and El Salvador, and for others who were too afraid to leave their homes. Reposting messages of solidarity with victims of immigration enforcement raids on social media is one thing, she said. “It’s different when you’re actually here.” #losangeles#protests #immigration",
        "comment_count": 24,
        "create_time": 1749510600,
        "share_count": 8,
        "view_count": 16162,
        "like_count": 816,
        "region_code": "US"
      },
      {
        "comment_count": 111,
        "create_time": 1749505788,
        "id": 7514070003193253163,
        "region_code": "US",
        "share_count": 460,
        "view_count": 65123,
        "like_count": 2819,
        "username": "nytimes",
        "video_description": "The app Yuka, which Robert F. Kennedy Jr., the U.S. health secretary, has called “invaluable,” assigns health scores to food. But can it actually help people make better choices? Caroline Hopkins Legaspi, a reporter for Well, explains. Video by Caroline Hopkins Legaspi and Theodore Tae/The New York Times #Yuka #YukaApp"
      },
      {
        "username": "nytimes",
        "video_description": "The New York City mayoral primary is just under three weeks away. Our City Hall bureau chief, Emma Fitzsimmons, highlights the two front-runners, Andrew Cuomo and Zohran Mamdani, and their plans for the three main issues for voters. Video by Emma G. Fitzsimmons, Karen Hanley and James Surdam #nyc #nycmayor #AndrewCuomo #ZohranMamdani",
        "view_count": 1091707,
        "comment_count": 1803,
        "id": 7514028782328548654,
        "region_code": "US",
        "share_count": 3595,
        "create_time": 1749496204,
        "like_count": 132190
      },
      {
        "comment_count": 15,
        "id": 7514019086183976234,
        "like_count": 149,
        "share_count": 9,
        "username": "nytimes",
        "video_description": "A federal judge on Monday dismissed a lawsuit that the actor Justin Baldoni had filed against his former co-star Blake Lively and her husband, Ryan Reynolds, as well as his defamation lawsuit against The New York Times. This is a developing story. Photo by Cindy Ord/Getty Images ",
        "create_time": 1749493934,
        "region_code": "US",
        "view_count": 9568
      },
      {
        "view_count": 217976,
        "comment_count": 393,
        "id": 7514009363783126302,
        "like_count": 8368,
        "share_count": 65,
        "username": "nytimes",
        "video_description": "California officials will sue President Trump for taking control of the state’s National Guard and deploying troops to the streets of Los Angeles. The legal challenge, announced by Gov. Gavin Newsom, was expected to be filed on Monday morning, as protests were planned in more cities over federal immigration enforcement. Photos by Gabriela Bhaskar/The New York Times, Eric Thayer/Associated Press and Jae Hong/Associated Press #LosAngeles #ICE #ICEraids #NationalGuard ",
        "create_time": 1749491656,
        "region_code": "US"
      },
      {
        "comment_count": 87,
        "create_time": 1749480030,
        "like_count": 1000,
        "share_count": 70,
        "id": 7513959181624380715,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Waymo, the robot taxi company, cut off service to the downtown Los Angeles area after people protesting President Trump's immigration policies set multiple self-driving vehicles on fire on Sunday. #LA #immigration #fire",
        "view_count": 40599
      },
      {
        "video_description": "Footage from the Freedom Flotilla Coalition and the Israeli authorities shows what happened when Israel diverted a civilian ship, with Greta Thunberg onboard, that was headed to Gaza.",
        "view_count": 52812,
        "create_time": 1749468622,
        "id": 7513910150453857582,
        "like_count": 3210,
        "username": "nytimes",
        "comment_count": 178,
        "region_code": "US",
        "share_count": 125
      },
      {
        "region_code": "US",
        "username": "nytimes",
        "comment_count": 298,
        "create_time": 1749455172,
        "id": 7513852313669340459,
        "view_count": 68000,
        "like_count": 4082,
        "share_count": 272,
        "video_description": "Law enforcement officers in Los Angeles clashed for a third day on Sunday with crowds of people demonstrating against the Trump administration’s crackdown on immigration. But even as tear gas wafted over pockets of downtown, the rest of the sprawling city kept to its usual sunlit rhythms. #LosAngeles #Protests #NationalGuard"
      },
      {
        "comment_count": 5,
        "create_time": 1749436147,
        "id": 7513770948709879086,
        "share_count": 5,
        "username": "nytimes",
        "view_count": 4849,
        "like_count": 151,
        "region_code": "US",
        "video_description": "Misty Copeland made history as the first Black woman ever to be named a principal dancer with the American Ballet Theater. She recently reflected on her groundbreaking career, motherhood and growing up in near poverty. Watch our full conversation with @Misty Copeland for “The Interview” at the link in our bio. Video by Pat Gunther, Eddie Costas, Alfredo Chiarappa, Abhita Austin, Felice León and Brooke Minters. #mistycopeland #americanballettheater #ballet #journaling "
      },
      {
        "video_description": "Saturday’s WorldPride parade was part of the three-week WorldPride festival, one of the biggest celebrations for the LGBTQ community in the world. Amid the joy and celebration, there was an undercurrent of anger and worry. Video by Amy Harmon, Claire Hogan and Karen Hanley/The New York Times #WorldPride #pride #trump ",
        "view_count": 20966,
        "comment_count": 14,
        "create_time": 1749433742,
        "id": 7513760548014673194,
        "region_code": "US",
        "share_count": 19,
        "username": "nytimes",
        "like_count": 950
      },
      {
        "share_count": 412,
        "video_description": "The police in Northern Ireland have condemned an outbreak of disorder in the town of Ballymena on Monday night in which 15 officers were injured and houses and shops were set on fire. The police said the attacks were being investigated as racially motivated. #northernireland #ballymena",
        "id": 7514448233565850926,
        "create_time": 1749593833,
        "like_count": 6161,
        "region_code": "US",
        "username": "nytimes",
        "view_count": 102121,
        "comment_count": 218
      },
      {
        "username": "nytimes",
        "view_count": 68750,
        "comment_count": 208,
        "region_code": "US",
        "share_count": 900,
        "video_description": "Experts say that some aggressive measures used by the authorities in the Los Angeles protests have violated polices as well as injunctions put into place after the George Floyd protests. Livia Albeck-Ripka, a New York Times reporter based in Los Angeles, describes how she was one of the reporters struck by crowd control munitions. Video by Livia Albeck-Ripka, Gabriel Blanco, Christina Shaman and Nikolay Nikolov/The New York Times #LosAngeles #ICE #ICEraids #NationalGuard",
        "create_time": 1749592800,
        "id": 7514427567613529387,
        "like_count": 13581
      },
      {
        "id": 7514420188431928618,
        "share_count": 40,
        "video_description": "RM and V of the K-pop boy band BTS emerged from a base in South Korea on Wednesday and gave fans a brief saxophone performance. Three other members of the group will finish their national service this month. #BTS #KPop #RM #V",
        "view_count": 19080,
        "username": "nytimes",
        "comment_count": 10,
        "create_time": 1749587344,
        "like_count": 554,
        "region_code": "US"
      },
      {
        "create_time": 1749567900,
        "id": 7514332363392830763,
        "share_count": 98,
        "video_description": "The protests against the Trump administration’s immigration policies that started in Los Angeles have spread to at least two dozen cities, including San Francisco, Dallas, Austin and New York City. Follow live updates. #immigration #LosAngeles #NYC #SanFrancisco #Dallas #Austin #Trump #ICE",
        "view_count": 22900,
        "comment_count": 47,
        "like_count": 2094,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "comment_count": 40,
        "create_time": 1749677206,
        "id": 7514806216766393642,
        "region_code": "US",
        "video_description": "A wildfire that started on Tuesday afternoon north of the San Bernardino Mountains in Southern California had exploded to more than 4,200 acres by Wednesday morning, officials said.  #California #Wildfire #SanBernadino",
        "like_count": 619,
        "share_count": 60,
        "username": "nytimes",
        "view_count": 37786
      },
      {
        "video_description": "California has sued the Trump administration over its move to deploy troops to Los Angeles. Eric Schmitt, our national security correspondent, explains the laws governing the use of American troops on U.S. soil. #LosAngeles #California #NationalGuard #Marines #Trump",
        "view_count": 16341,
        "comment_count": 23,
        "like_count": 561,
        "region_code": "US",
        "share_count": 15,
        "username": "nytimes",
        "create_time": 1749675300,
        "id": 7514793079161851178
      },
      {
        "region_code": "US",
        "share_count": 33,
        "video_description": "Three paramedics and a photographer with them were killed late Monday in Gaza. Among the medics killed was Hussein Mohsen, who was interviewed by The New York Times last month after rescuing two 5-year-old girls from the aftermath of an Israeli strike. #Palestine #Gaza #Israel",
        "username": "nytimes",
        "view_count": 19148,
        "comment_count": 13,
        "create_time": 1749668307,
        "id": 7514767970468482350,
        "like_count": 425
      },
      {
        "share_count": 52,
        "username": "nytimes",
        "video_description": "A New York Times immigration reporter traveled to Miami to observe how immigrant arrest operations have changed under pressure from the Trump administration. Here’s what he found. Video by Hamed Aleaziz, Nicole Salazar, Carlos Prieto and Mark Boyer. #Miami #ICE #DonaldTrump #Immigration",
        "view_count": 21555,
        "comment_count": 40,
        "region_code": "US",
        "like_count": 740,
        "create_time": 1749657103,
        "id": 7514719859503123758
      },
      {
        "comment_count": 132,
        "create_time": 1749657900,
        "id": 7514719185063333166,
        "like_count": 2454,
        "region_code": "US",
        "share_count": 263,
        "video_description": "A second night of rioting struck the town of Ballymena in Northern Ireland on Tuesday, as anti-immigrant protests spread to several other areas and the police warned of “hate-fueled acts.” #Ballymena #NorthernIreland #Ireland",
        "view_count": 95030,
        "username": "nytimes"
      },
      {
        "comment_count": 308,
        "create_time": 1749637555,
        "id": 7514636018503453994,
        "share_count": 130,
        "view_count": 128914,
        "like_count": 11948,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Cities across the U.S. are bracing for a new round of immigration protests on Wednesday after the Los Angeles mayor imposed an overnight curfew downtown and Governor Gavin Newsom of California blamed President Trump for unrest that began with deportation raids last week. Follow live updates at the link in our bio. #losangeles #LA #protests #california #curfew"
      },
      {
        "id": 7514598338310802730,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Hamed Aleaziz, a New York Times immigration reporter, traveled to Miami to observe how immigrant arrest operations have changed under pressure from the Trump administration. Video by: Hamed Aleaziz, Nicole Salazar, Carlos Prieto and Mark Boyer #Miami #ICE #Deportations",
        "view_count": 102292,
        "comment_count": 322,
        "create_time": 1749628783,
        "like_count": 8132,
        "share_count": 1187
      },
      {
        "video_description": "Gov. Gavin Newsom made the case in a televised address Tuesday evening that President Trump’s decisions to send military forces to immigration protests in Los Angeles have put the U.S. at the precipice of authoritarianism. #newsom #california #losangeles #trump",
        "id": 7514525467731299627,
        "share_count": 4826,
        "username": "nytimes",
        "region_code": "US",
        "view_count": 1562177,
        "comment_count": 3134,
        "create_time": 1749611811,
        "like_count": 236639
      },
      {
        "share_count": 3607,
        "username": "nytimes",
        "video_description": "Senator Alex Padilla, Democrat of California, was forcibly removed from a news conference being held by Kristi Noem, the Homeland Security secretary, and handcuffed on Thursday after he pushed past guards at a federal building in West Los Angeles. #AlexPadilla #KristiNoem #California #LosAngeles #immigration",
        "view_count": 593138,
        "create_time": 1749765091,
        "region_code": "US",
        "like_count": 35399,
        "comment_count": 1975,
        "id": 7515183775098375470
      },
      {
        "view_count": 37492,
        "id": 7515158247322455342,
        "region_code": "US",
        "share_count": 55,
        "username": "nytimes",
        "video_description": "Gov. Gavin Newsom of California sat down with Michael Barbaro to discuss President Trump, illegal immigration, the protests and how he thinks the standoff in Los Angeles will end. Listen to \"The Daily.\"  #Newsom#TheDaily#LosAngeles#california#Trump",
        "comment_count": 124,
        "create_time": 1749759144,
        "like_count": 7041
      },
      {
        "username": "nytimes",
        "view_count": 1544841,
        "comment_count": 345,
        "create_time": 1749747561,
        "region_code": "US",
        "video_description": "Rescuers were combing the wreckage of an Air India passenger jet bound for London that crashed moments after takeoff Thursday in Ahmedabad, searching for survivors. More than 200 people had died and dozens remained unaccounted for, according to officials. It was not immediately clear what had caused the plane to crash. #AirIndia #Ahmedabad #India",
        "id": 7515108492445895982,
        "like_count": 20331,
        "share_count": 672
      },
      {
        "id": 7515083466988457258,
        "like_count": 402,
        "share_count": 5,
        "video_description": "From @theathletic: Game 3 of the NBA Finals revealed what the Indiana Pacers look like at their best: dogged, determined and dominant when it matters most.  Click the link above to read our game recap. #nbafinals #nba #playoffs",
        "view_count": 102044,
        "comment_count": 6,
        "create_time": 1749741738,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "share_count": 19,
        "create_time": 1749736721,
        "like_count": 333,
        "region_code": "US",
        "video_description": "More than 200 people were killed when an Air India flight bound for London crashed into a medical college shortly after taking off in the western Indian city of Ahmedabad on Thursday, the city police commissioner said. #Ahmedabad #India",
        "view_count": 17948,
        "comment_count": 11,
        "id": 7515061907158781230,
        "username": "nytimes"
      },
      {
        "like_count": 5653,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Aid agencies say Gaza faces the threat of widespread starvation in the wake of the 80-day Israeli blockade on food deliveries that ended in mid-May. Two young Gazans, Salem Madhat Alaydi and Aya Ehab Zaid, describe what it is like to fight hunger.",
        "comment_count": 89,
        "create_time": 1749728110,
        "view_count": 60257,
        "id": 7515024920708009259,
        "share_count": 211
      },
      {
        "create_time": 1749690600,
        "id": 7514854597589060906,
        "share_count": 5,
        "username": "nytimes",
        "video_description": "Brian Wilson, the leader and chief songwriter of The Beach Boys, wrote several hits in the 1960s, a musical counterpart to the myth of Southern California as paradise. He has died at 82. #BrianWilson #BeachBoys",
        "view_count": 8052,
        "comment_count": 10,
        "like_count": 194,
        "region_code": "US"
      },
      {
        "view_count": 93393,
        "username": "nytimes",
        "video_description": "Iran fired ballistic missiles that struck at least seven sites around Tel Aviv on Friday night, injuring dozens of Israelis. The move was in retaliation to the Israeli attacks on Iranian nuclear sites and military leaders. #Iran #Israel",
        "comment_count": 131,
        "create_time": 1749858000,
        "id": 7515576688898510126,
        "like_count": 4185,
        "region_code": "US",
        "share_count": 267
      },
      {
        "view_count": 99245,
        "comment_count": 73,
        "like_count": 1430,
        "username": "nytimes",
        "video_description": "The seven New York City mayoral candidates sparred over immigration, affordability and President Trump’s policies in the final Democratic debate ahead in the primary. #nyc #nycmayor #AndrewCuomo #ZohranMamdani ",
        "create_time": 1749854444,
        "id": 7515567400922860846,
        "region_code": "US",
        "share_count": 552
      },
      {
        "region_code": "US",
        "view_count": 19094,
        "comment_count": 3,
        "create_time": 1749847214,
        "id": 7515536382870179118,
        "like_count": 205,
        "share_count": 11,
        "username": "nytimes",
        "video_description": "Viswash Kumar Ramesh was one of 242 people on the Air India plane that went down shortly after takeoff from the international airport in Ahmedabad. He's also the only known survivor.  #AirIndia #plane #Ahmedabad #India"
      },
      {
        "like_count": 1469,
        "video_description": "“I still can’t believe how I got out alive.” When the Air India plane with 242 people on board crashed into a building moments after taking off from the international airport in Ahmedabad, India, it burst into flames. Viswash Kumar Ramesh was the only passenger who survived. Photo: Still image taken from Narendra Modi Youtube Channel, via Agence France-Presse — Getty Images #AirIndia #Flight171 #ViswashKumarRamesh ",
        "comment_count": 30,
        "create_time": 1749842964,
        "share_count": 48,
        "username": "nytimes",
        "view_count": 183983,
        "id": 7515518190957464862,
        "region_code": "US"
      },
      {
        "username": "nytimes",
        "region_code": "US",
        "create_time": 1749823206,
        "id": 7515433368813767982,
        "like_count": 314,
        "share_count": 8,
        "video_description": "From @The Athletic: Some Stanley Cup Final games are not easily forgotten. If the Edmonton Oilers go on to win two more games and end Canada’s 32-year Cup drought, everyone will remember where they were on June 12, 2025. Click the link above to read more. #stanleycup #stanleycupfinal #EdmontonOilers #Canada ",
        "view_count": 16779,
        "comment_count": 8
      },
      {
        "share_count": 38,
        "video_description": "Israel launched a stunning series of strikes against Iran on Friday morning, targeting the country’s nuclear program and killing three of the nation’s security chiefs. The wide-ranging attack prompted fears that long-simmering tensions between the heavily armed rivals were spiraling into a full-blown regional war. #Israel #Iran",
        "create_time": 1749796839,
        "like_count": 693,
        "region_code": "US",
        "view_count": 24175,
        "comment_count": 53,
        "id": 7515320132143566126,
        "username": "nytimes"
      },
      {
        "comment_count": 158,
        "id": 7515300101326196011,
        "like_count": 5167,
        "region_code": "US",
        "share_count": 317,
        "view_count": 46719,
        "create_time": 1749792175,
        "username": "nytimes",
        "video_description": "The Trump administration is facing legal challenges to its deployment of Marines and National Guard troops to Los Angeles. Shawn Hubler, the Los Angeles bureau chief for The New York Times, talks with Katrin Bennhold, a senior writer, about what she’s seen on the ground in the city. #Trump #LAProtests #Deportations"
      },
      {
        "create_time": 1749935700,
        "like_count": 6220,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "In sweeping attacks that started Friday, Israel struck at the regime in Tehran, hitting Iranian nuclear and military assets. Iran retaliated with barrages of ballistic missiles and drones. It is the most intense fighting in decades between the two heavily armed countries. To understand what’s happening in the region, Katrin Bennhold, a New York Times senior writer, spoke with Patrick Kingsley, the Jerusalem bureau chief. Video by Katrin Bennhold, Patrick Kingsley, Melanie Bencosme, Nikolay Nikolov, Christina Thornell, Christina Shaman and Laura Salaberry/The New York Times #iran #israel",
        "view_count": 117184,
        "comment_count": 122,
        "id": 7515908444675853614,
        "share_count": 185
      },
      {
        "share_count": 30,
        "username": "nytimes",
        "create_time": 1749933818,
        "like_count": 829,
        "region_code": "US",
        "video_description": "Officials in Minnesota were searching for the person who shot and killed State Representative Melissa Hortman and her husband in their home, in what Gov. Tim Walz described as a politically motivated attack. The suspect also shot and injured another Democratic lawmaker and his wife. Follow live updates. #minnesota #melissahortman #timwalz",
        "view_count": 23558,
        "comment_count": 16,
        "id": 7515908306083417390
      },
      {
        "region_code": "US",
        "username": "nytimes",
        "comment_count": 10,
        "create_time": 1749922598,
        "id": 7515860177741188398,
        "view_count": 89941,
        "like_count": 202,
        "share_count": 5,
        "video_description": "From The Athletic: The Pacers had made it a habit of pulling off stunning victories in these playoffs. But in Game 4 of the NBA Finals, it was the Thunder who pulled off a comeback. #nba #pacers #okc #thunder #nbafinals"
      },
      {
        "region_code": "US",
        "share_count": 23,
        "username": "nytimes",
        "view_count": 40765,
        "comment_count": 125,
        "create_time": 1749920771,
        "id": 7515852345159257387,
        "like_count": 1656,
        "video_description": "A person pretending to be a police officer assassinated a Democratic state legislator in Minnesota and killed the lawmaker’s husband in “an act of targeted political violence,” Gov. Tim Walz said Saturday.  Photos by Tim Gruber for The New York Times and Dan Haugen for The New York Times #minnesota #timwalz #melissahortman"
      },
      {
        "id": 7515814061142019374,
        "like_count": 3306,
        "region_code": "US",
        "username": "nytimes",
        "comment_count": 32,
        "share_count": 86,
        "video_description": "Rizwan Vahora lost three relatives in the Air India flight that crashed on Thursday, killing more than 260 people. He joined other grieving family members at the hospital in Ahmedabad to give DNA samples to help identify the badly damaged bodies. Video by Nailah Morgan, Karan Deep Singh, Meg Felling and Raunaq Chopra/The New York Times #AirIndia #Ahmedabad",
        "view_count": 126611,
        "create_time": 1749911875
      },
      {
        "region_code": "US",
        "username": "nytimes",
        "view_count": 227134,
        "comment_count": 338,
        "create_time": 1749862835,
        "id": 7515603510113750315,
        "like_count": 21923,
        "share_count": 1601,
        "video_description": "Business owners and locals in the Little Tokyo neighborhood of Los Angeles say they are conflicted: frustrated as they scrub graffiti and clean up after looting, but also holding a deep sense of solidarity with anti-immigration raid protesters and their cause. #LittleTokyo #LosAngeles #immigration #protests"
      },
      {
        "username": "nytimes",
        "video_description": "President Trump appointed Amy Coney Barrett to the Supreme Court to clinch a conservative legal revolution. But as soon as she arrived, she began surprising her colleagues. Jodi Kantor, our investigative reporter who has spent the past three years reporting on the Supreme Court, explains. Video by Jodi Kantor, Christina Shaman, Claire Hogan and Laura Salaberry/The New York Times #AmyConeyBarrett #SupremeCourt #Trump ",
        "comment_count": 1080,
        "region_code": "US",
        "like_count": 61127,
        "share_count": 2980,
        "view_count": 693023,
        "create_time": 1750030328,
        "id": 7516322885565304110
      },
      {
        "id": 7516317826815167790,
        "like_count": 6805,
        "region_code": "US",
        "share_count": 126,
        "video_description": "Israel and Iran traded attacks late into Sunday night, as the three days of fighting intensified on both sides despite international pleas for de-escalation. Iranians and Israelis have been bracing for further violence. Read more at the link in our bio. #israel #iran ",
        "comment_count": 387,
        "create_time": 1750029151,
        "username": "nytimes",
        "view_count": 300910
      },
      {
        "share_count": 660,
        "video_description": "Protesters organizing under the slogan \"No Kings,\" calling for protecting American democracy from President Trump, filled plazas, streets and parks across the U.S. on Saturday, the same day that Trump held a military parade in Washington. Read more at the link in our bio. #NoKings #Trump #Protest",
        "view_count": 202489,
        "comment_count": 473,
        "create_time": 1749978635,
        "id": 7516100340186467626,
        "like_count": 24827,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "id": 7516681945686740267,
        "region_code": "US",
        "share_count": 5,
        "username": "nytimes",
        "video_description": "State and federal officials announced charges, including murder, stalking and firearms offenses against a man who has been accused of assassinating a Minnesota state lawmaker and injuring another during multiple shootings. #minnesota",
        "comment_count": 38,
        "like_count": 648,
        "view_count": 19534,
        "create_time": 1750115400
      },
      {
        "create_time": 1750095000,
        "id": 7516596644280945934,
        "like_count": 1630,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Iran’s deadly strike on Monday hit Israeli residential buildings and energy infrastructure, and Israel has since expanded its attacks on Iran. The war is in its fourth day now, with civilian casualties climbing on both sides. #Iran #Israel #middleeast",
        "comment_count": 130,
        "share_count": 42,
        "view_count": 53066
      },
      {
        "region_code": "US",
        "video_description": "At least five people, including a toddler, died in West Virginia after flash floods destroyed homes and washed away roads over the weekend. A flood watch remained in the hardest-hit parts of the state on Monday, officials said. Three people were missing.  #WestViriginia #flooding #weather",
        "view_count": 3940,
        "like_count": 50,
        "share_count": 0,
        "username": "nytimes",
        "comment_count": 3,
        "create_time": 1750090500,
        "id": 7516577327799651626
      },
      {
        "id": 7516569160520846605,
        "like_count": 222041,
        "share_count": 5389,
        "view_count": 2333217,
        "comment_count": 6163,
        "create_time": 1750088700,
        "video_description": "President Trump has lumped together violent and peaceful protesters when speaking about the demonstrations in Los Angeles. David Sanger, a White House correspondent for The New York Times, explains how that is a break from history. #LosAngeles #immigration #protests #Trump",
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "like_count": 60245,
        "username": "nytimes",
        "video_description": "Akash Patni, 14, was dropping off lunch for his mother, Sitaben, who ran a tea stall, when an Air India plane crashed into a nearby building. While she is receiving treatment for burns, he did not make it. Read more about the lives lost in the disaster.  An earlier version of this video included an incorrect translation for remarks by the aunt of a deceased teenager. The video has been re-edited to include the correct remarks and translation.  #AirIndia #plane #Ahmedabad #India",
        "view_count": 856683,
        "comment_count": 584,
        "create_time": 1750197600,
        "id": 7517037369527143735,
        "region_code": "US",
        "share_count": 2703
      },
      {
        "create_time": 1750197300,
        "region_code": "US",
        "share_count": 16,
        "username": "nytimes",
        "video_description": "Watch as Sen. Alex Padilla spoke on the Senate floor about his removal from a news conference held by Kristi Noem, the homeland security secretary, and President Trump's immigration enforcement. Senate Democrats have called on her to testify at a hearing.  #AlexPadilla #LosAngeles #California #immigration #Trump",
        "comment_count": 31,
        "id": 7517035497064025399,
        "like_count": 1685,
        "view_count": 24012
      },
      {
        "video_description": "Brad Lander, the New York City comptroller who is running for mayor, was arrested by ICE agents after he tried to steer a migrant out of the building to avoid his arrest. Lander was released several hours later on Tuesday afternoon.  #BradLander #NYC #immigration #ICE",
        "comment_count": 67,
        "create_time": 1750195610,
        "id": 7517032785324838158,
        "share_count": 296,
        "like_count": 3355,
        "region_code": "US",
        "username": "nytimes",
        "view_count": 49896
      },
      {
        "view_count": 1010597,
        "username": "nytimes",
        "video_description": "The Israeli military said it was “aware of reports regarding a number of injured individuals from IDF fire,\" after the Gaza Ministry of Health said that more than 50 Palestinians were killed near an aid distribution site in Khan Younis on Tuesday and blamed Israel for the deaths. #Gaza #Israel #middleast",
        "id": 7517006191327710494,
        "like_count": 95978,
        "region_code": "US",
        "share_count": 3254,
        "comment_count": 477,
        "create_time": 1750190400
      },
      {
        "share_count": 26,
        "username": "nytimes",
        "video_description": "A couple visiting the Palazzo Maffei museum were posing for photos pretending to sit on Nicola Bolla’s “Van Gogh” chair, when the man sat down on the artwork, smashing it. Video shows the two of them fleeing the scene after. #Italy",
        "view_count": 27695,
        "comment_count": 24,
        "create_time": 1750177080,
        "id": 7516953138562108727,
        "like_count": 527,
        "region_code": "US"
      },
      {
        "create_time": 1750170441,
        "region_code": "US",
        "share_count": 2,
        "username": "nytimes",
        "video_description": "From @theathletic: Jalen Williams played the best playoff game of his life, the Oklahoma City Thunder survived one of the Indiana Pacers’ patented, double-digit comebacks, and the NBA Finals could be nearly decided. Read our Game 5 recap at the link above. #NBA#playoffs #nbafinals #JalenWilliams",
        "view_count": 42382,
        "comment_count": 6,
        "id": 7516924552543227149,
        "like_count": 139
      },
      {
        "comment_count": 81,
        "id": 7516892934122360078,
        "like_count": 388,
        "share_count": 40,
        "video_description": "Prime Minister Keir Starmer of Britain scrambled at President Trump’s feet to pick up the papers he dropped as he showed off a finalized trade agreement between the U.S. and Britain in a viral moment at the G7 Summit in Canada. #Trump #Starmer #tariff",
        "create_time": 1750163112,
        "region_code": "US",
        "username": "nytimes",
        "view_count": 39672
      },
      {
        "comment_count": 14,
        "like_count": 673,
        "region_code": "US",
        "share_count": 25,
        "video_description": "President Trump returned to Washington on Tuesday after leaving early from the G7 summit in Canada to deal with the war between Iran and Israel. On the flight home, he told reporters that he was looking for something \"better than a cease-fire\" between Israel and Iran. Follow live updates at the link in our bio. #Trump #Iran #Israel",
        "view_count": 54675,
        "create_time": 1750156822,
        "id": 7516865790663068941,
        "username": "nytimes"
      },
      {
        "comment_count": 1947,
        "id": 7517424086218280206,
        "region_code": "US",
        "share_count": 27490,
        "create_time": 1750286723,
        "like_count": 205196,
        "username": "nytimes",
        "video_description": "In recent extraordinary moves, Health Secretary Robert F. Kennedy Jr. has fired and replaced a team that makes vaccine recommendations for the U.S. Apoorva Mandavilli, our science and global health reporter, explains how this change could impact vaccine accessibility. #vaccines #health ",
        "view_count": 1385565
      },
      {
        "id": 7517423850032745783,
        "like_count": 4249,
        "username": "nytimes",
        "share_count": 152,
        "video_description": "President Trump said that he had not made a final decision on whether to order American forces to join Israeli attacks on Iran’s nuclear sites. Iran’s supreme leader, Ayatollah Ali Khamenei, rejected Trump’s demand for an “unconditional surrender” and rebuffed his threats. #Israel #Iran #Trump",
        "view_count": 81336,
        "comment_count": 181,
        "create_time": 1750288200,
        "region_code": "US"
      },
      {
        "create_time": 1750282948,
        "share_count": 13,
        "video_description": "A jury in Massachusetts on Wednesday found Karen Read not guilty of murder and manslaughter in the death of her boyfriend, John O’Keefe, a Boston police officer — ending a legal saga that has gripped the area since January 2022. The jury convicted Read on one charge, operating a vehicle under the influence. The verdict was delivered almost a year after an earlier trial in the case ended in a mistrial. Pool photo by Greg Derr #KarenRead #JohnOKeefe #Boston ",
        "view_count": 36756,
        "comment_count": 105,
        "like_count": 1914,
        "region_code": "US",
        "username": "nytimes",
        "id": 7517407922020764959
      },
      {
        "id": 7517383925174439181,
        "like_count": 146623,
        "region_code": "US",
        "share_count": 47571,
        "username": "nytimes",
        "video_description": "An 80-year-old Italian man tried to navigate a car down the iconic Spanish Steps in Rome, which are closed to vehicles, according to the police department. The vehicle made it part of the way down but got stuck, the authorities said. #Rome #Italy #SpanishSteps ",
        "view_count": 3857962,
        "comment_count": 1355,
        "create_time": 1750277372
      },
      {
        "create_time": 1750207200,
        "like_count": 2979,
        "view_count": 64060,
        "video_description": "President Trump spent the first months of his term holding back Israel’s push for an assault on Iran’s nuclear program. With the war underway, he has now expressed support for Israel. Jonathan Swan, a White House reporter for The New York Times, breaks down how the president got to this point. #Israel #Iran #Trump",
        "comment_count": 133,
        "id": 7517072581057416462,
        "region_code": "US",
        "share_count": 63,
        "username": "nytimes"
      },
      {
        "video_description": "The Port of Los Angeles is the largest port in the Western Hemisphere as well as the place that first saw the signs of President Trump’s tariff war. Our reporter explains what the port illustrates about U.S. trade. Video by Ana Swanson, Laura Bult, Laura Salaberry/The New York Times #losangeles #trade #trump #tariffs ",
        "view_count": 7751,
        "create_time": 1750374162,
        "id": 7517799636959071502,
        "region_code": "US",
        "username": "nytimes",
        "comment_count": 17,
        "like_count": 445,
        "share_count": 18
      },
      {
        "region_code": "US",
        "share_count": 23,
        "username": "nytimes",
        "view_count": 27752,
        "like_count": 802,
        "create_time": 1750373400,
        "id": 7517792338014407991,
        "video_description": "Israel and Iran continued to exchange attacks on Thursday as European diplomats made an attempt to de-escalate the conflict. The strikes highlight the risks to civilians in Israel and Iran after days of fighting between the two countries. #Israel #Iran",
        "comment_count": 39
      },
      {
        "comment_count": 33,
        "username": "nytimes",
        "view_count": 16875,
        "video_description": "Hurricane Erick weakened Thursday and was downgraded to a tropical storm after hitting Mexico’s southern coastline as a Category 3 storm, leaving flash floods, landslides and tides of washed-up debris along its path.  #HurricaneErick #storms #Mexico #Oaxaca #Acapulco #Guerrero",
        "create_time": 1750371600,
        "id": 7517784208065056013,
        "like_count": 376,
        "region_code": "US",
        "share_count": 34
      },
      {
        "create_time": 1750371300,
        "id": 7517783247653227790,
        "like_count": 2040,
        "share_count": 42,
        "view_count": 29235,
        "comment_count": 122,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "The Supreme Court on Wednesday upheld a Tennessee law that prohibits some medical treatments for transgender youths, shielding similar laws in more than 20 other states. Adam Liptak, who covers the Supreme Court, describes the three factions of justices in the 6-to-3 decision. Video by Adam Liptak, Alexandra Ostasiewicz, David Jouppi and Jon Hazell/The New York Times. #transgender #SCOTUS #Tennessee"
      },
      {
        "username": "nytimes",
        "view_count": 27766,
        "comment_count": 37,
        "create_time": 1750362300,
        "id": 7517744712447528247,
        "video_description": "On June 19, 1865, enslaved African Americans in Texas were told they were free. A century and a half later, people across the U.S. continue to celebrate the day, which is now a federal holiday. Here's what to know.  #Juneteenth #Texas #history #FreedomDay #EmancipationDay",
        "like_count": 2978,
        "region_code": "US",
        "share_count": 241
      },
      {
        "view_count": 1298874,
        "create_time": 1750356585,
        "id": 7517724140472683789,
        "like_count": 48918,
        "share_count": 1226,
        "username": "nytimes",
        "video_description": "The national park of Zhangjiajie in central China is famous for the towering sandstone pillars that inspired the alternate universe in the 2009 blockbuster “Avatar.” But in recent weeks, the area has become known for its trash-filled caves.  #zhangjiajie #china #environment #caves #avatar ",
        "comment_count": 445,
        "region_code": "US"
      },
      {
        "username": "nytimes",
        "comment_count": 372,
        "like_count": 10910,
        "region_code": "US",
        "share_count": 208,
        "video_description": "A cremation ceremony was held for Kinal Mistry, a victim of the Air India crash who hailed from a community that took pride in those who went abroad. Her family said she was someone who would “fulfill everyone’s dreams.” #AirIndia #PlaneCrash",
        "view_count": 237732,
        "create_time": 1750348826,
        "id": 7517690716710112526
      },
      {
        "view_count": 94207,
        "create_time": 1750348200,
        "like_count": 4265,
        "video_description": "After weeks of federal agents mounting increasingly aggressive ICE raids across the U.S., President Trump’s border czar, Tom Homan, spoke with The New York Times about the administration’s deportation strategy and what is to come. Listen to \"The Daily.\" #TheDaily #ICE #immigration #Trump",
        "share_count": 122,
        "username": "nytimes",
        "comment_count": 812,
        "id": 7517683179965123895,
        "region_code": "US"
      },
      {
        "create_time": 1750322236,
        "id": 7517576261682711821,
        "like_count": 9716,
        "region_code": "US",
        "share_count": 1419,
        "username": "nytimes",
        "video_description": "A SpaceX Starship rocket exploded in a huge fireball on a test stand during preparations for its next launch at the Elon Musk-led company’s base in South Texas. #SpaceX #Rocket #Texas",
        "comment_count": 943,
        "view_count": 175072
      },
      {
        "share_count": 11,
        "video_description": "Lawmakers in the UK approved plans to introduce medically assisted suicide for terminally ill patients in England and Wales. Legislators supported the proposal by a vote of 314 to 291. The bill now goes to the unelected second chamber of the Parliament, the House of Lords. #UK #England #Wales #health",
        "view_count": 23353,
        "comment_count": 35,
        "create_time": 1750453800,
        "id": 7518137702382849293,
        "like_count": 1215,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "region_code": "US",
        "share_count": 132,
        "id": 7518089435276119309,
        "like_count": 2562,
        "username": "nytimes",
        "video_description": "Tens of thousands of demonstrators took to the streets across Iran, Lebanon and Iraq on Friday to protest against Israel’s attacks as Israel and Iran continued to trade fire.  #Iran #Lebanon #Iraq #middleeast",
        "view_count": 36878,
        "comment_count": 246,
        "create_time": 1750441616
      },
      {
        "create_time": 1750431604,
        "id": 7518046429579906317,
        "username": "nytimes",
        "view_count": 37208,
        "comment_count": 58,
        "like_count": 4615,
        "region_code": "US",
        "share_count": 108,
        "video_description": "This summer marks the 50th anniversary of “Jaws,” the first blockbuster. But would a movie like that be greenlit today? Probably not. Our film critic explains why. #Jaws #Movie #MovieHistory #FilmHistory"
      },
      {
        "create_time": 1750538125,
        "id": 7518503802681527565,
        "username": "nytimes",
        "share_count": 2713,
        "video_description": "A video message by Campbell Wilson, Air India’s chief executive, drew criticism for closely resembling what the head of American Airlines said after a deadly crash in Washington months earlier. Read more at the link in our bio. #AirIndia #AmericanAirlines",
        "view_count": 262211,
        "comment_count": 351,
        "like_count": 11832,
        "region_code": "US"
      },
      {
        "view_count": 46571,
        "comment_count": 183,
        "like_count": 1615,
        "region_code": "US",
        "share_count": 29,
        "username": "nytimes",
        "video_description": "The comedian Andrew Schulz is known for his defiantly anti-woke standup as well as his influential podcasts. He recently spoke about his growing political influence, frustrations with the media and more. Watch, read or listen to “The Interview.” An earlier version of this video included an editing error. We deleted the incorrect video. #AndrewSchulz #podcasts",
        "create_time": 1750535184,
        "id": 7518491214715342135
      },
      {
        "comment_count": 35,
        "create_time": 1750476000,
        "id": 7518232842258746637,
        "region_code": "US",
        "share_count": 54,
        "username": "nytimes",
        "like_count": 1017,
        "video_description": "President Trump’s executive orders have sought to reframe the history of race and culture in America. Erica L. Green, a White House correspondent for The New York Times, describes the efforts to erase Black history. #Trump",
        "view_count": 13050
      },
      {
        "region_code": "US",
        "share_count": 13,
        "username": "nytimes",
        "video_description": "“There are no rights in such situations. It felt like kidnapping.” Mahmoud Khalil, a Columbia University graduate and pro-Palestinian activist, was the first student protester targeted and detained by the Trump administration. On Friday, after having spent more than three months in detention, he was released on bail. #trump #mahmoudkhalil",
        "view_count": 12448,
        "comment_count": 24,
        "create_time": 1750619427,
        "like_count": 818,
        "id": 7518853040552578318
      },
      {
        "comment_count": 97,
        "create_time": 1750617151,
        "id": 7518843248970845495,
        "share_count": 76,
        "username": "nytimes",
        "like_count": 1437,
        "region_code": "US",
        "video_description": "In a briefing at the Pentagon, officials said the U.S. strikes caused “severe damage” to Iranian nuclear sites. But neither Defense Secretary Pete Hegseth nor the chairman of the Joint Chiefs of Staff could immediately say whether Iran still retained the ability to make a nuclear weapon. #iran #trump",
        "view_count": 28929
      },
      {
        "comment_count": 207,
        "id": 7518659936168021262,
        "region_code": "US",
        "video_description": "American warplanes and submarines attacked three key nuclear sites in Iran early Sunday, bringing the U.S. military directly into Israel’s war and prompting fears that the strikes could lead to more dangerous escalations across the Middle East. After attacking Iran, President Trump warned of more strikes “if peace does not come quickly.” #trump #israel #iran ",
        "view_count": 79702,
        "create_time": 1750574500,
        "like_count": 4685,
        "share_count": 556,
        "username": "nytimes"
      },
      {
        "comment_count": 1291,
        "like_count": 39603,
        "username": "nytimes",
        "share_count": 3687,
        "video_description": "The U.S. has entered Israel’s war against Iran, attacking three nuclear sites on Saturday. In an address from the White House, President Trump said the aim “was the destruction of Iran’s nuclear capacity” and warned of more attacks “if peace does not come quickly.” Follow live updates and see analysis at the link in our bio. #trump #iran #israel ",
        "view_count": 750190,
        "create_time": 1750564181,
        "id": 7518615750521703735,
        "region_code": "US"
      },
      {
        "share_count": 37,
        "username": "nytimes",
        "video_description": "American warplanes and submarines attacked three nuclear sites in Iran, bringing the U.S. military directly into the war after days of uncertainty about whether President Trump would intervene. #iran #israel #trump #US ",
        "view_count": 27561,
        "comment_count": 171,
        "create_time": 1750561693,
        "id": 7518605058347437325,
        "like_count": 744,
        "region_code": "US"
      },
      {
        "comment_count": 37,
        "create_time": 1750720200,
        "id": 7519276452878060814,
        "region_code": "US",
        "share_count": 62,
        "username": "nytimes",
        "video_description": "Iran launched missiles on Monday at the Al Udeid Air Base, the largest U.S. military installation in the Middle East, in retaliation for U.S. strikes on its nuclear sites. Qatar said its air defenses had intercepted the missiles, and the U.S. Defense Department reported no injuries. #Iran #Qatar #missiles",
        "view_count": 30604,
        "like_count": 1143
      },
      {
        "create_time": 1750718400,
        "id": 7519273008859516174,
        "region_code": "US",
        "share_count": 44,
        "username": "nytimes",
        "video_description": "Over the past week, President Trump claimed he would make a decision about Iran in “two weeks” and repeatedly pressed it to come to the negotiating table. But the swiftness of the attack on Saturday night suggests that plans were underway after Israel began its bombing campaign against Iran a little more than a week ago. #Israel #Iran #Trump",
        "view_count": 20742,
        "comment_count": 76,
        "like_count": 1356
      },
      {
        "username": "nytimes",
        "view_count": 108918,
        "comment_count": 485,
        "create_time": 1750712529,
        "id": 7519252917346389303,
        "like_count": 5992,
        "share_count": 238,
        "region_code": "US",
        "video_description": "With his strikes on Iran, President Trump is betting that the U.S. can repel any retaliation and that the attacks destroyed the regime’s chances of reconstituting Iran’s nuclear program. David Sanger, the White House and national security correspondent for The New York Times, explains the risk. Video by David E. Sanger, Alexandra Ostasiewicz and James Surdam #Iran#Israel#Trump"
      },
      {
        "create_time": 1750702500,
        "id": 7519205348658384142,
        "username": "nytimes",
        "video_description": "More than 190 firefighters in Greece are battling a series of wildfires on the island of Chios, where officials declared an emergency and a dozen communities were evacuated over the weekend, according to state media. The authorities are investigating the fires as arson.  #Greece #Chios #wildfires",
        "view_count": 219896,
        "comment_count": 184,
        "like_count": 13118,
        "region_code": "US",
        "share_count": 1288
      },
      {
        "create_time": 1750692300,
        "region_code": "US",
        "username": "nytimes",
        "comment_count": 125,
        "id": 7519161677879774478,
        "like_count": 3520,
        "share_count": 138,
        "video_description": "When President Trump took office, USAID was one of the first agencies to be dismantled, as he froze aid funding and Elon Musk's DOGE team cut most staff members. Amy Schoenfeld Walker, our reporter who has been tracking the foreign aid cuts and restorations, shares what she’s learned.  Video by Amy Schoenfeld Walker, Christina Thornell, Nikolay Nikolov, Claire Hogan, Melanie Bencosme, Laura Salaberry #USAID #aid #Trump #ElonMusk #DOGE",
        "view_count": 29619
      },
      {
        "region_code": "US",
        "share_count": 43,
        "video_description": "Protests were held around the world on Sunday against the Trump administration’s airstrikes on Iran. Demonstrators at several locations carried Iranian flags, and some held signs and placed banners across fences and buildings that read “No War in Iran!” Video by Nailah Morgan/The New York Times #Iran#Israel#Trump#protests",
        "view_count": 19240,
        "comment_count": 57,
        "create_time": 1750687521,
        "id": 7519145362813226254,
        "like_count": 1223,
        "username": "nytimes"
      },
      {
        "comment_count": 8,
        "like_count": 247,
        "share_count": 7,
        "create_time": 1750682999,
        "id": 7519125818572934413,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "From @theathletic: The Thunder capped off one of the greatest seasons in NBA history after defeating the Indiana Pacers in seven games to clinch the franchise's first NBA championship since it relocated from Seattle to Oklahoma City. #NBA #nbafinals #playoffs #tyresehaliburton",
        "view_count": 10128
      },
      {
        "share_count": 22,
        "username": "nytimes",
        "comment_count": 44,
        "id": 7519652770513685773,
        "region_code": "US",
        "video_description": "Christina Goldbaum, a New York Times reporter, and Katrin Bennhold, a senior writer on the international desk, discuss how the power dynamics in the Middle East could change as Iran has become more isolated. #Iran",
        "view_count": 19924,
        "create_time": 1750806600,
        "like_count": 603
      },
      {
        "like_count": 299,
        "region_code": "US",
        "share_count": 11,
        "view_count": 12744,
        "comment_count": 29,
        "id": 7519601814665170189,
        "video_description": "Mish and Lucy, two 5-year-old brown bears, escaped their enclosure on Monday and broke into their stockpile of treats at a wildlife sanctuary in Devon, England. The two of them devoured a week’s worth of honey in about an hour. #Bears #Devon",
        "create_time": 1750793765,
        "username": "nytimes"
      },
      {
        "region_code": "US",
        "username": "nytimes",
        "video_description": "President Trump lashed out at Israel and Iran on Tuesday for launching attacks after he had announced a cease-fire. Iran denied violating the truce and Israel’s retaliation appeared limited, suggesting that the deal remained intact for now. Follow live updates. #Trump #Iran #Israel #ceasefire",
        "comment_count": 17624,
        "id": 7519520646267768119,
        "like_count": 488228,
        "share_count": 50220,
        "view_count": 8032474,
        "create_time": 1750774891
      },
      {
        "username": "nytimes",
        "comment_count": 63,
        "create_time": 1750887944,
        "like_count": 659,
        "video_description": "President Trump laid into Spain during the NATO summit at The Hague on Wednesday, after it broke ranks with the other member states and declined to increase its military spending to 5% of its economic output over a decade. #NATO",
        "view_count": 28382,
        "id": 7520006316165778702,
        "region_code": "US",
        "share_count": 18
      },
      {
        "comment_count": 286,
        "create_time": 1750883285,
        "share_count": 138,
        "username": "nytimes",
        "id": 7519986316109434125,
        "like_count": 5600,
        "region_code": "US",
        "video_description": "President Trump said on Wednesday that the cease-fire between Israel and Iran was “going very well.” After a shaky start, a sense of normalcy returned to the warring countries on Wednesday as the truce appeared to hold. #Iran #Israel #ceasefire",
        "view_count": 80925
      },
      {
        "share_count": 129,
        "username": "nytimes",
        "view_count": 49134,
        "comment_count": 139,
        "like_count": 3911,
        "region_code": "US",
        "create_time": 1750880964,
        "id": 7519976312761568526,
        "video_description": "After one of the most brutal wars of this century, a new flag flies across Syria: the emblem of the rebels who toppled the dictator Bashar al-Assad. Ben Hubbard, The New York Times’s Istanbul bureau chief, describes what our journalists learned as they drove across Syria, meeting people in towns and cities along the way as they strove to rise from the wreckage and build new lives. Video by Ben Hubbard, David Guttenfelder, Rebecca Suner and James Surdam #syria #middleeast"
      },
      {
        "view_count": 36287,
        "comment_count": 43,
        "create_time": 1750874714,
        "id": 7519949572551052557,
        "username": "nytimes",
        "like_count": 864,
        "region_code": "US",
        "share_count": 45,
        "video_description": "Videos show smoke coming out of the right engine of an American Airlines passenger jet heading from Las Vegas to Charlotte, North Caolina. The plane turned around and landed safely after the crew reported an engine issue, the FAA said."
      },
      {
        "comment_count": 99,
        "id": 7519936604497136951,
        "like_count": 1395,
        "share_count": 130,
        "create_time": 1750871699,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Kenyan police fired live rounds, tear gas and rubber projectiles at protesters who were in the streets a year after massive anti-government demonstrations against a contentious tax plan turned deadly. #Kenya #kenyaprotests",
        "view_count": 27154
      },
      {
        "comment_count": 34,
        "create_time": 1750849252,
        "share_count": 7,
        "video_description": "A Falcon 9 rocket propelled four people toward the International Space Station on Wednesday morning, including astronauts from Hungary, India and Poland — three countries that have never sent anyone to the orbiting laboratory before. #astronaut #space",
        "view_count": 8989,
        "id": 7519840194791574797,
        "like_count": 448,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "like_count": 1423,
        "region_code": "US",
        "share_count": 27,
        "comment_count": 98,
        "create_time": 1750842648,
        "id": 7519811850087730487,
        "username": "nytimes",
        "video_description": "Zohran Mamdani, a little-known state lawmaker whose progressive platform and campaign trail charisma electrified younger voters, stunned former Gov. Andrew Cuomo in the Democratic primary for mayor of New York City on Tuesday night, building a lead so commanding that Cuomo conceded. #NewYork #mayor",
        "view_count": 15276
      },
      {
        "username": "nytimes",
        "view_count": 3124640,
        "comment_count": 28218,
        "like_count": 137835,
        "share_count": 7627,
        "video_description": "A group of six young men traveled to Atlanta before dawn and tore Pride flags at a rainbow crosswalk, the police said. Four of them had been arrested but two remain at large as the authorities consider hate crime charges. #Atlanta",
        "create_time": 1750812600,
        "id": 7519676721260498189,
        "region_code": "US"
      },
      {
        "id": 7520371831069609271,
        "like_count": 69529,
        "share_count": 8434,
        "create_time": 1750973028,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Two swirling waterspouts were spotted in the Tampa Bay, Florida, area on Sunday. Waterspouts are a common occurrence in Florida during the summer. #Tampa #Waterspout #Florida",
        "view_count": 582617,
        "comment_count": 687
      },
      {
        "create_time": 1750962862,
        "id": 7520328174006209805,
        "share_count": 474,
        "video_description": "Wesley Morris has a confession to make: He loves Bruno Mars. Nothing wrong with that, right? With the help of the culture writer Niela Orr, Wesley untangles his crush from his discomfort with the pop star’s cozy relationship to Blackness on \"Cannonball,\" a new weekly culture podcast. Watch or listen to the first episode at the link above or at youtube.com/@CannonballPodcast. #BrunoMars#Cannonball #WesleyMorris #NielaOrr",
        "view_count": 53752,
        "comment_count": 591,
        "like_count": 3377,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "id": 7520300206169050381,
        "share_count": 38,
        "view_count": 20793,
        "username": "nytimes",
        "video_description": "The Ecuadorean president said José Adolfo Macías, the leader of the infamous Los Choneros criminal organization, who is known as “Fito,” will be extradited to the U.S., where he’s accused of drug trafficking and weapons smuggling. #ecuador",
        "comment_count": 13,
        "create_time": 1750957500,
        "like_count": 747,
        "region_code": "US"
      },
      {
        "username": "nytimes",
        "view_count": 12302,
        "create_time": 1750960800,
        "share_count": 13,
        "like_count": 545,
        "region_code": "US",
        "video_description": "President Trump has signaled plans to phase out the Federal Emergency Management Agency after this year’s hurricane season. As storms continue to hit, smaller nonprofit groups and individuals are stepping in to help aid recovery efforts. Emily Cochrane, a reporter for The New York Times, takes us to Kentucky, where one group is cleaning up after tornadoes hit in May. Video by Emily Cochrane, Kassie Bracken, Christina Shaman, Laura Bult and Allison Joyce/The New York Times #fema #hurricane #trump",
        "comment_count": 36,
        "id": 7520299617792150798
      },
      {
        "region_code": "US",
        "username": "nytimes",
        "id": 7520298961408740663,
        "like_count": 3137,
        "share_count": 121,
        "video_description": "For the last decade, car companies have received credits as an incentive to provide start-stop technology, which shuts off a stopped car’s engine, to reduce emissions. The EPA administrator, Lee Zeldin, says “everyone hates” the feature and has vowed to eliminate the credit. Ben Blatt, who writes about regulatory conundrums, looks at its history and future. Video by Ben Blatt, Gabriel Blanco, Karen Hanley and David Jouppi #cars #environment #climate",
        "view_count": 49173,
        "comment_count": 194,
        "create_time": 1750956059
      },
      {
        "id": 7520216465564241207,
        "region_code": "US",
        "username": "nytimes",
        "view_count": 54563,
        "comment_count": 91,
        "create_time": 1750936856,
        "like_count": 1124,
        "share_count": 44,
        "video_description": "This week, Jeff Bezos, the founder of Amazon and one of the world’s richest men, is set to marry Lauren Sánchez, a former TV reporter, in Venice, Italy, where some locals are already upset about the event. Read everything we know about the wedding at the link in our bio. #Venice #wedding"
      },
      {
        "comment_count": 328,
        "create_time": 1750907400,
        "like_count": 12831,
        "video_description": "Emma Fitzsimmons, City Hall bureau chief for The New York Times, explains how State Assemblyman Zohran Mamdani claimed victory over former Gov. Andrew Cuomo. #Mamdani #newyorkcity",
        "id": 7520082336763923725,
        "region_code": "US",
        "share_count": 140,
        "username": "nytimes",
        "view_count": 147037
      },
      {
        "like_count": 453,
        "region_code": "US",
        "share_count": 2,
        "username": "nytimes",
        "id": 7520759649260309773,
        "create_time": 1751065800,
        "video_description": "Mohsen Naghib-Hashemi, a graphic designer from Tehran, said his home and car were significantly damaged during the fighting between Israel and Iran. He described to The New York Times the challenges he faces in rebuilding his life. #iran #israel",
        "view_count": 10878,
        "comment_count": 18
      },
      {
        "comment_count": 180,
        "create_time": 1751033201,
        "id": 7520630108361624846,
        "region_code": "US",
        "share_count": 938,
        "video_description": "Sam Altman, the founder of OpenAI, and Brad Lightcap, the company's chief operating officer, joined the hosts Casey Newton and Kevin Roose for a special live recording of @hardfork where the group discussed Mark Zuckerberg and Meta's poaching of OpenAI's employees. Listen to the recap at the link above. Video by Pat Gunther, Chris Schodt and Sophie Erickson #SamAltman #OpenAI #HardFork",
        "like_count": 13783,
        "username": "nytimes",
        "view_count": 276948
      },
      {
        "region_code": "US",
        "share_count": 29,
        "video_description": "More than 500 directors, actors and other names in Hollywood and around the world voted on the best films released since Jan. 1, 2000. See the full list at the link in our bio. Video by By Kyle Buchanan, Mekado Murphy, Leila Medina, Laura Salaberry, Alexandra Ostasiewicz, Gabriel Blanco and Harvey Glen #bestmovies",
        "create_time": 1751028909,
        "id": 7520611499312778510,
        "username": "nytimes",
        "view_count": 7055,
        "comment_count": 6,
        "like_count": 260
      },
      {
        "region_code": "US",
        "username": "nytimes",
        "view_count": 124737,
        "comment_count": 158,
        "create_time": 1750985584,
        "id": 7520425650830855438,
        "like_count": 11231,
        "share_count": 198,
        "video_description": "Tanner Martin documented his five-year-long battle against colon cancer for his hundreds of thousands of followers on social media before passing away at age 30. He left behind his young family and a legacy of candid honesty about living with cancer. #cancer"
      },
      {
        "comment_count": 165,
        "create_time": 1751154528,
        "region_code": "US",
        "share_count": 176,
        "username": "nytimes",
        "id": 7521151299820227895,
        "like_count": 6222,
        "video_description": "Facing drought after drought, Los Angeles has managed to reduce its water use by more than a third, even as the population has grown. Michael Kimmelman, editor at large of Headway, a team at The New York Times focused on paths to progress on big challenges, reports. #losangeles #water #environment #drought ",
        "view_count": 72031
      },
      {
        "comment_count": 52,
        "create_time": 1751152003,
        "like_count": 458,
        "share_count": 2,
        "username": "nytimes",
        "id": 7521140447150935310,
        "region_code": "US",
        "video_description": "Minnesota State Representative Melissa Hortman and her husband, Mark, were remembered at their funeral on Saturday as “extraordinary public servants” who were killed in an inexplicable act of political violence. #Minnesota #MelissaHortman #Minneapolis #TimWalz ",
        "view_count": 7602
      },
      {
        "comment_count": 18,
        "like_count": 152,
        "share_count": 24,
        "video_description": "Global demand for Labubu plush toys, sold by the Chinese company Pop Mart, has sparked a wave of fakes — putting Chinese customs authorities in a near-daily battle against counterfeits.",
        "view_count": 7073,
        "create_time": 1751076600,
        "id": 7520778234548555063,
        "region_code": "US",
        "username": "nytimes"
      },
      {
        "comment_count": 68,
        "share_count": 26,
        "username": "nytimes",
        "video_description": "At the Minnesota State Capitol, mourners lined up to pay their respects to State Representative Melissa Hortman and her husband, Mark, who were assassinated at their home earlier this month. #Minnesota",
        "create_time": 1751069400,
        "id": 7520776720677375287,
        "like_count": 2276,
        "region_code": "US",
        "view_count": 29494
      },
      {
        "like_count": 647,
        "region_code": "US",
        "username": "nytimes",
        "video_description": "Crew members rescued two passengers from a Disney cruise after they drifted in the sea away from the ship. Witnesses said that they had seen a girl fall overboard and a man, possibly her father, go in after her. #DisneyCruise",
        "view_count": 22532,
        "comment_count": 35,
        "create_time": 1751317113,
        "id": 7521849651570511117,
        "share_count": 25
      },
      {
        "create_time": 1751314200,
        "id": 7521832688135802126,
        "share_count": 583,
        "username": "nytimes",
        "comment_count": 115,
        "region_code": "US",
        "video_description": "Spain, France, Portugal, Greece and Italy have experienced record temperatures, and the extreme heat is forecast to persist into the middle of the week. Meteorologists warn that Europe can expect more and hotter heat waves in the future because of climate change. #Spain #France #Portugal #Greece #Italy #heatwave #climatechange",
        "view_count": 76039,
        "like_count": 5845
      },
      {
        "like_count": 246,
        "region_code": "US",
        "share_count": 11,
        "video_description": "Sam Altman, the founder of OpenAI, joined the hosts Kevin Roose and Casey Newton for a special live recording of @hardfork where he talked about how he'd feel if his child had an \"A.I. friend.\" Video by Pat Gunther, Chris Schodt and Sophie Erickson #SamAltman #OpenAI #HardFork #ChatGPT",
        "view_count": 6656,
        "id": 7521745314651327799,
        "create_time": 1751292818,
        "username": "nytimes",
        "comment_count": 19
      },
      {
        "create_time": 1751271852,
        "share_count": 1215,
        "video_description": "A gunman deliberately started a wildfire in a rugged mountain area of Idaho and then shot at the firefighters who responded, killing two and injuring another on Sunday afternoon in what the local sheriff described as a “total ambush.” #Idaho #News",
        "view_count": 108356,
        "comment_count": 380,
        "like_count": 10092,
        "region_code": "US",
        "username": "nytimes",
        "id": 7521655262785080590
      },
      {
        "comment_count": 20,
        "like_count": 329,
        "region_code": "US",
        "view_count": 4415,
        "video_description": "These nuns in Brazil went viral for beatboxing. Using their newfound fame to draw attention to the Catholic Church, they are part of a wider movement within the church to let go, loosen up and meet younger audiences where they are: online. Jack Nicas, our Brazil bureau chief, went behind the scenes as the nuns recorded their first music video. Read more at the link in our bio. Video by Jack Nicas, Victor Moriyama, Christina Shaman, Rebecca Suner and Laura Salaberry/The New York Times #Brazil #CatholicChurch ",
        "create_time": 1751242338,
        "id": 7521528409676205367,
        "share_count": 35,
        "username": "nytimes"
      }
    ]
  }
}