{
  "data": {
    "videos": [
      {
        "create_time": 1748821333,
        "like_count": 8697,
        "share_count": 919,
        "view_count": 185076,
        "comment_count": 149,
        "id": 7511130286462143787,
        "region_code": "US",
        "username": "vice",
        "video_description": "Why Prayers vocalist Leafer Seyer joined a gang at 13 years old. Tap the link in bio to watch the full video."
      },
      {
        "comment_count": 434,
        "id": 7510999642293767470,
        "username": "vice",
        "share_count": 1997,
        "video_description": "The mainstream Mormon church abandoned polygamy over 100 years ago, but splinter groups across Utah still practice plural marriage. One such group is the Kingston Clan, known to members as The Order. The Kingstons live in Salt Lake City and run their religion like a secretive business empire. Back in 2016, VICE met Joe Robinson, a young man banished from The Order. This is his story. Tap the link in bio to watch.",
        "view_count": 460758,
        "create_time": 1748790914,
        "like_count": 32398,
        "region_code": "US"
      },
      {
        "view_count": 47403,
        "like_count": 2921,
        "create_time": 1748736550,
        "id": 7510766124095769902,
        "region_code": "US",
        "share_count": 162,
        "username": "vice",
        "video_description": "“It’s just me and Macklemore out here.” Revisit the full episode of The People vs Mac Miller from 2014 at the link in bio.",
        "comment_count": 61
      },
      {
        "id": 7511872709135961386,
        "share_count": 496,
        "comment_count": 57,
        "create_time": 1748994189,
        "like_count": 5103,
        "region_code": "US",
        "username": "vice",
        "video_description": "Go to an underground hardcore show in South Korea. The New York hardcore scene extends way beyond the Big Apple. Watch the full episode of Beyond the Influence, originally published in 2015, at the link in bio.",
        "view_count": 103641
      },
      {
        "like_count": 1043,
        "region_code": "US",
        "username": "vice",
        "video_description": "Don’t ask Tyler, the Creator ’is the album good?’ Tap the link in bio to revisit VICE's episode of 'Ask Tyler Anything' from 2013.",
        "comment_count": 23,
        "create_time": 1748909110,
        "id": 7511507272728644907,
        "share_count": 25,
        "view_count": 43190
      },
      {
        "region_code": "US",
        "username": "vice",
        "video_description": "Only in Florida... Dillon purchased a bumper sticker in May of 2019. Little did he know that sticker would get him arrested, turn him into a viral news sensation, and cause him to become a champion for the First Amendment of our nation’s Constitution. Lake City, Florida will never be the same. Tap the link in bio to watch.",
        "share_count": 33566,
        "view_count": 11585511,
        "comment_count": 9950,
        "create_time": 1749057729,
        "id": 7512145622464466222,
        "like_count": 763671
      },
      {
        "like_count": 2544,
        "username": "vice",
        "id": 7512248493080104238,
        "create_time": 1749081679,
        "region_code": "US",
        "share_count": 65,
        "video_description": "“Don’t protest. Don’t go outside and start a revolution. Go and comment on YouTube. That’s how you can make a real change in the world.” Mac Miller shared his thoughts on religion and trying to make a change via YouTube comments. Watch the full interview from 2014 at the link in bio.",
        "view_count": 404738,
        "comment_count": 122
      },
      {
        "video_description": "‘Keith Ape is artistry.’ Revisit how the US embraced his sound and style in an episode of Noisey Raps, originally published in 2015, at the link in bio.",
        "view_count": 93790,
        "like_count": 271,
        "region_code": "US",
        "share_count": 4,
        "username": "vice",
        "comment_count": 13,
        "create_time": 1749168207,
        "id": 7512620088655088942
      },
      {
        "region_code": "US",
        "share_count": 260,
        "view_count": 53431,
        "like_count": 1160,
        "create_time": 1749312307,
        "id": 7513238922755968298,
        "username": "vice",
        "video_description": "\"I have 36 kids with 6 more on the way...\" Men like Kyle are meeting the sperm donor demand that spiked during the pandemic as more women are getting fed up with expensive sperm banks. Back in 2021, VICE followed Kyle to find out what this lifestyle is really like. Tap the link in bio to watch.",
        "comment_count": 38
      },
      {
        "create_time": 1749407107,
        "region_code": "US",
        "share_count": 11,
        "video_description": "Why are so many young men taking ED medication? We asked dealers, doctors, men, and women to find out what’s fueling this trend. Tap the link in bio to watch.",
        "comment_count": 7,
        "id": 7513646174667050282,
        "like_count": 334,
        "username": "vice",
        "view_count": 16156
      },
      {
        "id": 7513362927144160558,
        "share_count": 1,
        "username": "vice",
        "video_description": "That time Issa Gold from The Underachievers had to do acid in front of cops. Tap the link in bio to watch more.",
        "comment_count": 2,
        "create_time": 1749341170,
        "like_count": 149,
        "region_code": "US",
        "view_count": 17525
      },
      {
        "create_time": 1749427810,
        "share_count": 7,
        "username": "vice",
        "video_description": "Vanessa Carlton’s mom knew ‘A Thousand Miles’ would be a hit the first time she heard it. Tap the link in bio to hear the full story behind the song.",
        "view_count": 11449,
        "comment_count": 6,
        "id": 7513735051872423210,
        "like_count": 228,
        "region_code": "US"
      },
      {
        "region_code": "US",
        "share_count": 932,
        "username": "vice",
        "create_time": 1749515888,
        "id": 7514113356983373102,
        "like_count": 32614,
        "video_description": "Who Shot Biggie? Back in 2019, Greg Kading, the LAPD Detective who investigated the murders of both Tupac and Biggie, shared his theory. Tap the link in bio to watch more.",
        "view_count": 1148546,
        "comment_count": 657
      },
      {
        "comment_count": 4,
        "create_time": 1749666310,
        "share_count": 2,
        "id": 7514759397332077870,
        "like_count": 582,
        "region_code": "US",
        "username": "vice",
        "video_description": "Caitlin AKA @manicpixiemom cleans old gravestones and shares stories about the lives and deaths of the people who lie underneath them. Using the Internet, she has researched the best methods to bring a gravestone back to life, and she’s inspiring her followers to do the same. Tap the link in bio to watch.",
        "view_count": 18146
      },
      {
        "comment_count": 3,
        "create_time": 1749601028,
        "id": 7514479125713734955,
        "region_code": "US",
        "video_description": "How a black metal artist would say the word ‘kill’ Watch more of VICE’s documentary with Xasthur, Leviathan, and Striborg: Black Metal’s Unexplored Fringes, originally published in 2012, at the link in bio.",
        "like_count": 357,
        "share_count": 9,
        "username": "vice",
        "view_count": 13864
      },
      {
        "view_count": 8066,
        "create_time": 1749743113,
        "region_code": "US",
        "video_description": "An example of true New York style to some, the beginning of f*ckboy summer to others – this is Coney Island's Mermaid Parade. In a new episode of GATHERINGS, VICE host Jackson Garrett hitches a ride to Coney Island to find out what NYC's weirdest party means to those who attend it. Tap the link in bio to watch.",
        "share_count": 24,
        "username": "vice",
        "comment_count": 3,
        "id": 7515089375760485678,
        "like_count": 230
      },
      {
        "create_time": 1749854830,
        "like_count": 195,
        "region_code": "US",
        "comment_count": 1,
        "id": 7515569122042744107,
        "share_count": 1,
        "username": "vice",
        "video_description": "“I found that as the years go by, the solitude that I used to enjoy so much is becoming a problem. It’s more like a window into depression.” Striborg reflects on his long-term solitude and using nature to inspire his music. Watch more of VICE’s documentary with Xasthur, Leviathan, and Striborg: Black Metal’s Unexplored Fringes, originally published in 2012, at the link in bio.",
        "view_count": 6847
      },
      {
        "like_count": 519,
        "view_count": 11876,
        "video_description": "No, you can't be born with it. Get lost in the sauce with Gucci Mane. Tap the link in bio to watch more.",
        "comment_count": 10,
        "create_time": 1749772867,
        "id": 7515217179516882222,
        "region_code": "US",
        "share_count": 43,
        "username": "vice"
      },
      {
        "region_code": "US",
        "username": "vice",
        "video_description": "“That’s really what it’s about: Changing their moods, making them feel better, making them forget their problems.” For Metro Boomin, music is the medicine. Tap the link in bio to watch more.",
        "create_time": 1749938353,
        "id": 7515927820078697774,
        "like_count": 119,
        "comment_count": 2,
        "share_count": 6,
        "view_count": 5849
      },
      {
        "like_count": 1214,
        "video_description": "C-O-M-E to Coney Island's Mermaid Parade and you'll run into some of New York's most creative characters... In the latest episode of GATHERINGS, VICE host Jackson Garrett explores NYC's oddest tradition, and the people who celebrate it. This is Mermaid Parade. Tap the link in bio to watch.",
        "view_count": 137081,
        "comment_count": 1353,
        "id": 7515833977702288683,
        "share_count": 655,
        "username": "vice",
        "create_time": 1749916507,
        "region_code": "US"
      },
      {
        "username": "vice",
        "view_count": 8011,
        "create_time": 1749995131,
        "like_count": 423,
        "region_code": "US",
        "share_count": 12,
        "video_description": "\"Taking somebody who's in obscurity and turning them into a face that the world recognizes in an extremely short period of time is not good for people. It does actually kill people...\" A candid @officialrickastley discusses the burnout he felt following the success of Never Gonna Give You Up. Tap the link in bio to watch.",
        "comment_count": 9,
        "id": 7516171656432209195
      },
      {
        "video_description": "A former black hat hacker talks about the reality of just how vulnerable our systems really are - from the very real threat of hackers taking the American power grid or medical facilities offline, to how easily accessible our private information is to anyone with WiFi and some time on their hands. Tap the link in bio to watch.",
        "view_count": 16700,
        "comment_count": 8,
        "create_time": 1750105572,
        "id": 7516646047507074317,
        "like_count": 288,
        "region_code": "US",
        "share_count": 7,
        "username": "vice"
      },
      {
        "create_time": 1750038248,
        "id": 7516356950737587499,
        "like_count": 4355,
        "video_description": "Shirley Manson can pinpoint the exact moment her band 'failed.' Revisit VICE's 2016 interview with Manson where she discusses body image struggles, fetishizing the 90s, and the genius of Beyoncé. Tap the link in bio to watch.",
        "view_count": 98998,
        "comment_count": 219,
        "region_code": "US",
        "share_count": 191,
        "username": "vice"
      },
      {
        "id": 7516725420616699179,
        "share_count": 353,
        "username": "vice",
        "video_description": "What happens when an Ed Sheeran lookalike walks into a club In 2021, VICE spoke to the man who resembles one of the biggest pop stars on the planet and uses that that fact to get the red carpet treatment and trick his way into some of the world’s most exclusive events. Tap the link in bio to watch the full video.",
        "comment_count": 23,
        "create_time": 1750124050,
        "like_count": 11495,
        "region_code": "US",
        "view_count": 243471
      },
      {
        "id": 7517075723278945591,
        "like_count": 251,
        "region_code": "US",
        "video_description": "Take it from Post Malone, you don't have to be mean. Tap the link in bio to watch the full episode of The People vs. Post Malone from 2017.",
        "view_count": 7971,
        "create_time": 1750205591,
        "share_count": 6,
        "username": "vice",
        "comment_count": 15
      },
      {
        "comment_count": 46,
        "create_time": 1750461246,
        "id": 7518173745668771127,
        "like_count": 6196,
        "video_description": "Don't hand Kerry King a scalpel. He won't cut you, no matter how nicely you ask. Tap the link in bio to watch more of his conversation with King Diamond from 2015.",
        "region_code": "US",
        "share_count": 400,
        "username": "vice",
        "view_count": 97024
      },
      {
        "comment_count": 326,
        "create_time": 1750430409,
        "like_count": 17558,
        "region_code": "US",
        "share_count": 269,
        "username": "vice",
        "view_count": 515502,
        "id": 7518041272515448077,
        "video_description": "In the spring of 2019, former Pagan member Troy Harris was out at a bar with his wife when he was ambushed by several Pagans. Before the attack, Harris had left the Pagans to join their rivals, the Sutar Soldiers, where he was appointed Vice President. Tap the link in bio to watch this full episode of the VICE TV docuseries United Gangs of America. New episodes premiere on VICE TV every Tuesday at 9P ET."
      },
      {
        "username": "vice",
        "video_description": "“Music doesn’t really give you enough in return.” Why Xasthur has a love-hate relationship with music. Watch more of VICE’s documentary with Xasthur, Leviathan, and Striborg: Black Metal’s Unexplored Fringes, originally published in 2012, at the link in bio.",
        "like_count": 115,
        "share_count": 2,
        "id": 7517815697947364621,
        "region_code": "US",
        "view_count": 7042,
        "comment_count": 5,
        "create_time": 1750377910
      },
      {
        "create_time": 1750519815,
        "id": 7518425180364901687,
        "like_count": 71600,
        "region_code": "US",
        "comment_count": 2380,
        "username": "vice",
        "video_description": "Dangerous logic from a bufo shaman. Growing numbers of psychedelic tourists are traveling to Tulum where Bufo ceremonies are legal, in search of a life-changing experience. However, there are many reports of profoundly negative experiences, including allegations of sexual assault during ceremonies. Tap the link in bio to watch.",
        "view_count": 1099068,
        "share_count": 4293
      },
      {
        "create_time": 1750631169,
        "like_count": 139,
        "username": "vice",
        "share_count": 2,
        "video_description": "“Shut up and just enjoy or don’t enjoy [the music].” Revisit the full episode of The People vs Mac Miller from 2014 at the link in bio.",
        "view_count": 5305,
        "comment_count": 6,
        "id": 7518903442723687694,
        "region_code": "US"
      },
      {
        "create_time": 1750604166,
        "region_code": "US",
        "video_description": "Wise words from Maji at the craziest hippie festival in the jungle. Back in 2018, @ameliadimz was invited deep into the jungles of Costa Rica to attend Envision Festival and open her third eye through bitcoin conferences, Buddhist drum circles and vaginal eggs. Tap the link in bio to watch.",
        "username": "vice",
        "view_count": 7430,
        "comment_count": 5,
        "id": 7518787404417846542,
        "like_count": 272,
        "share_count": 6
      },
      {
        "like_count": 137,
        "region_code": "US",
        "share_count": 7,
        "username": "vice",
        "view_count": 9269,
        "comment_count": 4,
        "create_time": 1750552805,
        "id": 7518566845293677879,
        "video_description": "Why Australia's drill scene has 'no love' for the police Tap the link in bio to watch the full episode of Gangsta Rap International, originally published in 2019."
      },
      {
        "id": 7519215069150842125,
        "region_code": "US",
        "share_count": 2179,
        "username": "vice",
        "view_count": 93059,
        "comment_count": 110,
        "like_count": 10292,
        "video_description": "You've had honey, but have you ever had Nepalese Mad Honey? Nepal’s Gurung people live mostly in small villages in the vast Annapurna mountain ranges. In this remote region, they practice an ancient tradition of honey hunting where they descend towering cliffs on handmade ladders, to harvest honey nestled under jagged overhangs. In spring, the Gurung’s honey contains a rare substance called grayanotoxin from rhododendron flowers that’s known for its intoxicating effects. While some accounts say it’s a deadly poison, others refer to it as an aphrodisiac, powerful medicine, and a hallucinogenic drug. Back in 2016, VICE travelled deep into the Annapurna mountains to join a Gurung village on their spring hunt and understand Mad Honey's effects. Tap the link in bio to watch.",
        "create_time": 1750703709
      },
      {
        "comment_count": 7,
        "like_count": 157,
        "video_description": "Inside the music mind of 14-year-old Jaden Smith. Tap the link in bio to watch the full episode of Skating with Jaden, originally published in 2012.",
        "create_time": 1750729869,
        "id": 7519327380868041997,
        "region_code": "US",
        "share_count": 4,
        "username": "vice",
        "view_count": 5784
      },
      {
        "comment_count": 4,
        "like_count": 284,
        "region_code": "US",
        "username": "vice",
        "create_time": 1750868122,
        "id": 7519921251826109751,
        "share_count": 26,
        "video_description": "Sometimes, the most disturbing deathmatch moments are after the match is over. Back in 2016, VICE travelled to Delaware to get an inside look at one of the most violent forms of professional wrestling in the world – CZW's Tournament of Death. Tap the link in bio to watch.",
        "view_count": 6349
      },
      {
        "region_code": "US",
        "share_count": 77,
        "username": "vice",
        "view_count": 37880,
        "create_time": 1750811830,
        "like_count": 1608,
        "video_description": "The music executive who heard 'A Thousand Miles' and saved Vanessa Carlton from being dropped. Tap the link in bio to watch the full wild story behind the song.",
        "comment_count": 25,
        "id": 7519679503182875917
      },
      {
        "comment_count": 10,
        "create_time": 1750981870,
        "id": 7520409724735507726,
        "like_count": 535,
        "region_code": "US",
        "view_count": 11427,
        "share_count": 21,
        "username": "vice",
        "video_description": "Why Leafar Seyer appreciates being in a gang. Tap the link in bio to watch the full video 'Prayers And The Cholo Goth Movement,' originally published in 2015."
      },
      {
        "create_time": 1750955414,
        "id": 7520296182682242318,
        "username": "vice",
        "video_description": "The FLDS broke away from mainstream Mormonism in order to continue the practice of polygamy. They established the community of Short Creek along the Utah/Arizona border to follow their beliefs in isolation. In 2011, their prophet Warren Jeffs was sentenced to life in prison (plus 20 years) for sexual abuse of two of his child brides, ages 12 and 15. In 2016, VICE travelled to Short Creek to meet with some of the young women who escaped from the cult, but returned to Short Creek to try and rebuild a new life there. Tap the link in bio to watch.",
        "view_count": 38372,
        "comment_count": 16,
        "like_count": 1308,
        "region_code": "US",
        "share_count": 9
      },
      {
        "region_code": "US",
        "username": "vice",
        "comment_count": 3,
        "create_time": 1750897448,
        "id": 7520047145722858766,
        "view_count": 4117,
        "like_count": 100,
        "share_count": 0,
        "video_description": "Why Metro Boomin wants to be a ‘culture icon’ Tap the link in bio to watch more."
      },
      {
        "create_time": 1751064672,
        "share_count": 8,
        "like_count": 255,
        "region_code": "US",
        "username": "vice",
        "video_description": "When ‘Teenage Dirtbag’ became a massive hit everywhere except America. Tap the link in bio to watch the full story behind the song.",
        "view_count": 5593,
        "comment_count": 2,
        "id": 7520765295875722551
      },
      {
        "like_count": 9028,
        "region_code": "US",
        "username": "vice",
        "video_description": "How to treat flight attendants, according to flight attendants. Tap the link in bio to watch.",
        "comment_count": 45,
        "create_time": 1751121915,
        "id": 7521011100498906381,
        "share_count": 189,
        "view_count": 131366
      },
      {
        "comment_count": 10,
        "create_time": 1751212031,
        "region_code": "US",
        "username": "vice",
        "video_description": "Next time you’re having a sh*t day at work, spare a thought for poo divers. The job is hard, they’re submerged in thick sludge, working in the pitch dark, with nothing to guide them other than their instincts. But what sounds like hell to us, they find strangely peaceful. And the smell? To them, it just “smells like money.” Tap the link in bio to watch.",
        "view_count": 7625,
        "id": 7521398226407230734,
        "like_count": 337,
        "share_count": 21
      },
      {
        "comment_count": 7,
        "id": 7521162454483619085,
        "video_description": "The true story that inspired the lyrics to ‘Thong Song.' Tap the link in bio to watch the full story behind the iconic song.",
        "view_count": 4171,
        "create_time": 1751157128,
        "like_count": 171,
        "region_code": "US",
        "share_count": 12,
        "username": "vice"
      }
    ]
  }
}