[
  {
    "channel_title":"Breitbart News",
    "video_id":"c4MInMZs5s8",
    "title":"WHOAH! Slow-Mo of Bridge Collapse as Man Drives Past It",
    "description":"A bridge near Tulia, Texas, is shown collapsing in slow-motion as a man drove by it in his truck after it was struck earlier by a crane being carried on a tractor trailer. #shorts",
    "publishedAt":"2025-05-31T18:00:39Z",
    "duration_iso":"PT9S",
    "duration_seconds":9,
    "duration_hms":"0:00:09",
    "url":"https:\/\/www.youtube.com\/watch?v=c4MInMZs5s8"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"R_n3HQvx1og",
    "title":"Hawaii Timelapse! Lava Fountain Erupts Over 1,000 Feet in the Air",
    "description":"The U.S. Geological Survey uploaded a timelapse of three different videos showing the Kīlauea volcano eruption in Hawaii. Highlights include a lava fountain spewing over 1,000 feet in the air, and a plume of smoke and ash reaching 5,000 feet. #shorts",
    "publishedAt":"2025-05-31T14:00:41Z",
    "duration_iso":"PT2M42S",
    "duration_seconds":162,
    "duration_hms":"0:02:42",
    "url":"https:\/\/www.youtube.com\/watch?v=R_n3HQvx1og"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"AEGasWGGsQI",
    "title":"AWR's 60 Second Introduction to Mossberg 990 AfterShock",
    "description":"Breitbart News’s AWR Hawkins puts the Mossberg 990 AfterShock to the test at an indoor range.",
    "publishedAt":"2025-05-30T21:50:01Z",
    "duration_iso":"PT1M3S",
    "duration_seconds":63,
    "duration_hms":"0:01:03",
    "url":"https:\/\/www.youtube.com\/watch?v=AEGasWGGsQI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"UkLbBzz3PYc",
    "title":"He's Back! Creepy Joe Biden Mumbles, Menaces Reporters",
    "description":"What's wrong with him!? During a press conference, Joe Biden invaded the personal space of two female reporters, one of whom appeared visibly uncomfortable. When another member of the press tried to hype the former president up saying, \"You're speaking powerfully, you look good,\" Biden seemed to inexplicably mumble, \"Lots of luck in your senior year.\"",
    "publishedAt":"2025-05-30T21:00:27Z",
    "duration_iso":"PT54S",
    "duration_seconds":54,
    "duration_hms":"0:00:54",
    "url":"https:\/\/www.youtube.com\/watch?v=UkLbBzz3PYc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"1-NVI3KEqSw",
    "title":"Trump's Press Sec. Hits Back at Leftist Media for Smearing Trump Over Gaza",
    "description":"President Trump's Press Secretary hit back at the corporate media on Thursday when they criticized Trump over his Gaza policy by pointing out that Biden's administration wasted American taxpayer money on a ridiculous floating pier that failed to provide meaningful help. #shorts",
    "publishedAt":"2025-05-30T20:00:01Z",
    "duration_iso":"PT52S",
    "duration_seconds":52,
    "duration_hms":"0:00:52",
    "url":"https:\/\/www.youtube.com\/watch?v=1-NVI3KEqSw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"zuBAhEOCnrc",
    "title":"Trump's Tariff Power vs. Leftist Judicial Tyranny",
    "description":"Press Secretary Karoline Leavitt detailed a list of radical Leftist judicial injunctions against President Trump's America First agenda, including injunctions against Trump's tariff policies designed to rejuvenate the American economy and restore power and autonomy to America's workers. #shorts",
    "publishedAt":"2025-05-30T17:30:26Z",
    "duration_iso":"PT1M18S",
    "duration_seconds":78,
    "duration_hms":"0:01:18",
    "url":"https:\/\/www.youtube.com\/watch?v=zuBAhEOCnrc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"iw05ZA5D_NQ",
    "title":"Police: Man Captured on Video Kidnapping His Ex-Girlfriend, Forcing Her Into Trunk",
    "description":"According to police, a suspect allegedly used a tracking device placed inside of his ex-girlfriend's car in order to track and kidnap her by forcing her into a vehicle. Eventually the suspect was arrest and the victim, who sustained minor injuries, was rescued.",
    "publishedAt":"2025-05-30T16:30:17Z",
    "duration_iso":"PT26S",
    "duration_seconds":26,
    "duration_hms":"0:00:26",
    "url":"https:\/\/www.youtube.com\/watch?v=iw05ZA5D_NQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"msKkahOI0PI",
    "title":"Canadian Traveler Punches Miami TSA Agents, Gets Tackled",
    "description":"A Canadian traveler at the Miami-Dade International Airport, back in December, was seen attacking two TSA agents, throwing punches at them. One agent withstood multiple punches which may have caused minor injuries, but the man didn't budge. Eventually the suspect was arrested and detained.",
    "publishedAt":"2025-05-30T15:45:09Z",
    "duration_iso":"PT1M35S",
    "duration_seconds":95,
    "duration_hms":"0:01:35",
    "url":"https:\/\/www.youtube.com\/watch?v=msKkahOI0PI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"OhhFaV-Wy8w",
    "title":"Way Too Close! Camera Captures E-Bike Rider Nearly Getting Hit by SUV",
    "description":"In a surveillance video captured recently in Medway, MA, an e-bike rider, who allegedly was running a red light, rode straight into an intersection and was almost struck by an SUV driving by.",
    "publishedAt":"2025-05-30T14:15:07Z",
    "duration_iso":"PT20S",
    "duration_seconds":20,
    "duration_hms":"0:00:20",
    "url":"https:\/\/www.youtube.com\/watch?v=OhhFaV-Wy8w"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Ij2WnR0KINk",
    "title":"Big Howl! Wolves in Memphis Zoo Cause a Ruckus",
    "description":"Big howl! The lupine denizens of the Memphis Zoo in Tennessee were filmed howling and causing a ruckus. #shorts",
    "publishedAt":"2025-05-29T23:00:30Z",
    "duration_iso":"PT29S",
    "duration_seconds":29,
    "duration_hms":"0:00:29",
    "url":"https:\/\/www.youtube.com\/watch?v=Ij2WnR0KINk"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"PI4LsNsxaZE",
    "title":"Driver Runs Red Light, Smashes Into Vehicle, Flips Over",
    "description":"A driver in Duluth, Georgia, was seen running a red light and ended up smashing into another vehicle. The driver at fault was brought to the hospital and the victims in the smashed vehicle suffered minor injuries.",
    "publishedAt":"2025-05-29T21:30:11Z",
    "duration_iso":"PT27S",
    "duration_seconds":27,
    "duration_hms":"0:00:27",
    "url":"https:\/\/www.youtube.com\/watch?v=PI4LsNsxaZE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Heg1tikZKZY",
    "title":"JD Vance: Stablecoins Are a Force Multiplier of American Economic Might",
    "description":"Vice President JD Vance declared that stablecoins are a force multiplier of economic might in the United States, at the Bitcoin 2025 Conference, on Wednesday.",
    "publishedAt":"2025-05-29T20:00:12Z",
    "duration_iso":"PT49S",
    "duration_seconds":49,
    "duration_hms":"0:00:49",
    "url":"https:\/\/www.youtube.com\/watch?v=Heg1tikZKZY"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Z4qDNUNVlYw",
    "title":"33%\"I Got No License\" Says Suspect After Wild Police Chase",
    "description":"According to the Marion County Sheriff's Office, out of Florida, Officers, on Monday, attempted to pull over a suspect who was going 20 miles per hour over the speed limit when the suspect decided to flee police custody. After a wild chase, the suspect surrendered and told the officers that the only reason why he fled authorities was because he had no driver's license.",
    "publishedAt":"2025-05-29T18:15:03Z",
    "duration_iso":"PT2M26S",
    "duration_seconds":146,
    "duration_hms":"0:02:26",
    "url":"https:\/\/www.youtube.com\/watch?v=Z4qDNUNVlYw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"aMa89fKH880",
    "title":"JD Vance: Crypto Is a Hedge Against \"Elites\" Trying to Control People",
    "description":"Vice President JD Vance told people at the Bitcoin 2025 Conference, on Wednesday, that crypto is a hedge against elites who \"prefer to take over and co-opt cutting edge technologies to assert their control over other people.\"",
    "publishedAt":"2025-05-29T12:45:00Z",
    "duration_iso":"PT42S",
    "duration_seconds":42,
    "duration_hms":"0:00:42",
    "url":"https:\/\/www.youtube.com\/watch?v=aMa89fKH880"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"lZb89uSu-fg",
    "title":"Camera Captures the Moment Lightning Hits Radio Tower in Arkansas",
    "description":"A radio tower close to the Washington County Sheriff's Office in Fayetteville, Arkansas, was struck by a bolt of lightning during a storm on Sunday.",
    "publishedAt":"2025-05-29T11:30:45Z",
    "duration_iso":"PT19S",
    "duration_seconds":19,
    "duration_hms":"0:00:19",
    "url":"https:\/\/www.youtube.com\/watch?v=lZb89uSu-fg"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"3GoesP1ae2w",
    "title":"Gator Chomps Mangos Fallen from Tree Along Florida Canal",
    "description":"Chomp! An alligator was spotted snatching mangos from the bank of a canal and chomping on them as it absconded into the water near the edge of the Everglades in Florida. #shorts",
    "publishedAt":"2025-05-29T00:00:04Z",
    "duration_iso":"PT32S",
    "duration_seconds":32,
    "duration_hms":"0:00:32",
    "url":"https:\/\/www.youtube.com\/watch?v=3GoesP1ae2w"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"wwBp6ewqsIA",
    "title":"\"Give Me Your Hand!\" Officer Rescues Missing Autistic Girl Standing on Slippery Rocks",
    "description":"The Clearwater Police Department recently released footage showing an officer locating and saving an autistic girl that had gone missing, who was found trying to balance herself on slippery rocks at the beach.",
    "publishedAt":"2025-05-28T22:15:03Z",
    "duration_iso":"PT1M25S",
    "duration_seconds":85,
    "duration_hms":"0:01:25",
    "url":"https:\/\/www.youtube.com\/watch?v=wwBp6ewqsIA"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"6tVa_1Tisi8",
    "title":"Germany Is All-In on Green Energy... Unless the War in Ukraine Stops",
    "description":"“I think Germany is angling to be one of the main contractors to rebuild Ukraine.” Germany’s leaders are all-in on the green agenda... unless the war ends and opens up a “gold mine” to Ukraine’s natural resources. #shorts",
    "publishedAt":"2025-05-28T22:00:13Z",
    "duration_iso":"PT1M6S",
    "duration_seconds":66,
    "duration_hms":"0:01:06",
    "url":"https:\/\/www.youtube.com\/watch?v=6tVa_1Tisi8"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"8PpR0u5ijfI",
    "title":"You Are \"Uber\" Arrest! Police Arrest Uber Driver Who Pulled Gun on Her Passengers",
    "description":"You are \"uber\" arrest! Police in Port St. Lucie, Florida, posted footage of their arrest of Uber driver Jennifer Benitez who pulled a gun on her passengers in a viral video earlier in May.",
    "publishedAt":"2025-05-28T20:30:01Z",
    "duration_iso":"PT4M4S",
    "duration_seconds":244,
    "duration_hms":"0:04:04",
    "url":"https:\/\/www.youtube.com\/watch?v=8PpR0u5ijfI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"fhw70X8ZeXc",
    "title":"Trump Says He Told Netanyahu Not to Disrupt Nuke Talks with Iran",
    "description":"President Trump confirmed on Wednesday that he told Prime Minister Benjamin Netanyahu it would be \"inappropriate\" for Israel to take action that could disrupt nuclear talks with Iran.",
    "publishedAt":"2025-05-28T17:06:05Z",
    "duration_iso":"PT1M18S",
    "duration_seconds":78,
    "duration_hms":"0:01:18",
    "url":"https:\/\/www.youtube.com\/watch?v=fhw70X8ZeXc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"3vchNbq956Q",
    "title":"\"You Gotta Get Going, Pal!\" Man Nudges Baby Deer Out of the Road",
    "description":"A man in Warren County, Virginia, had to resort to trying to pick up a baby deer in the road before it finally decided to run away into a nearby ditch.",
    "publishedAt":"2025-05-28T17:00:09Z",
    "duration_iso":"PT1M55S",
    "duration_seconds":115,
    "duration_hms":"0:01:55",
    "url":"https:\/\/www.youtube.com\/watch?v=3vchNbq956Q"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"LsjVLflS5Lg",
    "title":"“This Is Like an Old-Style Secret Police Used to Spy on the German People”",
    "description":"“Democracy is very literally under attack”: Germany’s ruling leftist party is trying to outlaw its opponents. #shorts",
    "publishedAt":"2025-05-28T16:30:17Z",
    "duration_iso":"PT1M21S",
    "duration_seconds":81,
    "duration_hms":"0:01:21",
    "url":"https:\/\/www.youtube.com\/watch?v=LsjVLflS5Lg"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"gVQowFt7z6w",
    "title":"Pigeon on a Plane! Man Tries to Capture 1 of 2 Birds on Flight",
    "description":"Two pigeons wound up on a flight going from Minneapolis to Wisconsin recently, leading to one passenger attempting to capture one of the birds during the flight.",
    "publishedAt":"2025-05-28T12:01:26Z",
    "duration_iso":"PT22S",
    "duration_seconds":22,
    "duration_hms":"0:00:22",
    "url":"https:\/\/www.youtube.com\/watch?v=gVQowFt7z6w"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"IJHmeVhwvgQ",
    "title":"Exclusive Footage: Illegal Alien Rapist Smirks as ICE Agents Arrest Him in Sanctuary State Maryland",
    "description":"An illegal alien, convicted of rape, smirked as Immigration and Customs Enforcement (ICE) agents busted him in the sanctuary state of Maryland which had previously protected him from federal immigration enforcement, exclusive footage shared with Breitbart News shows. #shorts",
    "publishedAt":"2025-05-28T00:00:16Z",
    "duration_iso":"PT1M11S",
    "duration_seconds":71,
    "duration_hms":"0:01:11",
    "url":"https:\/\/www.youtube.com\/watch?v=IJHmeVhwvgQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"YMRCTtKw7-Q",
    "title":"'MERICA! Epic Air Show Over Miami Beach for Memorial Day Weekend",
    "description":"'MERICA!! Miami Beach residents and visitors witnessed a treat over Memorial Day weekend as the Air Force Global Strike Command gave its first demonstration of its tri-bomber\/fighter formation at the Hyundai Air and Sea Show on Saturday.",
    "publishedAt":"2025-05-27T22:00:42Z",
    "duration_iso":"PT2M25S",
    "duration_seconds":145,
    "duration_hms":"0:02:25",
    "url":"https:\/\/www.youtube.com\/watch?v=YMRCTtKw7-Q"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"gD2XhPQsshc",
    "title":"Fire Rages After Fuel Tanker Crashes Into Transit Bus",
    "description":"Footage was captured on Sunday showing a big fire and huge cloud of smoke forming after a fuel tanker collided with a transit bus on I-595, in Davie, FL. Miraculously, the truck's driver was only hospitalized with minor burns, and no one else was injured.",
    "publishedAt":"2025-05-27T21:30:06Z",
    "duration_iso":"PT23S",
    "duration_seconds":23,
    "duration_hms":"0:00:23",
    "url":"https:\/\/www.youtube.com\/watch?v=gD2XhPQsshc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"bTfXgkARZ8o",
    "title":"Paying Respects! President Trump Lays Wreath on Tomb of the Unknown Solder",
    "description":"Remembering the fallen: President Donald Trump paid his respects as Commander-in-Chief by laying a wreath at the Tomb of the Unknown Solder in Arlington Cemetery on Memorial Day. #shorts",
    "publishedAt":"2025-05-27T19:00:40Z",
    "duration_iso":"PT24S",
    "duration_seconds":24,
    "duration_hms":"0:00:24",
    "url":"https:\/\/www.youtube.com\/watch?v=bTfXgkARZ8o"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"2yNcEPPBKVc",
    "title":"Officers Rescue Ducklings from Storm Drain, Reunite Them with Mom",
    "description":"The St. Johns County Sheriff's Office in Florida recently released footage showing officers rescuing ducklings that had fallen down a storm drain and reuniting them with their mother.",
    "publishedAt":"2025-05-27T16:45:00Z",
    "duration_iso":"PT53S",
    "duration_seconds":53,
    "duration_hms":"0:00:53",
    "url":"https:\/\/www.youtube.com\/watch?v=2yNcEPPBKVc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"pYlIKWePTbU",
    "title":"\"Please, God!\" Man Begs as Police Officer Arrests Him for Going 110mph on Interstate",
    "description":"\"You're gonna play ****ing games like that with these people's lives? You go to jail today.\" An officer out of Volusia County, Florida, pulled over a man who was allegedly speeding 110 mph down Interstate 4 and proceeded to arrest the suspect after the man told the officer he was only going 80 mph.",
    "publishedAt":"2025-05-27T13:30:49Z",
    "duration_iso":"PT1M31S",
    "duration_seconds":91,
    "duration_hms":"0:01:31",
    "url":"https:\/\/www.youtube.com\/watch?v=pYlIKWePTbU"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"s8XNBJwbmpA",
    "title":"Police Capture \"Repeat Offender\" Kangaroo on the Loose in Durango, Colorado",
    "description":"The Durano Police Department recently released footage showing an officer capturing a kangaroo on the loose in the region. The kangaroo is apparently a repeat offender and has been captured by officers in the past.",
    "publishedAt":"2025-05-27T11:01:32Z",
    "duration_iso":"PT33S",
    "duration_seconds":33,
    "duration_hms":"0:00:33",
    "url":"https:\/\/www.youtube.com\/watch?v=s8XNBJwbmpA"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"wGP07I4g8J0",
    "title":"President Trump Honors Men Who Gave Their Lives for a Nation that \"Did Not Yet Have a Name\"",
    "description":"During a Memorial Day event held at the Arlington National Cemetery, President Trump honored the men who died to defend the United States of America before it was even a nation officially.",
    "publishedAt":"2025-05-26T21:00:46Z",
    "duration_iso":"PT1M24S",
    "duration_seconds":84,
    "duration_hms":"0:01:24",
    "url":"https:\/\/www.youtube.com\/watch?v=wGP07I4g8J0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"mXjXdm18A4M",
    "title":"Thieves Wanted for Stealing \"Betsy\" the Cow from Australian Business",
    "description":"The Victoria Police out of Australia are seeking the public's assistance to identify suspects who stole \"Betsy,\" a fiberglass cow from a business near the Melbourne area, back in late April.",
    "publishedAt":"2025-05-26T19:45:01Z",
    "duration_iso":"PT47S",
    "duration_seconds":47,
    "duration_hms":"0:00:47",
    "url":"https:\/\/www.youtube.com\/watch?v=mXjXdm18A4M"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"uyw0cIoYWJg",
    "title":"Emmanuel Macron's Wife Appears to Hit Him in the Face, Refuses to Take His Arm",
    "description":"As French President Emmanuel Macron arrived in Vietnam and was about to walk off a plane, his wife Brigitte Macron seemingly shoved Emmanuel in the face and did not take his arm while disembarking with him on Sunday. The French president later claimed that the couple were just \"horsing around.\"",
    "publishedAt":"2025-05-26T16:30:16Z",
    "duration_iso":"PT44S",
    "duration_seconds":44,
    "duration_hms":"0:00:44",
    "url":"https:\/\/www.youtube.com\/watch?v=uyw0cIoYWJg"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"ISffbLisU_Q",
    "title":"Whoa! Truck Suddenly Explodes, Rattles Illinois Neighborhood",
    "description":"A security camera from a house captured shocking footage of a truck suddenly exploding right in the middle of a neighborhood in Addison, IL, miraculously only causing minor injuries to the driver. Investigators believe the explosion was due to a leaking propane tank.",
    "publishedAt":"2025-05-26T15:15:02Z",
    "duration_iso":"PT23S",
    "duration_seconds":23,
    "duration_hms":"0:00:23",
    "url":"https:\/\/www.youtube.com\/watch?v=ISffbLisU_Q"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"vzfgWC2p-zY",
    "title":"\"Don't Lose Your Momentum\" President Trump Tells Tragic Story of Big Real Estate Businessman",
    "description":"President Trump told the United States Military Academy at West Point on Saturday a tragic story about a real estate businessman who suffered greatly because he lost his momentum, stressing to the graduating class just how important momentum is.",
    "publishedAt":"2025-05-26T00:01:04Z",
    "duration_iso":"PT5M2S",
    "duration_seconds":302,
    "duration_hms":"0:05:02",
    "url":"https:\/\/www.youtube.com\/watch?v=vzfgWC2p-zY"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"lmEmlR_0p68",
    "title":"\"Take the Path that You Love\" President Trump's Advice for Work Success",
    "description":"During President Trump's speech to the United States Military Academy’s Class of 2025, at West Point, the 47th President told the class to \"take the path that you love,\" during his speech, on Saturday.",
    "publishedAt":"2025-05-25T19:00:40Z",
    "duration_iso":"PT47S",
    "duration_seconds":47,
    "duration_hms":"0:00:47",
    "url":"https:\/\/www.youtube.com\/watch?v=lmEmlR_0p68"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Dk6-7m0t1f8",
    "title":"ICE Arrests 31 Illegal Immigrants in Single Worksite Operation",
    "description":"ICE agents in Laredo, Texas, conducted a worksite operation which lead to the arrest of 31 illegal immigrants, with charges such as aggravated sexual assault, domestic violence, human smuggling, and strangulation.",
    "publishedAt":"2025-05-25T16:00:16Z",
    "duration_iso":"PT26S",
    "duration_seconds":26,
    "duration_hms":"0:00:26",
    "url":"https:\/\/www.youtube.com\/watch?v=Dk6-7m0t1f8"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"1CbyjmTahQw",
    "title":"President Trump Reveals Why He Calls Leftists \"Liberals\" Rather than \"Progressives\"",
    "description":"As President Trump was giving a speech to the United States Military Academy’s Class of 2025, at West Point, on Saturday, he revealed the reason why he prefers to call people on the left \"liberals\" rather than \"progressives.\"",
    "publishedAt":"2025-05-24T22:00:01Z",
    "duration_iso":"PT19S",
    "duration_seconds":19,
    "duration_hms":"0:00:19",
    "url":"https:\/\/www.youtube.com\/watch?v=1CbyjmTahQw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"cgMv_dvcm_4",
    "title":"American Nuclear Power Unleashed! Trump Signs Executive Orders to Cut Red Tape",
    "description":"Secretary of Interior Doug Burgum stated in a press conference with President Trump on Friday in the Oval Office that America's nuclear power is about to be unleashed, as Trump signed four executive orders aimed at removing red tape and fostering competition in America's nuclear industry. #shorts",
    "publishedAt":"2025-05-24T20:00:21Z",
    "duration_iso":"PT56S",
    "duration_seconds":56,
    "duration_hms":"0:00:56",
    "url":"https:\/\/www.youtube.com\/watch?v=cgMv_dvcm_4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"8TV1q51tn3c",
    "title":"ICE Atlanta Agents Arrest Venezuelan Fugitive Wanted for Murder",
    "description":"ICE agents in Atlanta located and arrested a Venezuelan fugitive who has been wanted for murder, on May 17.",
    "publishedAt":"2025-05-24T17:00:08Z",
    "duration_iso":"PT38S",
    "duration_seconds":38,
    "duration_hms":"0:00:38",
    "url":"https:\/\/www.youtube.com\/watch?v=8TV1q51tn3c"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"36mp4o1i5ZM",
    "title":"Sheriff Confronts Man Who Threatened to Kill Him, Then Throws Him in Jail",
    "description":"The Volusia Sheriff's Office released video showing Sheriff Michael Chitwood confront a man who allegedly threatened to kill him in an email message after he was arrested in Washington and brought to Florida to face charges. After the confrontation, the man was taken into custody.",
    "publishedAt":"2025-05-24T16:00:10Z",
    "duration_iso":"PT59S",
    "duration_seconds":59,
    "duration_hms":"0:00:59",
    "url":"https:\/\/www.youtube.com\/watch?v=36mp4o1i5ZM"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"7-1PTVj_0wc",
    "title":"\"No Sacred Cows!\" Trump Admin Official States They Are Pursuing Children's Health at All Costs",
    "description":"\"There are no sacred cows when it comes to our children's health.\" Trump administration official Vince Haley stated that they were doing everything possible to find the sources of the childhood chronic disease epidemic that has been ravaging America's children during a press conference with the President and other officials. #shorts",
    "publishedAt":"2025-05-24T14:00:09Z",
    "duration_iso":"PT28S",
    "duration_seconds":28,
    "duration_hms":"0:00:28",
    "url":"https:\/\/www.youtube.com\/watch?v=7-1PTVj_0wc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"ra-MWE8uwfw",
    "title":"Childhood Health Crisis: Trump's MAHA Report Reveals Alarming Trends!",
    "description":"President Trump revealed some of the findings from the Presidential Commission to Make America Healthy Again that he ordered four months ago when he took office, stating that childhood chronic illnesses were on the rise, but he was going to take actions to fix it.",
    "publishedAt":"2025-05-23T20:00:40Z",
    "duration_iso":"PT1M6S",
    "duration_seconds":66,
    "duration_hms":"0:01:06",
    "url":"https:\/\/www.youtube.com\/watch?v=ra-MWE8uwfw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"zCzoOJi9bY4",
    "title":"Double Grads?! Dad Rushes Past Security to Receive His Diploma with Infant Son in Arms",
    "description":"Double grads?! Jean Paul Al Arab made waves during the University of Buffalo's graduation ceremony on Sunday. Upon being told last minute that he could not bring his infant son onstage with him to receive his diploma (even though he was told it would be no issue the previous semester), Al Arab rushed past security to cheers from the crowd as they took the stage.",
    "publishedAt":"2025-05-23T16:32:58Z",
    "duration_iso":"PT26S",
    "duration_seconds":26,
    "duration_hms":"0:00:26",
    "url":"https:\/\/www.youtube.com\/watch?v=zCzoOJi9bY4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"b0egBqADsIM",
    "title":"Florida Bird Eludes Police After 30-Minute Chase",
    "description":"The Bay County Sheriff's Office out of Florida released footage showing officers chasing a bird wandering near a highway, and failing to detain it.",
    "publishedAt":"2025-05-23T11:01:07Z",
    "duration_iso":"PT40S",
    "duration_seconds":40,
    "duration_hms":"0:00:40",
    "url":"https:\/\/www.youtube.com\/watch?v=b0egBqADsIM"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"enPsN9_n1Dw",
    "title":"The Trump Difference: Pentagon Sings \"Amazing Grace\" in Prayer & Worship Service",
    "description":"What a difference one election makes! Pete Hegseth's hometown pastor Brooks Potteiger led those assembled at the Pentagon's inaugural prayer and worship service in singing the hymn \"Amazing Grace\" on Wednesday morning.",
    "publishedAt":"2025-05-23T01:00:42Z",
    "duration_iso":"PT1M48S",
    "duration_seconds":108,
    "duration_hms":"0:01:48",
    "url":"https:\/\/www.youtube.com\/watch?v=enPsN9_n1Dw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"GJXKqry2pAA",
    "title":"Smoke Shop Burglary Suspect ESCAPES from Police... but Not for Long",
    "description":"The Atlanta Police Department released footage recently showing a man allegedly stealing from a smoke shop, then fleeing police custody once he was approached by an officer. Days later the suspect was seen at a gas station and was detained, arrested.",
    "publishedAt":"2025-05-22T23:30:11Z",
    "duration_iso":"PT1M58S",
    "duration_seconds":118,
    "duration_hms":"0:01:58",
    "url":"https:\/\/www.youtube.com\/watch?v=GJXKqry2pAA"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"jsQlOU2UNrY",
    "title":"Vile Media! Karoline Smacks Down Reporter for Implying South African White Murders Are a Lie",
    "description":"Vile media lies! Karoline Leavitt smacked down NBC reporter Yamiche Alcindor for claiming that the video evidence President Trump confronted South African President Ramaphosa of the persecution of white Afrikaners that is occurring in the country is \"unsubstantiated.\"",
    "publishedAt":"2025-05-22T21:30:16Z",
    "duration_iso":"PT1M50S",
    "duration_seconds":110,
    "duration_hms":"0:01:50",
    "url":"https:\/\/www.youtube.com\/watch?v=jsQlOU2UNrY"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"r0JLvg8le7M",
    "title":"President Trump: \"It Will be the End\" of South Africa if Persecution of White Farmers isn't Resolved",
    "description":"The 47th President said that \"it will be the end\" of South Africa if the persecution of white farmers is not resolved in the future, during an oval office meeting with the South African President, on Wednesday.",
    "publishedAt":"2025-05-22T20:30:08Z",
    "duration_iso":"PT40S",
    "duration_seconds":40,
    "duration_hms":"0:00:40",
    "url":"https:\/\/www.youtube.com\/watch?v=r0JLvg8le7M"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"g9_I0i-JEE8",
    "title":"Plane Crashes and Burns in San Diego, Hitting Several Homes, Cars",
    "description":"A video captured on Thursday shows the fire from a plane crash within the Murphy Canyon area in San Diego, CA. #shorts",
    "publishedAt":"2025-05-22T19:15:06Z",
    "duration_iso":"PT13S",
    "duration_seconds":13,
    "duration_hms":"0:00:13",
    "url":"https:\/\/www.youtube.com\/watch?v=g9_I0i-JEE8"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"dmH4YgkszJ4",
    "title":"Florida Gators Show Their Excitement to Visit Trump's Oval Office",
    "description":"2025 Men's NCAA's Basketball Champions, the Florida Gators, expressed excitement of the prospect of visiting the Oval Office, when President Trump asked if they wanted to visit it, on Wednesday.",
    "publishedAt":"2025-05-22T18:45:04Z",
    "duration_iso":"PT42S",
    "duration_seconds":42,
    "duration_hms":"0:00:42",
    "url":"https:\/\/www.youtube.com\/watch?v=dmH4YgkszJ4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"cOa3pOO_RSU",
    "title":"Trump to NCAA Basketball Champions: Now I Understand Barron Saying 'I'm Not that Tall'",
    "description":"As the 47th President welcomed the Florida Gators to the White House, for becoming the 2025 Men's NCAA's Basketball Champions, President Trump took the opportunity to bring up a point made by his son, Barron Trump.",
    "publishedAt":"2025-05-22T17:34:51Z",
    "duration_iso":"PT21S",
    "duration_seconds":21,
    "duration_hms":"0:00:21",
    "url":"https:\/\/www.youtube.com\/watch?v=cOa3pOO_RSU"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"QnE9_sX3BD0",
    "title":"Pete Hegseth Leads Pentagon in Prayer to \"King Jesus\"",
    "description":"\"This is precisely where I need to be, and I think exactly where we need to be as a nation.\" In a stark contrast to the Biden administration, Defense Secretary Pete Hegseth led those assembled in the Pentagon in prayer for wisdom and humility to \"our Lord and Savior Jesus Christ\" in an inaugural Pentagon prayer and worship service Wednesday morning.",
    "publishedAt":"2025-05-22T17:31:23Z",
    "duration_iso":"PT2M44S",
    "duration_seconds":164,
    "duration_hms":"0:02:44",
    "url":"https:\/\/www.youtube.com\/watch?v=QnE9_sX3BD0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"pkWpC1_pYT0",
    "title":"Lightning Bolt Strikes Police Vehicle in Oklahoma",
    "description":"The Newcastle Police Department recently released footage showing a lightning bolt striking a police vehicle in Oklahoma, on Monday.",
    "publishedAt":"2025-05-22T12:01:35Z",
    "duration_iso":"PT22S",
    "duration_seconds":22,
    "duration_hms":"0:00:22",
    "url":"https:\/\/www.youtube.com\/watch?v=pkWpC1_pYT0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"dqjNh3crrtw",
    "title":"Democrat Admits Illegal Immigration Is a “Crime,\" Then Accuses Kristi Noem of Deporting Americans",
    "description":"*Yawn!* Leftist freshman Senator Elissa Slotkin admitted that illegally entering the country is in fact a crime but then tried to stoke panic by accusing DHS Secretary Kristi Noem of trying to snatch U.S. citizens off the street and deport them.",
    "publishedAt":"2025-05-22T11:01:11Z",
    "duration_iso":"PT4M6S",
    "duration_seconds":246,
    "duration_hms":"0:04:06",
    "url":"https:\/\/www.youtube.com\/watch?v=dqjNh3crrtw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"C08uIMZN_10",
    "title":"\"Absurd!\" Rubio Smashes Idea That America Must Accept All Immigrants",
    "description":"\"No country in the world has an immigration policy like that.\" Secretary of State Marco Rubio hit back at the \"absurd\" notion that America must accept any and all immigrants that want to come to this country.",
    "publishedAt":"2025-05-22T00:00:10Z",
    "duration_iso":"PT3M11S",
    "duration_seconds":191,
    "duration_hms":"0:03:11",
    "url":"https:\/\/www.youtube.com\/watch?v=C08uIMZN_10"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"NFxRvXJk4bQ",
    "title":"Showdown! Rubio Details Insane List of Government Waste the Trump Admin Has Cut",
    "description":"Showdown! Responding to Leftist Senator Chris Van Hollen's badgering, Secretary of State Marco Rubio detailed an insane list of wasteful overseas spending that the Trump administration has cut. #shorts",
    "publishedAt":"2025-05-21T21:30:04Z",
    "duration_iso":"PT1M24S",
    "duration_seconds":84,
    "duration_hms":"0:01:24",
    "url":"https:\/\/www.youtube.com\/watch?v=NFxRvXJk4bQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"hqUbwlJ4YsA",
    "title":"President Trump Shames South African President to His Face for Persecution of White Farmers",
    "description":"President Trump presented a stack of articles showing violence against white South Africans in front of the South African president at the White House on Wednesday.",
    "publishedAt":"2025-05-21T20:30:06Z",
    "duration_iso":"PT3M30S",
    "duration_seconds":210,
    "duration_hms":"0:03:30",
    "url":"https:\/\/www.youtube.com\/watch?v=hqUbwlJ4YsA"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"HYlgNS-BVio",
    "title":"Trump Slams NBC Reporter Asking About Qatari Jet Again While Discussing South African Persecution",
    "description":"\"You're a disgrace, no more questions from you!\" After President Trump played a video in the White House showing persecution of white South Africans in front of the South African president, a reporter from NBC threw in a question about the jet gifted to the United States by Qatar. President Donald Trump responded by shaming the reporter and telling him that he won't get any more questions.",
    "publishedAt":"2025-05-21T19:00:14Z",
    "duration_iso":"PT1M21S",
    "duration_seconds":81,
    "duration_hms":"0:01:21",
    "url":"https:\/\/www.youtube.com\/watch?v=HYlgNS-BVio"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"EGaat38Tojs",
    "title":"Clown! Rubio Destroys Illegal Alien-Simping Democrat Chris Van Hollen",
    "description":"\"Your regret for voting for me confirms I'm doing a good job.\" Secretary of State Marco Rubio shamed noted Leftist illegal alien and criminal simp Senator Chris Van Hollen (of margarita-gate) after Van Hollen tried to excoriate him by saying he regretted his vote to confirm him.",
    "publishedAt":"2025-05-21T18:00:11Z",
    "duration_iso":"PT4M46S",
    "duration_seconds":286,
    "duration_hms":"0:04:46",
    "url":"https:\/\/www.youtube.com\/watch?v=EGaat38Tojs"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"SqObfmBHNCo",
    "title":"AFPI Vice President Ashley Hayek Discusses Importance of Looking Forward for America First Agenda",
    "description":"The America First Policy Institute (AFPI) is putting together a 100 year plan to continue the America First agenda as it is essential to look forward, AFPI Vice President Ashely Hayek noted during a Tuesday policy event with Breitbart News.",
    "publishedAt":"2025-05-21T17:03:53Z",
    "duration_iso":"PT4M12S",
    "duration_seconds":252,
    "duration_hms":"0:04:12",
    "url":"https:\/\/www.youtube.com\/watch?v=SqObfmBHNCo"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"mqfNOrlVFEE",
    "title":"\"You Alright?\" Car Drives Straight Into a Fallen Tree",
    "description":"A car was seen driving right into a fallen tree in Bennington, VT, on Saturday. The tree allegedly fell down due to a lightning strike. #shorts",
    "publishedAt":"2025-05-21T11:01:33Z",
    "duration_iso":"PT27S",
    "duration_seconds":27,
    "duration_hms":"0:00:27",
    "url":"https:\/\/www.youtube.com\/watch?v=mqfNOrlVFEE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"aYX9Quzvgns",
    "title":"Oh, SNAP! Secretary of Agriculture Brooke Rollins Talks Reining in Food Stamp Abuses",
    "description":"Oh, SNAP! U.S. Secretary of Agriculture Brooke Rollins detailed to Breitbart's Washington Bureau Chief Matthew Boyle about the abuses of the SNAP food stamp program, and plans to rein those in.",
    "publishedAt":"2025-05-21T00:00:01Z",
    "duration_iso":"PT2M32S",
    "duration_seconds":152,
    "duration_hms":"0:02:32",
    "url":"https:\/\/www.youtube.com\/watch?v=aYX9Quzvgns"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"P9PvAm9HWGk",
    "title":"Brooke Rollins: \"New Day\" in America as We Work to Address World Economy, \"Put America First\"",
    "description":"It is a \"new day\" in America as the Trump administration works to address the world economy and \"put America first,\" Agriculture Secretary Brooke Rollins said during a policy event with Breitbart News on Tuesday in Washington, DC.",
    "publishedAt":"2025-05-20T21:00:21Z",
    "duration_iso":"PT1M37S",
    "duration_seconds":97,
    "duration_hms":"0:01:37",
    "url":"https:\/\/www.youtube.com\/watch?v=P9PvAm9HWGk"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"ew7UjG0ljaE",
    "title":"Matt Boyle Talks to Kevin Keane About Trump's Love of Diet Coke and the Fabled Diet Coke Button",
    "description":"Breitbart's Washington Bureau Chief and The American Beverage Association's CEO Kevin Keane talked about President Trump's love of Diet Coke, as well as the fabled Diet Coke button.",
    "publishedAt":"2025-05-20T17:55:43Z",
    "duration_iso":"PT2M53S",
    "duration_seconds":173,
    "duration_hms":"0:02:53",
    "url":"https:\/\/www.youtube.com\/watch?v=ew7UjG0ljaE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"qYr4wbrVOlI",
    "title":"LIVE: Breitbart News Hosts Policy Event with Secretary of Agriculture Brooke Rollins...",
    "description":"",
    "publishedAt":"2025-05-20T17:02:19Z",
    "duration_iso":"PT1H30M11S",
    "duration_seconds":5411,
    "duration_hms":"1:30:11",
    "url":"https:\/\/www.youtube.com\/watch?v=qYr4wbrVOlI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"puJ_bUPuJh4",
    "title":"Black Bear Lives Its Best Life, Rolls Around in Pine Shavings",
    "description":"Having a stressful day? Relax and watch a black bear roll around in pine shavings as you listen to lo-fi. #shorts",
    "publishedAt":"2025-05-20T17:01:07Z",
    "duration_iso":"PT35S",
    "duration_seconds":35,
    "duration_hms":"0:00:35",
    "url":"https:\/\/www.youtube.com\/watch?v=puJ_bUPuJh4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"ND7W4u5eZnE",
    "title":"LIVE: Breitbart News Hosts Policy Event with Secretary of Agriculture Brooke Rollins...",
    "description":"",
    "publishedAt":"2025-05-20T16:47:08Z",
    "duration_iso":"P0D",
    "duration_seconds":0,
    "duration_hms":"0:00:00",
    "url":"https:\/\/www.youtube.com\/watch?v=ND7W4u5eZnE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Zq82_cOym5w",
    "title":"Oklahoma Problems! Police Chase Cow Running Wild on I-40",
    "description":"A cow was seen running wild on Interstate 40 in Oklahoma City, OK, during the morning commute on May 13. Police eventually wrangled the animal and took it away from the busy road.",
    "publishedAt":"2025-05-20T15:15:05Z",
    "duration_iso":"PT1M5S",
    "duration_seconds":65,
    "duration_hms":"0:01:05",
    "url":"https:\/\/www.youtube.com\/watch?v=Zq82_cOym5w"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"S-6R68gogyI",
    "title":"Take It Down! Trump Signs \"Take It Down Act\" Banning Deepfake Revenge P*rn",
    "description":"Take it Down! President Trump signed the Take It Down Act on Monday, which bans deepfake and revenge pornography.",
    "publishedAt":"2025-05-20T11:00:47Z",
    "duration_iso":"PT1M19S",
    "duration_seconds":79,
    "duration_hms":"0:01:19",
    "url":"https:\/\/www.youtube.com\/watch?v=S-6R68gogyI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"hvTPWDZQHhQ",
    "title":"Two Deaths Confirmed After Mexican Naval Training Vessel Crashes into Brooklyn Bridge",
    "description":"Two people were tragically confirmed to have died after an antique Mexican naval training vessel crashed into the Brooklyn Bridge on Sunday.",
    "publishedAt":"2025-05-20T00:00:49Z",
    "duration_iso":"PT1M20S",
    "duration_seconds":80,
    "duration_hms":"0:01:20",
    "url":"https:\/\/www.youtube.com\/watch?v=hvTPWDZQHhQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"C6pMpifawA4",
    "title":"Karoline Leavitt Reveals Trump and Melania Have Invited Pope Leo XIV to White House",
    "description":"White House Press Secretary Karoline Leavitt revealed that Vice President JD Vance delivered a formal invitation from President Donald Trump and First Lady Melania Trump to Pope Leo XIV for him to come visit the White House.",
    "publishedAt":"2025-05-19T22:45:00Z",
    "duration_iso":"PT32S",
    "duration_seconds":32,
    "duration_hms":"0:00:32",
    "url":"https:\/\/www.youtube.com\/watch?v=C6pMpifawA4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"43PjTQHp3-A",
    "title":"Slap Down! Karoline Leavitt Slaps Down Media for False Reporting on New Air Force One",
    "description":"Slap down! In a press conference on Monday, Press Secretary Karoline Leavitt slapped down the corporate Leftist media for incorrect and false reporting about the donation of a Boeing 747 by Qatar for use as the country's new Air Force One. #shorts",
    "publishedAt":"2025-05-19T20:30:01Z",
    "duration_iso":"PT1M15S",
    "duration_seconds":75,
    "duration_hms":"0:01:15",
    "url":"https:\/\/www.youtube.com\/watch?v=43PjTQHp3-A"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"lls36yUHS7Y",
    "title":"ICE Tampa Walks onto Construction Site, Arrests Illegals",
    "description":"ICE recently released footage of Tampa agents walking onto a construction site and arresting illegal immigrants, exercising worksite enforcement operations.",
    "publishedAt":"2025-05-19T18:31:03Z",
    "duration_iso":"PT1M54S",
    "duration_seconds":114,
    "duration_hms":"0:01:54",
    "url":"https:\/\/www.youtube.com\/watch?v=lls36yUHS7Y"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"btX0KiaYAg8",
    "title":"JD Vance: Need to Be Honest About Whether Joe Biden \"Was Capable of Doing the Job\"",
    "description":"\"I don't think that he was in good enough health\" to perform the duties of the president, Vice President JD Vance told reporters when asked about Joe Biden's cancer diagnosis reveal.",
    "publishedAt":"2025-05-19T18:26:00Z",
    "duration_iso":"PT1M15S",
    "duration_seconds":75,
    "duration_hms":"0:01:15",
    "url":"https:\/\/www.youtube.com\/watch?v=btX0KiaYAg8"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"QbyE9dpswc0",
    "title":"Officer Saves Gentle Dog Standing in Front of Traffic on I-77",
    "description":"A dog was spotted on Interstate 77 in Canton, OH, on May 8, standing right in front of traffic. An officer was able to call the dog over successfully and returned the dog back to its owner safely.",
    "publishedAt":"2025-05-19T17:15:01Z",
    "duration_iso":"PT41S",
    "duration_seconds":41,
    "duration_hms":"0:00:41",
    "url":"https:\/\/www.youtube.com\/watch?v=QbyE9dpswc0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"rssAt99j9V0",
    "title":"Police Rescue Children from Alleged Kidnappers Using PIT Maneuver",
    "description":"State patrol officers recently released footage captured in George, Washington, of police performing a PIT maneuver to rescue children who were allegedly kidnapped.",
    "publishedAt":"2025-05-18T17:30:08Z",
    "duration_iso":"PT2M56S",
    "duration_seconds":176,
    "duration_hms":"0:02:56",
    "url":"https:\/\/www.youtube.com\/watch?v=rssAt99j9V0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"yKTTssi3KDc",
    "title":"Fat Florida Gator Found Strolling onto Front Porch, Gets Wrangled by Police",
    "description":"The Lee County Sheriff's Office recently released footage from Fort Myers, Florida, showing an alligator wandering onto a porch and getting wrangled by police officers. The gator was eventually detained by a state alligator trapper.",
    "publishedAt":"2025-05-17T23:15:10Z",
    "duration_iso":"PT1M47S",
    "duration_seconds":107,
    "duration_hms":"0:01:47",
    "url":"https:\/\/www.youtube.com\/watch?v=yKTTssi3KDc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Qv4249FDhhs",
    "title":"Young Woman Drives Jeep Over Pier, Conveniently Lands on Dock",
    "description":"A teenage woman was seen driving a jeep through a barrier, causing the vehicle to fall and crash land on a dock, on May 10.",
    "publishedAt":"2025-05-17T20:00:30Z",
    "duration_iso":"PT22S",
    "duration_seconds":22,
    "duration_hms":"0:00:22",
    "url":"https:\/\/www.youtube.com\/watch?v=Qv4249FDhhs"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"fipax8pwRQM",
    "title":"Frogger 2?! Woman Terrified by Tiny Frog Hopping on Her as She Drives",
    "description":"Only in Florida! Footage was recently captured in Orlando of a tiny frog jumping across the inside of a vehicle and hopping onto a woman as she was driving. #shorts",
    "publishedAt":"2025-05-17T17:45:01Z",
    "duration_iso":"PT39S",
    "duration_seconds":39,
    "duration_hms":"0:00:39",
    "url":"https:\/\/www.youtube.com\/watch?v=fipax8pwRQM"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Z0IAU5kiM7w",
    "title":"Treason?! Rand Paul Grills State Dept. Nominee on Predecessor's Anti-Trump Activities",
    "description":"Senator Rand Paul questioned Donald Trump's nominee for Assistant Secretary of State for Near Eastern Affairs Joel Rayburn over the policies and attitudes of his former colleague and predecessor as Envoy to Syria, James Jeffrey, which he characterized as \"tantamount to treason,\" which included obfuscating troop numbers in the Middle East and playing a \"shell game\" to hide information from President Trump.",
    "publishedAt":"2025-05-15T22:00:38Z",
    "duration_iso":"PT4M5S",
    "duration_seconds":245,
    "duration_hms":"0:04:05",
    "url":"https:\/\/www.youtube.com\/watch?v=Z0IAU5kiM7w"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"-GBuD6xygng",
    "title":"Ben & Jerry's Founder Among Protesters Disrupting RFK Jr. Hearing",
    "description":"Ben Cohen, a co‑founder of Ben & Jerry’s ice cream, was among other leftist protesters disrupting RFK Jr. as he was speaking during a Senate committee hearing, on Wednesday.",
    "publishedAt":"2025-05-15T19:15:00Z",
    "duration_iso":"PT1M6S",
    "duration_seconds":66,
    "duration_hms":"0:01:06",
    "url":"https:\/\/www.youtube.com\/watch?v=-GBuD6xygng"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"dIzq-e-COps",
    "title":"RFK Jr. Calls Out Dem on Eliminating Food Dyes: You Tried for 20 Years, I Did It in 100 Days",
    "description":"RFK Jr. called out Democrat Rep. Rosa DeLauro during a House Appropriations Committee hearing on Wednesday, saying she's tried to eliminate food dyes for over 20 years, but he was able to do it in 100 days: \"Give me credit!\"",
    "publishedAt":"2025-05-15T17:00:48Z",
    "duration_iso":"PT54S",
    "duration_seconds":54,
    "duration_hms":"0:00:54",
    "url":"https:\/\/www.youtube.com\/watch?v=dIzq-e-COps"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"fLt1OAsqEMQ",
    "title":"Alligator Seen Strutting Across I-85 Down in Alabama",
    "description":"An alligator down in Pike Road, Alabama, was seen taking his time crossing I-85 in broad daylight, on Mother's Day.",
    "publishedAt":"2025-05-15T11:15:07Z",
    "duration_iso":"PT38S",
    "duration_seconds":38,
    "duration_hms":"0:00:38",
    "url":"https:\/\/www.youtube.com\/watch?v=fLt1OAsqEMQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"HbIY7-Taxds",
    "title":"Democrat Daughter of Illegal Immigrants Freaks Out on Kristi Noem with Litany of Lies",
    "description":"Rep. Delia Ramirez (D-IL), the daughter of illegal aliens, used her time during a Homeland Security Committee meeting to berate DHS Secretary Kristi Noem, demanding her resignation, on Wednesday.",
    "publishedAt":"2025-05-14T20:30:02Z",
    "duration_iso":"PT1M52S",
    "duration_seconds":112,
    "duration_hms":"0:01:52",
    "url":"https:\/\/www.youtube.com\/watch?v=HbIY7-Taxds"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"-D3dek_1aGQ",
    "title":"President Trump: The Stock Market Is Going to Get \"a Lot Higher\"",
    "description":"President Donald Trump, while speaking at a U.S.-Saudi investment forum, predicted that the stock market is going to get \"a lot higher.\"",
    "publishedAt":"2025-05-14T11:30:01Z",
    "duration_iso":"PT30S",
    "duration_seconds":30,
    "duration_hms":"0:00:30",
    "url":"https:\/\/www.youtube.com\/watch?v=-D3dek_1aGQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Hbf6baLMnqw",
    "title":"Exclusive — White House’s Witkoff Expects Abraham Accords Expansion within ‘Months’",
    "description":"White House senior adviser Steve Witkoff told Breitbart News exclusively that he expects to see an expansion of the Abraham Accords to include several more countries perhaps in just the next couple months. He also explained how this fits into President Donald Trump’s larger peace and economic agendas.",
    "publishedAt":"2025-05-14T11:00:26Z",
    "duration_iso":"PT35M32S",
    "duration_seconds":2132,
    "duration_hms":"0:35:32",
    "url":"https:\/\/www.youtube.com\/watch?v=Hbf6baLMnqw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"QdtfmRKxFoI",
    "title":"Trump: Far Too Many U.S. Presidents Used Foreign Policy to \"Dispense Justice\"",
    "description":"President Trump, while speaking at a U.S.-Saudi investment forum, told people in the room that too many previous U.S. presidents used American foreign policy to \"dispense justice\" to other nations, and that he believes it's \"God's job\" to sit in judgement while it is his job to \"defend America.\"",
    "publishedAt":"2025-05-13T23:30:10Z",
    "duration_iso":"PT1M18S",
    "duration_seconds":78,
    "duration_hms":"0:01:18",
    "url":"https:\/\/www.youtube.com\/watch?v=QdtfmRKxFoI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"sEZjT9XjoW0",
    "title":"Crab Leg Heist! Two Suspects Attempt to Flee Police After Stealing Seafood",
    "description":"The Bloomington Minnesota Police Department released footage showing officers arresting suspects who tried to get away from the police after allegedly stealing crab legs. Illegal drugs were also found in the vehicle.",
    "publishedAt":"2025-05-13T22:01:04Z",
    "duration_iso":"PT1M1S",
    "duration_seconds":61,
    "duration_hms":"0:01:01",
    "url":"https:\/\/www.youtube.com\/watch?v=sEZjT9XjoW0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"jC0akn65e0s",
    "title":"Exclusive: Witkoff Details Path to Peace in Ukraine",
    "description":"White House senior adviser Steve Witkoff detailed President Donald Trump’s efforts to negotiate peace between Russia and Ukraine while also getting Vladimir Putin and Volodymyr Zelensky in a room together in an exclusive interview with Breitbart News last week.",
    "publishedAt":"2025-05-13T15:30:21Z",
    "duration_iso":"PT7M31S",
    "duration_seconds":451,
    "duration_hms":"0:07:31",
    "url":"https:\/\/www.youtube.com\/watch?v=jC0akn65e0s"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"rvM8BY4FrsE",
    "title":"\"You Should Be Embarrassed... ABC Is a Disaster\" Trump Blasts Reporter Over Qatari Jet Question",
    "description":"President Trump blasted an ABC reporter for implying that he is accepting a jet donated to the United States by Qatar for use as Air Force One as a personal gift. #shorts",
    "publishedAt":"2025-05-13T11:01:33Z",
    "duration_iso":"PT1M19S",
    "duration_seconds":79,
    "duration_hms":"0:01:19",
    "url":"https:\/\/www.youtube.com\/watch?v=rvM8BY4FrsE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"1Cfd9CsZtRA",
    "title":"\"You People Don't Want to Write About It\" Trump Blasts Media Silence on South African “Genocide”",
    "description":"Donald Trump blasted the media for their silence on he called \"genocide\" that is being conducted against farmers in South Africa. Trump has extended offers of asylum to those fleeing to the U.S. to escape the persecution. #shorts",
    "publishedAt":"2025-05-12T23:00:00Z",
    "duration_iso":"PT1M20S",
    "duration_seconds":80,
    "duration_hms":"0:01:20",
    "url":"https:\/\/www.youtube.com\/watch?v=1Cfd9CsZtRA"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"kJenzJM7A00",
    "title":"\"Not Anymore They Don't!\" Trump Signs EO Freeing Americans from Skyrocketing Pharma Prices",
    "description":"Speaking Monday morning, Donald Trump signed an executive order keeping pharmaceutical companies from charging Americans more for medical drugs and treatments under the guise of research and development costs in America. #shorts",
    "publishedAt":"2025-05-12T20:15:03Z",
    "duration_iso":"PT1M29S",
    "duration_seconds":89,
    "duration_hms":"0:01:29",
    "url":"https:\/\/www.youtube.com\/watch?v=kJenzJM7A00"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"QGdAdbdva2s",
    "title":"Exclusive — Witkoff: Israel and USA as Close as Ever",
    "description":"Steve Witkoff, a senior adviser to President Trump, told Breitbart News exclusively that any reports that relations have soured between Trump and Israeli Prime Minister Benjamin Netanyahu are fake news. The two countries he said remain as close as ever.",
    "publishedAt":"2025-05-12T19:00:22Z",
    "duration_iso":"PT5M12S",
    "duration_seconds":312,
    "duration_hms":"0:05:12",
    "url":"https:\/\/www.youtube.com\/watch?v=QGdAdbdva2s"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"fP-lDdKL0NY",
    "title":"“You’re Looking at Him” Kash Patel Says He Was Victim of Biden’s Weaponized FBI, Now Cleaning It Up",
    "description":"While tangling with Leftist Senator Patty Murray, FBI Director Kash Patel hit back at her line of questioning, stating that he was one of the victims of Biden’s corrupt FBI, and that he was now cleaning up that mess.",
    "publishedAt":"2025-05-11T18:00:28Z",
    "duration_iso":"PT1M27S",
    "duration_seconds":87,
    "duration_hms":"0:01:27",
    "url":"https:\/\/www.youtube.com\/watch?v=fP-lDdKL0NY"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"pM58l6Cn3qg",
    "title":"Democrat Van Hollen Shakes and Shouts as Kristi Noem Schools Him on Deported “Maryland Man”",
    "description":"Leftist Senator Chris Van Hollen of “Margaritagate” fame looked visibly shaken and upset as Trump’s DHS Secretary Kristi Noem schooled him over deported “Maryland Man” and illegal alien Abrego Garcia.",
    "publishedAt":"2025-05-09T22:00:51Z",
    "duration_iso":"PT1M36S",
    "duration_seconds":96,
    "duration_hms":"0:01:36",
    "url":"https:\/\/www.youtube.com\/watch?v=pM58l6Cn3qg"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"v3qdirnYs8c",
    "title":"Exclusive -- Steve Witkoff: Iran Has Agreed It Does Not Want Nuclear Weapon",
    "description":"President Donald Trump's top negotiator Steve Witkoff told Breitbart News that the Iranians have told him that they do not want a nuclear weapon, and Witkoff details several key planks of the negotiations ahead of a fourth meeting with Iranian leadership in Oman coming up soon.",
    "publishedAt":"2025-05-09T21:15:04Z",
    "duration_iso":"PT6M58S",
    "duration_seconds":418,
    "duration_hms":"0:06:58",
    "url":"https:\/\/www.youtube.com\/watch?v=v3qdirnYs8c"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"OMvPn5v33co",
    "title":"Instant Regret! Democrat Patty Murray Immediately Regrets Asking Kristi Noem About DHS Funds",
    "description":"Instant regret! Democrat Leftist Senator Patty Murray had a look of instant regret on her face after she asked Kristi Noem about DHS funds and the Secretary laid out who they were misused under the Biden administration. #shorts",
    "publishedAt":"2025-05-09T20:00:28Z",
    "duration_iso":"PT1M16S",
    "duration_seconds":76,
    "duration_hms":"0:01:16",
    "url":"https:\/\/www.youtube.com\/watch?v=OMvPn5v33co"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"MlLuhHLhI2c",
    "title":"Exclusive — Steve Witkoff Shreds Critics",
    "description":"President Donald Trump’s senior adviser Steve Witkoff shredded critics in a lengthy on-camera exclusive interview with Breitbart News at the White House on Tuesday",
    "publishedAt":"2025-05-09T17:30:10Z",
    "duration_iso":"PT11M19S",
    "duration_seconds":679,
    "duration_hms":"0:11:19",
    "url":"https:\/\/www.youtube.com\/watch?v=MlLuhHLhI2c"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"PGoj_TM48s8",
    "title":"Trump: \"Gavin Newscum's\" Mishandling of Train, Fires “Put Him Out of the Race” for President",
    "description":"In a meeting with the new Canadian Prime Minister on Tuesday, President Trump blasted California Governor Gavin \"Newscum,\" stating that his mishandling of things like the L.A. fires and the costly unfinished high-speed rail project have made him \"disqualified\" to be president.",
    "publishedAt":"2025-05-06T22:00:35Z",
    "duration_iso":"PT2M26S",
    "duration_seconds":146,
    "duration_hms":"0:02:26",
    "url":"https:\/\/www.youtube.com\/watch?v=PGoj_TM48s8"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"0NjbwVI7RuQ",
    "title":"Bear Hitting the Town! Police Swarm Downtown St. Augustine Looking for Rogue Black Bear",
    "description":"Bear in the city! Residents and tourists of downtown St. Augustine were awoken to police swarming the area looking for a fugitive... a wild black bear that was spotted roaming through backyards and tourist areas. #shorts",
    "publishedAt":"2025-05-06T17:00:01Z",
    "duration_iso":"PT17S",
    "duration_seconds":17,
    "duration_hms":"0:00:17",
    "url":"https:\/\/www.youtube.com\/watch?v=0NjbwVI7RuQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"RZmYfMe2nGw",
    "title":"Dog on the Rocks? Tacoma Police Rescue Lost Pooch Stranded by Seaside",
    "description":"Dog on the rocks? The Tacoma Police Department rescued a lost dog who was stranded on the rocks at a seaside shore. The Bernese Mountain Dog was taken to the Humane Society, where it was later found by its owners. #shorts",
    "publishedAt":"2025-05-06T15:00:47Z",
    "duration_iso":"PT1M8S",
    "duration_seconds":68,
    "duration_hms":"0:01:08",
    "url":"https:\/\/www.youtube.com\/watch?v=RZmYfMe2nGw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"EV3YrrgRUkI",
    "title":"Quick-Thinking Heroes Save Missing Autistic Boy From Busy Freeway",
    "description":"An off-duty sheriff's dispatcher, an eye in the sky, and quick-acting sheriff's deputies worked together to rescue an 11-year-old autistic boy who wandered onto a busy freeway in Santee, reuniting him safely with his family.",
    "publishedAt":"2025-05-06T12:30:19Z",
    "duration_iso":"PT1M10S",
    "duration_seconds":70,
    "duration_hms":"0:01:10",
    "url":"https:\/\/www.youtube.com\/watch?v=EV3YrrgRUkI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"0En6k8aU4XQ",
    "title":"\"Nobody's Ever Escaped from Alcatraz\" President Trump Talks About Re-Opening Maximum Security Prison",
    "description":"President Trump spoke favorably of his recent decision to re-open Alcatraz, a legendary maximum security prison that no one has ever escaped from.",
    "publishedAt":"2025-05-06T11:30:00Z",
    "duration_iso":"PT1M49S",
    "duration_seconds":109,
    "duration_hms":"0:01:49",
    "url":"https:\/\/www.youtube.com\/watch?v=0En6k8aU4XQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"knWyLXsv2aI",
    "title":"Trump Calls Out Journalists to Their Faces: \"It's a Shame How Dishonest the Media Is\"",
    "description":"President Trump disrespected the \"dishonest\" Media onboard Air Force One on Sunday, blasting them to their faces about the corruption of the legacy news in America. #shorts",
    "publishedAt":"2025-05-06T02:00:46Z",
    "duration_iso":"PT34S",
    "duration_seconds":34,
    "duration_hms":"0:00:34",
    "url":"https:\/\/www.youtube.com\/watch?v=knWyLXsv2aI"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"nUEujE6dblk",
    "title":"Man Who Ran Over 2 Teenagers and Teacher Outside of Church Nabbed Hiding on Boat",
    "description":"Boat busted: a man who allegedly intentionally ran over a ten-year-old, 12-year-old, and a teacher outside of a Presbyterian church near Charleston, South Carolina, was apprehended trying to hide in a boat. The teacher was hospitalized with serious injuries, while both teenagers have recovered.",
    "publishedAt":"2025-05-06T01:01:00Z",
    "duration_iso":"PT2M25S",
    "duration_seconds":145,
    "duration_hms":"0:02:25",
    "url":"https:\/\/www.youtube.com\/watch?v=nUEujE6dblk"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"4DtlqMpbre0",
    "title":"Woman Assaults Ride Share Driver, Takes His Keys, Flees the Scene",
    "description":"The Houston Police Department is looking for the public's help to identify a suspect who allegedly assaulted a ride share driver, stole his keys, and then fled the scene after the driver ended the customer's ride because the rider opened the door while the car was still in motion.",
    "publishedAt":"2025-05-05T23:45:00Z",
    "duration_iso":"PT33S",
    "duration_seconds":33,
    "duration_hms":"0:00:33",
    "url":"https:\/\/www.youtube.com\/watch?v=4DtlqMpbre0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"guJ0WPK3fvw",
    "title":"\"Who Are You With?\" Trump Spars with Reporter on Air Force One over Mike Waltz",
    "description":"President Trump tussled with a reporter onboard Air Force One Sunday after she asked a number of questions about Mike Waltz's reassignment as U.S. Ambassador to the United Nations. \"You are so bad, that's why nobody watches you anymore,\" the president noted. #shorts",
    "publishedAt":"2025-05-05T23:00:46Z",
    "duration_iso":"PT47S",
    "duration_seconds":47,
    "duration_hms":"0:00:47",
    "url":"https:\/\/www.youtube.com\/watch?v=guJ0WPK3fvw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"eb72c_WE-iU",
    "title":"Miller: Media Ignoring FBI Report of Terrorist Gang Assassination Plots on U.S. Soil",
    "description":"Addressing reporters, Stephen Miller questioned why an FBI assessment about Maduro-linked terrorist plots on U.S. soil went largely uncovered, calling the revelations “earth-shattering” and urging reflection on media priorities.",
    "publishedAt":"2025-05-05T21:48:51Z",
    "duration_iso":"PT1M7S",
    "duration_seconds":67,
    "duration_hms":"0:01:07",
    "url":"https:\/\/www.youtube.com\/watch?v=eb72c_WE-iU"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"gmQ9AWhrIV0",
    "title":"AWR Hawkins Explains Right to Life: Left Hates That We're Cutting Out Government",
    "description":"Speaking at the Young America's Foundation, Breitbart News's AWR Hawkins emphasized the God-given nature of all Americans' right to life.",
    "publishedAt":"2025-05-05T21:30:05Z",
    "duration_iso":"PT3M12S",
    "duration_seconds":192,
    "duration_hms":"0:03:12",
    "url":"https:\/\/www.youtube.com\/watch?v=gmQ9AWhrIV0"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Aw_PhalA_zE",
    "title":"“My Wife Thought It Was Cute\" Trump Responds to \"Fake News\" Outrage over A.I. Pic as Pope",
    "description":"President Trump responded to a reporter who claimed Catholics were \"not so happy\" about an AI-generated image of Trump as the Pope that the White House posted on social media, saying it wasn't Catholics who were outraged but rather \"fake news media.\"",
    "publishedAt":"2025-05-05T20:30:02Z",
    "duration_iso":"PT1M17S",
    "duration_seconds":77,
    "duration_hms":"0:01:17",
    "url":"https:\/\/www.youtube.com\/watch?v=Aw_PhalA_zE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"qYe-xl6iU_M",
    "title":"Homemade Airplane Crashes into House, Killing Two on Board",
    "description":"A home-built kit airplane crashed into a house in Simi Valley, CA, on May 3, killing two of the passengers on board.",
    "publishedAt":"2025-05-05T19:15:02Z",
    "duration_iso":"PT46S",
    "duration_seconds":46,
    "duration_hms":"0:00:46",
    "url":"https:\/\/www.youtube.com\/watch?v=qYe-xl6iU_M"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"sZ4V7HdVqws",
    "title":"\"Get the Weed!\" Robbers Hold Up Smoke Shop at Gunpoint",
    "description":"The Hillsborough County Sheriff's Office is seeking the public's help to identify suspects who stole items from a smoke shop in Seffner, FL, on April 15.",
    "publishedAt":"2025-05-05T16:15:05Z",
    "duration_iso":"PT29S",
    "duration_seconds":29,
    "duration_hms":"0:00:29",
    "url":"https:\/\/www.youtube.com\/watch?v=sZ4V7HdVqws"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"qF3dUDEIWfw",
    "title":"Bad Dawg! Police Horses in London Bit by Out of Control Dog",
    "description":"Bad dawg! Two police horses in London, Yvonne and Snaffles, were bit by an out of control canine. Both horses recovered nicely in their stables.",
    "publishedAt":"2025-05-04T21:00:45Z",
    "duration_iso":"PT48S",
    "duration_seconds":48,
    "duration_hms":"0:00:48",
    "url":"https:\/\/www.youtube.com\/watch?v=qF3dUDEIWfw"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"awJGUTxT0F4",
    "title":"Keep It Up! Karoline Leavitt Trolls Kamala to Keep Speaking in Public",
    "description":"Karoline Leavitt, on behalf of the President Donald Trump White House, announced that they support more speaking engagements for former Vice President Kamala Harris, on Thursday.",
    "publishedAt":"2025-05-04T18:30:03Z",
    "duration_iso":"PT16S",
    "duration_seconds":16,
    "duration_hms":"0:00:16",
    "url":"https:\/\/www.youtube.com\/watch?v=awJGUTxT0F4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"hUWTL1WRq7c",
    "title":"Stephen Miller Explains Why Kamala Harris Should Apologize to Americans",
    "description":"Stephen Miller told the press why he felt Kamala Harris owes Americans an apology, from the White House Press Briefing Room, on Thursday.",
    "publishedAt":"2025-05-03T23:00:41Z",
    "duration_iso":"PT1M36S",
    "duration_seconds":96,
    "duration_hms":"0:01:36",
    "url":"https:\/\/www.youtube.com\/watch?v=hUWTL1WRq7c"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"lfczQhLLzN4",
    "title":"America 2 Mars?! Trump Urges American Engineers to Greatness",
    "description":"\"America should have the world's tallest buildings, design the fastest airplanes, build the greatest cars, do everything the absolute best, better than any other nation in the world... and we will soon land American astronauts on Mars.\" President Trump painted a glorious picture of American excellence to the graduating 2025 class of the University of Alabama in order to push engineers to use their talents to better the country. #shorts",
    "publishedAt":"2025-05-03T23:00:41Z",
    "duration_iso":"PT38S",
    "duration_seconds":38,
    "duration_hms":"0:00:38",
    "url":"https:\/\/www.youtube.com\/watch?v=lfczQhLLzN4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"6ZAdFNesqjM",
    "title":"Stephen Miller: It Would Have Been the End of the American Republic If Kamala Harris Won",
    "description":"While responding to a reporter about Kamala Harris's recent speech, Stephen Miller took the opportunity to tell the media that electing Kamala Harris as U.S. President would have ended America.",
    "publishedAt":"2025-05-03T16:45:01Z",
    "duration_iso":"PT1M20S",
    "duration_seconds":80,
    "duration_hms":"0:01:20",
    "url":"https:\/\/www.youtube.com\/watch?v=6ZAdFNesqjM"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"efWOAyE6riQ",
    "title":"ICE Agent: Biden Administration Immigration Policies Put the Public at Risk",
    "description":"As ICE was transporting illegal aliens to the Tampa International Airport who were going to be deported within the next 3 days, an agent told Breitbart's Matthew Perdie that the Biden administration's actions restricted ICE, which put the public at risk.",
    "publishedAt":"2025-05-03T13:15:05Z",
    "duration_iso":"PT1M4S",
    "duration_seconds":64,
    "duration_hms":"0:01:04",
    "url":"https:\/\/www.youtube.com\/watch?v=efWOAyE6riQ"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"F71kT5QAx2Q",
    "title":"\"We Have to Be Able to Trust Our Media\" Trump Exhorts Graduates to Build Trustworthy Media",
    "description":"\"Your task is so important, and it's to build a media that Americans can trust and remember.\" Echoing Andrew Breitbart, Donald Trump urged journalism majors and those interested in the topic to build a trusted new media to replace the old media institutions. #shorts",
    "publishedAt":"2025-05-03T13:00:22Z",
    "duration_iso":"PT57S",
    "duration_seconds":57,
    "duration_hms":"0:00:57",
    "url":"https:\/\/www.youtube.com\/watch?v=F71kT5QAx2Q"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"6taGx5p0low",
    "title":"Inspirational! Trump Asks Alabama Class of 2025 to Use Their Talents to \"Win for America\"",
    "description":"Inspirational! President Donald Trump asked the graduating Class of 2025 at the University of Alabama on Thursday night to use their talents and skills not only to win for themselves, but to invest in the country and \"win for America.\"",
    "publishedAt":"2025-05-02T22:00:07Z",
    "duration_iso":"PT3M39S",
    "duration_seconds":219,
    "duration_hms":"0:03:39",
    "url":"https:\/\/www.youtube.com\/watch?v=6taGx5p0low"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"rIJpboY0N1Q",
    "title":"Stephen Miller: Amazon Made \"Clear Attempt\" to Undermine U.S. Trade Negotiations with China",
    "description":"White House Deputy Chief of Staff Stephen Miller told the media why Amazon recently expressed intention to inform consumers of how much more expensive tariffs were making their products on a product-by-product basis.",
    "publishedAt":"2025-05-02T20:30:13Z",
    "duration_iso":"PT1M35S",
    "duration_seconds":95,
    "duration_hms":"0:01:35",
    "url":"https:\/\/www.youtube.com\/watch?v=rIJpboY0N1Q"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"2JQu6phWixM",
    "title":"Firemen Respond to Car Erupting in Flames in Middle of Intersection",
    "description":"A car was seen smoking as a driver stopped in the middle of an intersection to get out of the vehicle. The vehicle burst into flames, but firemen arrived to quickly put out the blaze in Cedar Rapids, IA, on April 30.",
    "publishedAt":"2025-05-02T18:30:02Z",
    "duration_iso":"PT1M21S",
    "duration_seconds":81,
    "duration_hms":"0:01:21",
    "url":"https:\/\/www.youtube.com\/watch?v=2JQu6phWixM"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"54LTa324Z9E",
    "title":"Tragic Fall: Pirates Fan in Critical Condition After Falling from Clemente Wall in PNC Park",
    "description":"A Pittsburgh Pirates fan is in critical condition after falling from the Clemente Wall in PNC Park during a game. The fan was carted off the field and taken to the hospital.",
    "publishedAt":"2025-05-02T17:00:10Z",
    "duration_iso":"PT2M20S",
    "duration_seconds":140,
    "duration_hms":"0:02:20",
    "url":"https:\/\/www.youtube.com\/watch?v=54LTa324Z9E"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"igEgg1s4-N8",
    "title":"SC Diver’s “Firsts” Include a Close Call with a Great White",
    "description":"A diving instructor exploring the Greenville Reef near Murrells Inlet, SC, had a once-in-a-lifetime encounter—a close swim with a great white shark. It capped off an unforgettable dive that also included a Mola Mola and a fever of cow-nose rays.",
    "publishedAt":"2025-05-02T00:00:47Z",
    "duration_iso":"PT26S",
    "duration_seconds":26,
    "duration_hms":"0:00:26",
    "url":"https:\/\/www.youtube.com\/watch?v=igEgg1s4-N8"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"iiQIG-aMn8k",
    "title":"Exclusive: See Inside Trump's Mass Deportation Program Targeting Gang Members, Criminal Aliens",
    "description":"President Donald Trump's Department of Homeland Security (DHS) carried out a first-of-its-kind sting operation across Florida by enlisting state and local police departments to help swiftly arrest and deport gang members and criminal illegal aliens.",
    "publishedAt":"2025-05-01T23:30:11Z",
    "duration_iso":"PT26S",
    "duration_seconds":26,
    "duration_hms":"0:00:26",
    "url":"https:\/\/www.youtube.com\/watch?v=iiQIG-aMn8k"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"4Qs9DNOfcuc",
    "title":"Exclusive: See Inside Trump's Mass Deportation Program Targeting Gang Members, Criminal Aliens",
    "description":"President Donald Trump's Department of Homeland Security (DHS) carried out a first-of-its-kind sting operation across Florida by enlisting state and local police departments to help swiftly arrest and deport gang members and criminal illegal aliens.",
    "publishedAt":"2025-05-01T23:30:01Z",
    "duration_iso":"PT8M28S",
    "duration_seconds":508,
    "duration_hms":"0:08:28",
    "url":"https:\/\/www.youtube.com\/watch?v=4Qs9DNOfcuc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"O2CijRqIxqs",
    "title":"Donald Trump Talks About His DOJ Task Force Meant to \"Eradicate\" Anti-Christian Bias",
    "description":"Speaking at a National Day of Prayer event held at the White House, Donald Trump remarked about how faith is now welcome in the White House, and talked about his DOJ task force meant to investigate and eradicate anti-Christian bias and discrimination. #shorts",
    "publishedAt":"2025-05-01T23:00:31Z",
    "duration_iso":"PT59S",
    "duration_seconds":59,
    "duration_hms":"0:00:59",
    "url":"https:\/\/www.youtube.com\/watch?v=O2CijRqIxqs"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"DTUepbZEqyE",
    "title":"Exclusive - Thune: Dems 'Floundering,' Suffering from 'Trump Derangement Syndrome'",
    "description":"Senate Majority Leader John Thune told Breitbart News exclusively that Democrat plans to impeach President Donald Trump for a third time if they get the majority back in either the House or Senate shows just how badly they are suffering from \"Trump Derangement Syndrome.\" Thune said Democrats are \"floundering\" as a party, and \"struggling to find an identity.\"",
    "publishedAt":"2025-05-01T22:45:00Z",
    "duration_iso":"PT6M7S",
    "duration_seconds":367,
    "duration_hms":"0:06:07",
    "url":"https:\/\/www.youtube.com\/watch?v=DTUepbZEqyE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"jTZeFwr_Xog",
    "title":"Rubio Slams Judges Trying to Conduct Foreign Policy over President Trump",
    "description":"Secretary of State Marco Rubio declared during a cabinet meeting with President Trump that he will not disclose to reporters or a judge official administration discussions with El Salvador about returning Abrego Garcia.",
    "publishedAt":"2025-05-01T21:15:06Z",
    "duration_iso":"PT40S",
    "duration_seconds":40,
    "duration_hms":"0:00:40",
    "url":"https:\/\/www.youtube.com\/watch?v=jTZeFwr_Xog"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"ZTlO8DYzSdc",
    "title":"Miller Goes Nuclear on Media: \"I Couldn't Pay You\" to Live Next to Criminal Illegals You Defend",
    "description":"Hypocrites! Donald Trump's Deputy Chief of Staff for Policy Stephen Miller excoriated reporters on Thursday, blasting them for being hypocrites and defending criminal illegal immigrants, people he claimed they pay exorbitant prices not to live near while wanting them to stay among their fellow American citizens.",
    "publishedAt":"2025-05-01T18:15:03Z",
    "duration_iso":"PT2M44S",
    "duration_seconds":164,
    "duration_hms":"0:02:44",
    "url":"https:\/\/www.youtube.com\/watch?v=ZTlO8DYzSdc"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"Rj0UbmnpTjE",
    "title":"Thune: Dems ‘Can Scream and Light Their Hair on Fire,’ But We Won’t Stop Confirming Trump Nominees",
    "description":"Senate Majority Leader John Thune described in an exclusive interview with Breitbart News how it's a new era in the U.S. Senate, and how Republicans have confirmed Trump's nominees for his Cabinet faster than any president in the past 20 years. The Senate has also voted more times in its first 100 days since the days when Ronald Reagan was president way back in the 1980s, and Thune pledged to keep plowing through the nominees and the agenda despite Democrat hysterics in opposition.",
    "publishedAt":"2025-05-01T17:30:06Z",
    "duration_iso":"PT5M19S",
    "duration_seconds":319,
    "duration_hms":"0:05:19",
    "url":"https:\/\/www.youtube.com\/watch?v=Rj0UbmnpTjE"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"hEFIVu6X2SM",
    "title":"Make School Lunch Great Again? RFK Launches Attack on \"Politicized\" Food",
    "description":"Making School Lunch Great Again?! Speaking during a Trump administration cabinet meeting Wednesday, RFK Jr. detailed his plans to revise the school lunch standards by August, as well as to boot both candy and soda from SNAP eligibility. #shorts",
    "publishedAt":"2025-05-01T16:01:05Z",
    "duration_iso":"PT1M3S",
    "duration_seconds":63,
    "duration_hms":"0:01:03",
    "url":"https:\/\/www.youtube.com\/watch?v=hEFIVu6X2SM"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"dFrwzfNCoUU",
    "title":"Scooter Getaway Gone Wrong for Suspected Fentanyl Dealer",
    "description":"Out of all the vehicles in the world! A Florida drug bust took an odd twist when a suspected fentanyl dealer's girlfriend and brother attempted a tandem scooter escape—only to be promptly apprehended. The suspect himself faces multiple charges, including armed trafficking.",
    "publishedAt":"2025-05-01T11:30:25Z",
    "duration_iso":"PT2M3S",
    "duration_seconds":123,
    "duration_hms":"0:02:03",
    "url":"https:\/\/www.youtube.com\/watch?v=dFrwzfNCoUU"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"H-Ha-WU3pc4",
    "title":"Alabama 'Roo! Loose Kangaroo Hops Down Side of Alabama Interstate",
    "description":"Alabama 'roo on the loose! A kangaroo was spotted hopping down I-85 in Macon County, Alabama, on Monday. #shorts",
    "publishedAt":"2025-05-01T03:00:17Z",
    "duration_iso":"PT24S",
    "duration_seconds":24,
    "duration_hms":"0:00:24",
    "url":"https:\/\/www.youtube.com\/watch?v=H-Ha-WU3pc4"
  },
  {
    "channel_title":"Breitbart News",
    "video_id":"tTQhRhlFzsM",
    "title":"Fluoride in HHS Crosshairs! RFK Claims Studies Show Fluoride Lowers IQ",
    "description":"Fluoride in the crosshairs of the HHS? Health and Human Services Secretary RFK Jr. cited the NIH's National Toxicity Program determining that fluoride exposure had an effect of lowering IQ in children. #shorts",
    "publishedAt":"2025-05-01T01:00:54Z",
    "duration_iso":"PT23S",
    "duration_seconds":23,
    "duration_hms":"0:00:23",
    "url":"https:\/\/www.youtube.com\/watch?v=tTQhRhlFzsM"
  }
]